export default [
//     {
//     co: '000000',
//     na: "选择省份",
//     ch: [{
//         co: '000000',
//         na: "选择城市",
//         ch: [{
//             co: '000000',
//             na: "选择地区"
//         }]
//     }]
// },
{
    co: "110000",
    na: "北京",
    ch: [{
        co: "110100",
        na: "北京市",
        ch: [{
            co: "110101",
            na: "东城区"
        },
        {
            co: "110102",
            na: "西城区"
        },
        {
            co: "110105",
            na: "朝阳区"
        },
        {
            co: "110106",
            na: "丰台区"
        },
        {
            co: "110107",
            na: "石景山区"
        },
        {
            co: "110108",
            na: "海淀区"
        },
        {
            co: "110109",
            na: "门头沟区"
        },
        {
            co: "110111",
            na: "房山区"
        },
        {
            co: "110112",
            na: "通州区"
        },
        {
            co: "110113",
            na: "顺义区"
        },
        {
            co: "110114",
            na: "昌平区"
        },
        {
            co: "110115",
            na: "大兴区"
        },
        {
            co: "110116",
            na: "怀柔区"
        },
        {
            co: "110117",
            na: "平谷区"
        },
        {
            co: "110118",
            na: "密云区"
        },
        {
            co: "110119",
            na: "延庆区"
        },
        {
            co: "110120",
            na: "中关村科技园区"
        }]
    }]
},
{
    co: "120000",
    na: "天津",
    ch: [{
        co: "120100",
        na: "天津市",
        ch: [{
            co: "120101",
            na: "和平区"
        },
        {
            co: "120102",
            na: "河东区"
        },
        {
            co: "120103",
            na: "河西区"
        },
        {
            co: "120104",
            na: "南开区"
        },
        {
            co: "120105",
            na: "河北区"
        },
        {
            co: "120106",
            na: "红桥区"
        },
        {
            co: "120110",
            na: "东丽区"
        },
        {
            co: "120111",
            na: "西青区"
        },
        {
            co: "120112",
            na: "津南区"
        },
        {
            co: "120113",
            na: "北辰区"
        },
        {
            co: "120114",
            na: "武清区"
        },
        {
            co: "120115",
            na: "宝坻区"
        },
        {
            co: "120116",
            na: "滨海新区"
        },
        {
            co: "120117",
            na: "宁河区"
        },
        {
            co: "120118",
            na: "静海区"
        },
        {
            co: "120225",
            na: "蓟州区"
        },
        {
            co: "120226",
            na: "滨海高新区"
        }]
    }]
},
{
    co: "130000",
    na: "河北",
    ch: [{
        co: "130100",
        na: "石家庄市",
        ch: [{
            co: "130102",
            na: "长安区"
        },
        {
            co: "130104",
            na: "桥西区"
        },
        {
            co: "130105",
            na: "新华区"
        },
        {
            co: "130107",
            na: "井陉矿区"
        },
        {
            co: "130108",
            na: "裕华区"
        },
        {
            co: "130109",
            na: "藁城区"
        },
        {
            co: "130110",
            na: "鹿泉区"
        },
        {
            co: "130111",
            na: "栾城区"
        },
        {
            co: "130121",
            na: "井陉县"
        },
        {
            co: "130123",
            na: "正定县"
        },
        {
            co: "130125",
            na: "行唐县"
        },
        {
            co: "130126",
            na: "灵寿县"
        },
        {
            co: "130127",
            na: "高邑县"
        },
        {
            co: "130128",
            na: "深泽县"
        },
        {
            co: "130129",
            na: "赞皇县"
        },
        {
            co: "130130",
            na: "无极县"
        },
        {
            co: "130131",
            na: "平山县"
        },
        {
            co: "130132",
            na: "元氏县"
        },
        {
            co: "130133",
            na: "赵县"
        },
        {
            co: "130181",
            na: "辛集市"
        },
        {
            co: "130183",
            na: "晋州市"
        },
        {
            co: "130184",
            na: "新乐市"
        },
        {
            co: "130185",
            na: "高新区"
        }]
    },
    {
        co: "130200",
        na: "唐山市",
        ch: [{
            co: "130202",
            na: "路南区"
        },
        {
            co: "130203",
            na: "路北区"
        },
        {
            co: "130204",
            na: "古冶区"
        },
        {
            co: "130205",
            na: "开平区"
        },
        {
            co: "130207",
            na: "丰南区"
        },
        {
            co: "130208",
            na: "丰润区"
        },
        {
            co: "130209",
            na: "曹妃甸区"
        },
        {
            co: "130223",
            na: "滦县"
        },
        {
            co: "130224",
            na: "滦南县"
        },
        {
            co: "130225",
            na: "乐亭县"
        },
        {
            co: "130227",
            na: "迁西县"
        },
        {
            co: "130229",
            na: "玉田县"
        },
        {
            co: "130281",
            na: "遵化市"
        },
        {
            co: "130283",
            na: "迁安市"
        }]
    },
    {
        co: "130300",
        na: "秦皇岛市",
        ch: [{
            co: "130302",
            na: "海港区"
        },
        {
            co: "130303",
            na: "山海关区"
        },
        {
            co: "130304",
            na: "北戴河区"
        },
        {
            co: "130306",
            na: "抚宁区"
        },
        {
            co: "130321",
            na: "青龙满族自治县"
        },
        {
            co: "130322",
            na: "昌黎县"
        },
        {
            co: "130324",
            na: "卢龙县"
        },
        {
            co: "130325",
            na: "北戴河新区"
        }]
    },
    {
        co: "130400",
        na: "邯郸市",
        ch: [{
            co: "130402",
            na: "邯山区"
        },
        {
            co: "130403",
            na: "丛台区"
        },
        {
            co: "130404",
            na: "复兴区"
        },
        {
            co: "130406",
            na: "峰峰矿区"
        },
        {
            co: "130421",
            na: "邯郸县"
        },
        {
            co: "130423",
            na: "临漳县"
        },
        {
            co: "130424",
            na: "成安县"
        },
        {
            co: "130425",
            na: "大名县"
        },
        {
            co: "130426",
            na: "涉县"
        },
        {
            co: "130427",
            na: "磁县"
        },
        {
            co: "130428",
            na: "肥乡县"
        },
        {
            co: "130429",
            na: "永年县"
        },
        {
            co: "130430",
            na: "邱县"
        },
        {
            co: "130431",
            na: "鸡泽县"
        },
        {
            co: "130432",
            na: "广平县"
        },
        {
            co: "130433",
            na: "馆陶县"
        },
        {
            co: "130434",
            na: "魏县"
        },
        {
            co: "130435",
            na: "曲周县"
        },
        {
            co: "130481",
            na: "武安市"
        }]
    },
    {
        co: "130500",
        na: "邢台市",
        ch: [{
            co: "130502",
            na: "桥东区"
        },
        {
            co: "130503",
            na: "桥西区"
        },
        {
            co: "130521",
            na: "邢台县"
        },
        {
            co: "130522",
            na: "临城县"
        },
        {
            co: "130523",
            na: "内丘县"
        },
        {
            co: "130524",
            na: "柏乡县"
        },
        {
            co: "130525",
            na: "隆尧县"
        },
        {
            co: "130526",
            na: "任县"
        },
        {
            co: "130527",
            na: "南和县"
        },
        {
            co: "130528",
            na: "宁晋县"
        },
        {
            co: "130529",
            na: "巨鹿县"
        },
        {
            co: "130530",
            na: "新河县"
        },
        {
            co: "130531",
            na: "广宗县"
        },
        {
            co: "130532",
            na: "平乡县"
        },
        {
            co: "130533",
            na: "威县"
        },
        {
            co: "130534",
            na: "清河县"
        },
        {
            co: "130535",
            na: "临西县"
        },
        {
            co: "130581",
            na: "南宫市"
        },
        {
            co: "130582",
            na: "沙河市"
        }]
    },
    {
        co: "130600",
        na: "保定市",
        ch: [{
            co: "130602",
            na: "竞秀区"
        },
        {
            co: "130606",
            na: "莲池区"
        },
        {
            co: "130607",
            na: "满城区"
        },
        {
            co: "130608",
            na: "清苑区"
        },
        {
            co: "130609",
            na: "徐水区"
        },
        {
            co: "130623",
            na: "涞水县"
        },
        {
            co: "130624",
            na: "阜平县"
        },
        {
            co: "130626",
            na: "定兴县"
        },
        {
            co: "130627",
            na: "唐县"
        },
        {
            co: "130628",
            na: "高阳县"
        },
        {
            co: "130629",
            na: "容城县"
        },
        {
            co: "130630",
            na: "涞源县"
        },
        {
            co: "130631",
            na: "望都县"
        },
        {
            co: "130632",
            na: "安新县"
        },
        {
            co: "130633",
            na: "易县"
        },
        {
            co: "130634",
            na: "曲阳县"
        },
        {
            co: "130635",
            na: "蠡县"
        },
        {
            co: "130636",
            na: "顺平县"
        },
        {
            co: "130637",
            na: "博野县"
        },
        {
            co: "130638",
            na: "雄县"
        },
        {
            co: "130681",
            na: "涿州市"
        },
        {
            co: "130682",
            na: "定州市"
        },
        {
            co: "130683",
            na: "安国市"
        },
        {
            co: "130684",
            na: "高碑店市"
        }]
    },
    {
        co: "130700",
        na: "张家口市",
        ch: [{
            co: "130702",
            na: "桥东区"
        },
        {
            co: "130703",
            na: "桥西区"
        },
        {
            co: "130705",
            na: "宣化区"
        },
        {
            co: "130706",
            na: "下花园区"
        },
        {
            co: "130722",
            na: "张北县"
        },
        {
            co: "130723",
            na: "康保县"
        },
        {
            co: "130724",
            na: "沽源县"
        },
        {
            co: "130725",
            na: "尚义县"
        },
        {
            co: "130726",
            na: "蔚县"
        },
        {
            co: "130727",
            na: "阳原县"
        },
        {
            co: "130728",
            na: "怀安县"
        },
        {
            co: "130729",
            na: "万全区"
        },
        {
            co: "130730",
            na: "怀来县"
        },
        {
            co: "130731",
            na: "涿鹿县"
        },
        {
            co: "130732",
            na: "赤城县"
        },
        {
            co: "130733",
            na: "崇礼区"
        }]
    },
    {
        co: "130800",
        na: "承德市",
        ch: [{
            co: "130802",
            na: "双桥区"
        },
        {
            co: "130803",
            na: "双滦区"
        },
        {
            co: "130804",
            na: "鹰手营子矿区"
        },
        {
            co: "130821",
            na: "承德县"
        },
        {
            co: "130822",
            na: "兴隆县"
        },
        {
            co: "130823",
            na: "平泉县"
        },
        {
            co: "130824",
            na: "滦平县"
        },
        {
            co: "130825",
            na: "隆化县"
        },
        {
            co: "130826",
            na: "丰宁满族自治县"
        },
        {
            co: "130827",
            na: "宽城满族自治县"
        },
        {
            co: "130828",
            na: "围场满族蒙古族自治县"
        }]
    },
    {
        co: "130900",
        na: "沧州市",
        ch: [{
            co: "130902",
            na: "新华区"
        },
        {
            co: "130903",
            na: "运河区"
        },
        {
            co: "130921",
            na: "沧县"
        },
        {
            co: "130922",
            na: "青县"
        },
        {
            co: "130923",
            na: "东光县"
        },
        {
            co: "130924",
            na: "海兴县"
        },
        {
            co: "130925",
            na: "盐山县"
        },
        {
            co: "130926",
            na: "肃宁县"
        },
        {
            co: "130927",
            na: "南皮县"
        },
        {
            co: "130928",
            na: "吴桥县"
        },
        {
            co: "130929",
            na: "献县"
        },
        {
            co: "130930",
            na: "孟村回族自治县"
        },
        {
            co: "130981",
            na: "泊头市"
        },
        {
            co: "130982",
            na: "任丘市"
        },
        {
            co: "130983",
            na: "黄骅市"
        },
        {
            co: "130984",
            na: "河间市"
        },
        {
            co: "130985",
            na: "渤海新区"
        }]
    },
    {
        co: "131000",
        na: "廊坊市",
        ch: [{
            co: "131002",
            na: "安次区"
        },
        {
            co: "131003",
            na: "广阳区"
        },
        {
            co: "131022",
            na: "固安县"
        },
        {
            co: "131023",
            na: "永清县"
        },
        {
            co: "131024",
            na: "香河县"
        },
        {
            co: "131025",
            na: "大城县"
        },
        {
            co: "131026",
            na: "文安县"
        },
        {
            co: "131028",
            na: "大厂回族自治县"
        },
        {
            co: "131081",
            na: "霸州市"
        },
        {
            co: "131082",
            na: "三河市"
        }]
    },
    {
        co: "131100",
        na: "衡水市",
        ch: [{
            co: "131102",
            na: "桃城区"
        },
        {
            co: "131121",
            na: "枣强县"
        },
        {
            co: "131122",
            na: "武邑县"
        },
        {
            co: "131123",
            na: "武强县"
        },
        {
            co: "131124",
            na: "饶阳县"
        },
        {
            co: "131125",
            na: "安平县"
        },
        {
            co: "131126",
            na: "故城县"
        },
        {
            co: "131127",
            na: "景县"
        },
        {
            co: "131128",
            na: "阜城县"
        },
        {
            co: "131181",
            na: "冀州区"
        },
        {
            co: "131182",
            na: "深州市"
        }]
    }]
},
{
    co: "140000",
    na: "山西",
    ch: [{
        co: "140100",
        na: "太原市",
        ch: [{
            co: "140105",
            na: "小店区"
        },
        {
            co: "140106",
            na: "迎泽区"
        },
        {
            co: "140107",
            na: "杏花岭区"
        },
        {
            co: "140108",
            na: "尖草坪区"
        },
        {
            co: "140109",
            na: "万柏林区"
        },
        {
            co: "140110",
            na: "晋源区"
        },
        {
            co: "140121",
            na: "清徐县"
        },
        {
            co: "140122",
            na: "阳曲县"
        },
        {
            co: "140123",
            na: "娄烦县"
        },
        {
            co: "140181",
            na: "古交市"
        },
        {
            co: "140182",
            na: "高新阳曲园区"
        },
        {
            co: "140183",
            na: "高新汾东园区"
        },
        {
            co: "140184",
            na: "高新姚村园区"
        }]
    },
    {
        co: "140200",
        na: "大同市",
        ch: [{
            co: "140202",
            na: "城区"
        },
        {
            co: "140203",
            na: "矿区"
        },
        {
            co: "140211",
            na: "南郊区"
        },
        {
            co: "140212",
            na: "新荣区"
        },
        {
            co: "140221",
            na: "阳高县"
        },
        {
            co: "140222",
            na: "天镇县"
        },
        {
            co: "140223",
            na: "广灵县"
        },
        {
            co: "140224",
            na: "灵丘县"
        },
        {
            co: "140225",
            na: "浑源县"
        },
        {
            co: "140226",
            na: "左云县"
        },
        {
            co: "140227",
            na: "大同县"
        },
        {
            co: "140228",
            na: "经济开发区"
        }]
    },
    {
        co: "140300",
        na: "阳泉市",
        ch: [{
            co: "140302",
            na: "城区"
        },
        {
            co: "140303",
            na: "矿区"
        },
        {
            co: "140311",
            na: "郊区"
        },
        {
            co: "140321",
            na: "平定县"
        },
        {
            co: "140322",
            na: "盂县"
        }]
    },
    {
        co: "140400",
        na: "长治市",
        ch: [{
            co: "140402",
            na: "城区"
        },
        {
            co: "140411",
            na: "郊区"
        },
        {
            co: "140421",
            na: "长治县"
        },
        {
            co: "140423",
            na: "襄垣县"
        },
        {
            co: "140424",
            na: "屯留县"
        },
        {
            co: "140425",
            na: "平顺县"
        },
        {
            co: "140426",
            na: "黎城县"
        },
        {
            co: "140427",
            na: "壶关县"
        },
        {
            co: "140428",
            na: "长子县"
        },
        {
            co: "140429",
            na: "武乡县"
        },
        {
            co: "140430",
            na: "沁县"
        },
        {
            co: "140431",
            na: "沁源县"
        },
        {
            co: "140481",
            na: "潞城市"
        }]
    },
    {
        co: "140500",
        na: "晋城市",
        ch: [{
            co: "140502",
            na: "城区"
        },
        {
            co: "140521",
            na: "沁水县"
        },
        {
            co: "140522",
            na: "阳城县"
        },
        {
            co: "140524",
            na: "陵川县"
        },
        {
            co: "140525",
            na: "泽州县"
        },
        {
            co: "140581",
            na: "高平市"
        },
        {
            co: "140582",
            na: "经济开发区"
        }]
    },
    {
        co: "140600",
        na: "朔州市",
        ch: [{
            co: "140602",
            na: "朔城区"
        },
        {
            co: "140603",
            na: "平鲁区"
        },
        {
            co: "140621",
            na: "山阴县"
        },
        {
            co: "140622",
            na: "应县"
        },
        {
            co: "140623",
            na: "右玉县"
        },
        {
            co: "140624",
            na: "怀仁县"
        }]
    },
    {
        co: "140700",
        na: "晋中市",
        ch: [{
            co: "140702",
            na: "榆次区"
        },
        {
            co: "140721",
            na: "榆社县"
        },
        {
            co: "140722",
            na: "左权县"
        },
        {
            co: "140723",
            na: "和顺县"
        },
        {
            co: "140724",
            na: "昔阳县"
        },
        {
            co: "140725",
            na: "寿阳县"
        },
        {
            co: "140726",
            na: "太谷县"
        },
        {
            co: "140727",
            na: "祁县"
        },
        {
            co: "140728",
            na: "平遥县"
        },
        {
            co: "140729",
            na: "灵石县"
        },
        {
            co: "140781",
            na: "介休市"
        }]
    },
    {
        co: "140800",
        na: "运城市",
        ch: [{
            co: "140802",
            na: "盐湖区"
        },
        {
            co: "140821",
            na: "临猗县"
        },
        {
            co: "140822",
            na: "万荣县"
        },
        {
            co: "140823",
            na: "闻喜县"
        },
        {
            co: "140824",
            na: "稷山县"
        },
        {
            co: "140825",
            na: "新绛县"
        },
        {
            co: "140826",
            na: "绛县"
        },
        {
            co: "140827",
            na: "垣曲县"
        },
        {
            co: "140828",
            na: "夏县"
        },
        {
            co: "140829",
            na: "平陆县"
        },
        {
            co: "140830",
            na: "芮城县"
        },
        {
            co: "140881",
            na: "永济市"
        },
        {
            co: "140882",
            na: "河津市"
        }]
    },
    {
        co: "140900",
        na: "忻州市",
        ch: [{
            co: "140902",
            na: "忻府区"
        },
        {
            co: "140921",
            na: "定襄县"
        },
        {
            co: "140922",
            na: "五台县"
        },
        {
            co: "140923",
            na: "代县"
        },
        {
            co: "140924",
            na: "繁峙县"
        },
        {
            co: "140925",
            na: "宁武县"
        },
        {
            co: "140926",
            na: "静乐县"
        },
        {
            co: "140927",
            na: "神池县"
        },
        {
            co: "140928",
            na: "五寨县"
        },
        {
            co: "140929",
            na: "岢岚县"
        },
        {
            co: "140930",
            na: "河曲县"
        },
        {
            co: "140931",
            na: "保德县"
        },
        {
            co: "140932",
            na: "偏关县"
        },
        {
            co: "140981",
            na: "原平市"
        }]
    },
    {
        co: "141000",
        na: "临汾市",
        ch: [{
            co: "141002",
            na: "尧都区"
        },
        {
            co: "141021",
            na: "曲沃县"
        },
        {
            co: "141022",
            na: "翼城县"
        },
        {
            co: "141023",
            na: "襄汾县"
        },
        {
            co: "141024",
            na: "洪洞县"
        },
        {
            co: "141025",
            na: "古县"
        },
        {
            co: "141026",
            na: "安泽县"
        },
        {
            co: "141027",
            na: "浮山县"
        },
        {
            co: "141028",
            na: "吉县"
        },
        {
            co: "141029",
            na: "乡宁县"
        },
        {
            co: "141030",
            na: "大宁县"
        },
        {
            co: "141031",
            na: "隰县"
        },
        {
            co: "141032",
            na: "永和县"
        },
        {
            co: "141033",
            na: "蒲县"
        },
        {
            co: "141034",
            na: "汾西县"
        },
        {
            co: "141081",
            na: "侯马市"
        },
        {
            co: "141082",
            na: "霍州市"
        }]
    },
    {
        co: "141100",
        na: "吕梁市",
        ch: [{
            co: "141102",
            na: "离石区"
        },
        {
            co: "141121",
            na: "文水县"
        },
        {
            co: "141122",
            na: "交城县"
        },
        {
            co: "141123",
            na: "兴县"
        },
        {
            co: "141124",
            na: "临县"
        },
        {
            co: "141125",
            na: "柳林县"
        },
        {
            co: "141126",
            na: "石楼县"
        },
        {
            co: "141127",
            na: "岚县"
        },
        {
            co: "141128",
            na: "方山县"
        },
        {
            co: "141129",
            na: "中阳县"
        },
        {
            co: "141130",
            na: "交口县"
        },
        {
            co: "141181",
            na: "孝义市"
        },
        {
            co: "141182",
            na: "汾阳市"
        }]
    }]
},
{
    co: "150000",
    na: "内蒙古",
    ch: [{
        co: "150100",
        na: "呼和浩特市",
        ch: [{
            co: "150102",
            na: "新城区"
        },
        {
            co: "150103",
            na: "回民区"
        },
        {
            co: "150104",
            na: "玉泉区"
        },
        {
            co: "150105",
            na: "赛罕区"
        },
        {
            co: "150121",
            na: "土默特左旗"
        },
        {
            co: "150122",
            na: "托克托县"
        },
        {
            co: "150123",
            na: "和林格尔县"
        },
        {
            co: "150124",
            na: "清水河县"
        },
        {
            co: "150125",
            na: "武川县"
        }]
    },
    {
        co: "150200",
        na: "包头市",
        ch: [{
            co: "150202",
            na: "东河区"
        },
        {
            co: "150203",
            na: "昆都仑区"
        },
        {
            co: "150204",
            na: "青山区"
        },
        {
            co: "150205",
            na: "石拐区"
        },
        {
            co: "150206",
            na: "白云鄂博矿区"
        },
        {
            co: "150207",
            na: "九原区"
        },
        {
            co: "150221",
            na: "土默特右旗"
        },
        {
            co: "150222",
            na: "固阳县"
        },
        {
            co: "150223",
            na: "达尔罕茂明安联合旗"
        }]
    },
    {
        co: "150300",
        na: "乌海市",
        ch: [{
            co: "150302",
            na: "海勃湾区"
        },
        {
            co: "150303",
            na: "海南区"
        },
        {
            co: "150304",
            na: "乌达区"
        }]
    },
    {
        co: "150400",
        na: "赤峰市",
        ch: [{
            co: "150402",
            na: "红山区"
        },
        {
            co: "150403",
            na: "元宝山区"
        },
        {
            co: "150404",
            na: "松山区"
        },
        {
            co: "150421",
            na: "阿鲁科尔沁旗"
        },
        {
            co: "150422",
            na: "巴林左旗"
        },
        {
            co: "150423",
            na: "巴林右旗"
        },
        {
            co: "150424",
            na: "林西县"
        },
        {
            co: "150425",
            na: "克什克腾旗"
        },
        {
            co: "150426",
            na: "翁牛特旗"
        },
        {
            co: "150428",
            na: "喀喇沁旗"
        },
        {
            co: "150429",
            na: "宁城县"
        },
        {
            co: "150430",
            na: "敖汉旗"
        }]
    },
    {
        co: "150500",
        na: "通辽市",
        ch: [{
            co: "150502",
            na: "科尔沁区"
        },
        {
            co: "150521",
            na: "科尔沁左翼中旗"
        },
        {
            co: "150522",
            na: "科尔沁左翼后旗"
        },
        {
            co: "150523",
            na: "开鲁县"
        },
        {
            co: "150524",
            na: "库伦旗"
        },
        {
            co: "150525",
            na: "奈曼旗"
        },
        {
            co: "150526",
            na: "扎鲁特旗"
        },
        {
            co: "150581",
            na: "霍林郭勒市"
        }]
    },
    {
        co: "150600",
        na: "鄂尔多斯市",
        ch: [{
            co: "150602",
            na: "东胜区"
        },
        {
            co: "150621",
            na: "达拉特旗"
        },
        {
            co: "150622",
            na: "准格尔旗"
        },
        {
            co: "150623",
            na: "鄂托克前旗"
        },
        {
            co: "150624",
            na: "鄂托克旗"
        },
        {
            co: "150625",
            na: "杭锦旗"
        },
        {
            co: "150626",
            na: "乌审旗"
        },
        {
            co: "150627",
            na: "伊金霍洛旗"
        },
        {
            co: "150628",
            na: "康巴什区"
        }]
    },
    {
        co: "150700",
        na: "呼伦贝尔市",
        ch: [{
            co: "150702",
            na: "海拉尔区"
        },
        {
            co: "150703",
            na: "扎赉诺尔区"
        },
        {
            co: "150721",
            na: "阿荣旗"
        },
        {
            co: "150722",
            na: "莫力达瓦达斡尔族自治旗"
        },
        {
            co: "150723",
            na: "鄂伦春自治旗"
        },
        {
            co: "150724",
            na: "鄂温克族自治旗"
        },
        {
            co: "150725",
            na: "陈巴尔虎旗"
        },
        {
            co: "150726",
            na: "新巴尔虎左旗"
        },
        {
            co: "150727",
            na: "新巴尔虎右旗"
        },
        {
            co: "150781",
            na: "满洲里市"
        },
        {
            co: "150782",
            na: "牙克石市"
        },
        {
            co: "150783",
            na: "扎兰屯市"
        },
        {
            co: "150784",
            na: "额尔古纳市"
        },
        {
            co: "150785",
            na: "根河市"
        }]
    },
    {
        co: "150800",
        na: "巴彦淖尔市",
        ch: [{
            co: "150802",
            na: "临河区"
        },
        {
            co: "150821",
            na: "五原县"
        },
        {
            co: "150822",
            na: "磴口县"
        },
        {
            co: "150823",
            na: "乌拉特前旗"
        },
        {
            co: "150824",
            na: "乌拉特中旗"
        },
        {
            co: "150825",
            na: "乌拉特后旗"
        },
        {
            co: "150826",
            na: "杭锦后旗"
        }]
    },
    {
        co: "150900",
        na: "乌兰察布市",
        ch: [{
            co: "150902",
            na: "集宁区"
        },
        {
            co: "150921",
            na: "卓资县"
        },
        {
            co: "150922",
            na: "化德县"
        },
        {
            co: "150923",
            na: "商都县"
        },
        {
            co: "150924",
            na: "兴和县"
        },
        {
            co: "150925",
            na: "凉城县"
        },
        {
            co: "150926",
            na: "察哈尔右翼前旗"
        },
        {
            co: "150927",
            na: "察哈尔右翼中旗"
        },
        {
            co: "150928",
            na: "察哈尔右翼后旗"
        },
        {
            co: "150929",
            na: "四子王旗"
        },
        {
            co: "150981",
            na: "丰镇市"
        }]
    },
    {
        co: "152200",
        na: "兴安盟",
        ch: [{
            co: "152201",
            na: "乌兰浩特市"
        },
        {
            co: "152202",
            na: "阿尔山市"
        },
        {
            co: "152221",
            na: "科尔沁右翼前旗"
        },
        {
            co: "152222",
            na: "科尔沁右翼中旗"
        },
        {
            co: "152223",
            na: "扎赉特旗"
        },
        {
            co: "152224",
            na: "突泉县"
        }]
    },
    {
        co: "152500",
        na: "锡林郭勒盟",
        ch: [{
            co: "152501",
            na: "二连浩特市"
        },
        {
            co: "152502",
            na: "锡林浩特市"
        },
        {
            co: "152522",
            na: "阿巴嘎旗"
        },
        {
            co: "152523",
            na: "苏尼特左旗"
        },
        {
            co: "152524",
            na: "苏尼特右旗"
        },
        {
            co: "152525",
            na: "东乌珠穆沁旗"
        },
        {
            co: "152526",
            na: "西乌珠穆沁旗"
        },
        {
            co: "152527",
            na: "太仆寺旗"
        },
        {
            co: "152528",
            na: "镶黄旗"
        },
        {
            co: "152529",
            na: "正镶白旗"
        },
        {
            co: "152530",
            na: "正蓝旗"
        },
        {
            co: "152531",
            na: "多伦县"
        }]
    },
    {
        co: "152900",
        na: "阿拉善盟",
        ch: [{
            co: "152921",
            na: "阿拉善左旗"
        },
        {
            co: "152922",
            na: "阿拉善右旗"
        },
        {
            co: "152923",
            na: "额济纳旗"
        }]
    }]
},
{
    co: "210000",
    na: "辽宁",
    ch: [{
        co: "210100",
        na: "沈阳市",
        ch: [{
            co: "210102",
            na: "和平区"
        },
        {
            co: "210103",
            na: "沈河区"
        },
        {
            co: "210104",
            na: "大东区"
        },
        {
            co: "210105",
            na: "皇姑区"
        },
        {
            co: "210106",
            na: "铁西区"
        },
        {
            co: "210111",
            na: "苏家屯区"
        },
        {
            co: "210112",
            na: "浑南新区"
        },
        {
            co: "210113",
            na: "沈北新区"
        },
        {
            co: "210114",
            na: "于洪区"
        },
        {
            co: "210115",
            na: "辽中区"
        },
        {
            co: "210123",
            na: "康平县"
        },
        {
            co: "210124",
            na: "法库县"
        },
        {
            co: "210181",
            na: "新民市"
        },
        {
            co: "210182",
            na: "高新区"
        }]
    },
    {
        co: "210200",
        na: "大连市",
        ch: [{
            co: "210202",
            na: "中山区"
        },
        {
            co: "210203",
            na: "西岗区"
        },
        {
            co: "210204",
            na: "沙河口区"
        },
        {
            co: "210211",
            na: "甘井子区"
        },
        {
            co: "210212",
            na: "旅顺口区"
        },
        {
            co: "210213",
            na: "金州区"
        },
        {
            co: "210214",
            na: "普兰店市"
        },
        {
            co: "210224",
            na: "长海县"
        },
        {
            co: "210281",
            na: "瓦房店市"
        },
        {
            co: "210283",
            na: "庄河市"
        },
        {
            co: "210284",
            na: "高新区"
        },
        {
            co: "210285",
            na: "经济开发区"
        },
        {
            co: "210286",
            na: "金普新区"
        }]
    },
    {
        co: "210300",
        na: "鞍山市",
        ch: [{
            co: "210302",
            na: "铁东区"
        },
        {
            co: "210303",
            na: "铁西区"
        },
        {
            co: "210304",
            na: "立山区"
        },
        {
            co: "210311",
            na: "千山区"
        },
        {
            co: "210321",
            na: "台安县"
        },
        {
            co: "210323",
            na: "岫岩满族自治县"
        },
        {
            co: "210381",
            na: "海城市"
        },
        {
            co: "210382",
            na: "高新区"
        }]
    },
    {
        co: "210400",
        na: "抚顺市",
        ch: [{
            co: "210402",
            na: "新抚区"
        },
        {
            co: "210403",
            na: "东洲区"
        },
        {
            co: "210404",
            na: "望花区"
        },
        {
            co: "210411",
            na: "顺城区"
        },
        {
            co: "210421",
            na: "抚顺县"
        },
        {
            co: "210422",
            na: "新宾满族自治县"
        },
        {
            co: "210423",
            na: "清原满族自治县"
        }]
    },
    {
        co: "210500",
        na: "本溪市",
        ch: [{
            co: "210502",
            na: "平山区"
        },
        {
            co: "210503",
            na: "溪湖区"
        },
        {
            co: "210504",
            na: "明山区"
        },
        {
            co: "210505",
            na: "南芬区"
        },
        {
            co: "210521",
            na: "本溪满族自治县"
        },
        {
            co: "210522",
            na: "桓仁满族自治县"
        }]
    },
    {
        co: "210600",
        na: "丹东市",
        ch: [{
            co: "210602",
            na: "元宝区"
        },
        {
            co: "210603",
            na: "振兴区"
        },
        {
            co: "210604",
            na: "振安区"
        },
        {
            co: "210624",
            na: "宽甸满族自治县"
        },
        {
            co: "210681",
            na: "东港市"
        },
        {
            co: "210682",
            na: "凤城市"
        }]
    },
    {
        co: "210700",
        na: "锦州市",
        ch: [{
            co: "210702",
            na: "古塔区"
        },
        {
            co: "210703",
            na: "凌河区"
        },
        {
            co: "210711",
            na: "太和区"
        },
        {
            co: "210726",
            na: "黑山县"
        },
        {
            co: "210727",
            na: "义县"
        },
        {
            co: "210781",
            na: "凌海市"
        },
        {
            co: "210782",
            na: "北镇市"
        },
        {
            co: "210783",
            na: "松山新区"
        },
        {
            co: "210784",
            na: "龙栖湾新区"
        },
        {
            co: "210785",
            na: "经济技术开发区"
        }]
    },
    {
        co: "210800",
        na: "营口市",
        ch: [{
            co: "210802",
            na: "站前区"
        },
        {
            co: "210803",
            na: "西市区"
        },
        {
            co: "210804",
            na: "鲅鱼圈区"
        },
        {
            co: "210811",
            na: "老边区"
        },
        {
            co: "210881",
            na: "盖州市"
        },
        {
            co: "210882",
            na: "大石桥市"
        }]
    },
    {
        co: "210900",
        na: "阜新市",
        ch: [{
            co: "210902",
            na: "海州区"
        },
        {
            co: "210903",
            na: "新邱区"
        },
        {
            co: "210904",
            na: "太平区"
        },
        {
            co: "210905",
            na: "清河门区"
        },
        {
            co: "210911",
            na: "细河区"
        },
        {
            co: "210921",
            na: "阜新蒙古族自治县"
        },
        {
            co: "210922",
            na: "彰武县"
        }]
    },
    {
        co: "211000",
        na: "辽阳市",
        ch: [{
            co: "211002",
            na: "白塔区"
        },
        {
            co: "211003",
            na: "文圣区"
        },
        {
            co: "211004",
            na: "宏伟区"
        },
        {
            co: "211005",
            na: "弓长岭区"
        },
        {
            co: "211011",
            na: "太子河区"
        },
        {
            co: "211021",
            na: "辽阳县"
        },
        {
            co: "211081",
            na: "灯塔市"
        }]
    },
    {
        co: "211100",
        na: "盘锦市",
        ch: [{
            co: "211102",
            na: "双台子区"
        },
        {
            co: "211103",
            na: "兴隆台区"
        },
        {
            co: "211104",
            na: "大洼区"
        },
        {
            co: "211122",
            na: "盘山县"
        }]
    },
    {
        co: "211200",
        na: "铁岭市",
        ch: [{
            co: "211202",
            na: "银州区"
        },
        {
            co: "211204",
            na: "清河区"
        },
        {
            co: "211221",
            na: "铁岭县"
        },
        {
            co: "211223",
            na: "西丰县"
        },
        {
            co: "211224",
            na: "昌图县"
        },
        {
            co: "211281",
            na: "调兵山市"
        },
        {
            co: "211282",
            na: "开原市"
        }]
    },
    {
        co: "211300",
        na: "朝阳市",
        ch: [{
            co: "211302",
            na: "双塔区"
        },
        {
            co: "211303",
            na: "龙城区"
        },
        {
            co: "211321",
            na: "朝阳县"
        },
        {
            co: "211322",
            na: "建平县"
        },
        {
            co: "211324",
            na: "喀喇沁左翼蒙古族自治县"
        },
        {
            co: "211381",
            na: "北票市"
        },
        {
            co: "211382",
            na: "凌源市"
        }]
    },
    {
        co: "211400",
        na: "葫芦岛市",
        ch: [{
            co: "211402",
            na: "连山区"
        },
        {
            co: "211403",
            na: "龙港区"
        },
        {
            co: "211404",
            na: "南票区"
        },
        {
            co: "211421",
            na: "绥中县"
        },
        {
            co: "211422",
            na: "建昌县"
        },
        {
            co: "211481",
            na: "兴城市"
        }]
    }]
},
{
    co: "220000",
    na: "吉林",
    ch: [{
        co: "220100",
        na: "长春市",
        ch: [{
            co: "220102",
            na: "南关区"
        },
        {
            co: "220103",
            na: "宽城区"
        },
        {
            co: "220104",
            na: "朝阳区"
        },
        {
            co: "220105",
            na: "二道区"
        },
        {
            co: "220106",
            na: "绿园区"
        },
        {
            co: "220112",
            na: "双阳区"
        },
        {
            co: "220113",
            na: "九台区"
        },
        {
            co: "220122",
            na: "农安县"
        },
        {
            co: "220182",
            na: "榆树市"
        },
        {
            co: "220183",
            na: "德惠市"
        },
        {
            co: "220184",
            na: "长春新区"
        },
        {
            co: "220185",
            na: "高新技术产业开发区"
        },
        {
            co: "220186",
            na: "经济技术开发区"
        },
        {
            co: "220187",
            na: "汽车产业开发区"
        },
        {
            co: "220188",
            na: "兴隆综合保税区"
        }]
    },
    {
        co: "220200",
        na: "吉林市",
        ch: [{
            co: "220202",
            na: "昌邑区"
        },
        {
            co: "220203",
            na: "龙潭区"
        },
        {
            co: "220204",
            na: "船营区"
        },
        {
            co: "220211",
            na: "丰满区"
        },
        {
            co: "220221",
            na: "永吉县"
        },
        {
            co: "220281",
            na: "蛟河市"
        },
        {
            co: "220282",
            na: "桦甸市"
        },
        {
            co: "220283",
            na: "舒兰市"
        },
        {
            co: "220284",
            na: "磐石市"
        },
        {
            co: "220285",
            na: "高新区"
        }]
    },
    {
        co: "220300",
        na: "四平市",
        ch: [{
            co: "220302",
            na: "铁西区"
        },
        {
            co: "220303",
            na: "铁东区"
        },
        {
            co: "220322",
            na: "梨树县"
        },
        {
            co: "220323",
            na: "伊通满族自治县"
        },
        {
            co: "220381",
            na: "公主岭市"
        },
        {
            co: "220382",
            na: "双辽市"
        }]
    },
    {
        co: "220400",
        na: "辽源市",
        ch: [{
            co: "220402",
            na: "龙山区"
        },
        {
            co: "220403",
            na: "西安区"
        },
        {
            co: "220421",
            na: "东丰县"
        },
        {
            co: "220422",
            na: "东辽县"
        }]
    },
    {
        co: "220500",
        na: "通化市",
        ch: [{
            co: "220502",
            na: "东昌区"
        },
        {
            co: "220503",
            na: "二道江区"
        },
        {
            co: "220521",
            na: "通化县"
        },
        {
            co: "220523",
            na: "辉南县"
        },
        {
            co: "220524",
            na: "柳河县"
        },
        {
            co: "220581",
            na: "梅河口市"
        },
        {
            co: "220582",
            na: "集安市"
        }]
    },
    {
        co: "220600",
        na: "白山市",
        ch: [{
            co: "220602",
            na: "浑江区"
        },
        {
            co: "220605",
            na: "江源区"
        },
        {
            co: "220621",
            na: "抚松县"
        },
        {
            co: "220622",
            na: "靖宇县"
        },
        {
            co: "220623",
            na: "长白朝鲜族自治县"
        },
        {
            co: "220681",
            na: "临江市"
        }]
    },
    {
        co: "220700",
        na: "松原市",
        ch: [{
            co: "220702",
            na: "宁江区"
        },
        {
            co: "220721",
            na: "前郭尔罗斯蒙古族自治县"
        },
        {
            co: "220722",
            na: "长岭县"
        },
        {
            co: "220723",
            na: "乾安县"
        },
        {
            co: "220781",
            na: "扶余市"
        }]
    },
    {
        co: "220800",
        na: "白城市",
        ch: [{
            co: "220802",
            na: "洮北区"
        },
        {
            co: "220821",
            na: "镇赉县"
        },
        {
            co: "220822",
            na: "通榆县"
        },
        {
            co: "220881",
            na: "洮南市"
        },
        {
            co: "220882",
            na: "大安市"
        }]
    },
    {
        co: "222400",
        na: "延边朝鲜族自治州",
        ch: [{
            co: "222401",
            na: "延吉市"
        },
        {
            co: "222402",
            na: "图们市"
        },
        {
            co: "222403",
            na: "敦化市"
        },
        {
            co: "222404",
            na: "珲春市"
        },
        {
            co: "222405",
            na: "龙井市"
        },
        {
            co: "222406",
            na: "和龙市"
        },
        {
            co: "222424",
            na: "汪清县"
        },
        {
            co: "222426",
            na: "安图县"
        }]
    }]
},
{
    co: "230000",
    na: "黑龙江",
    ch: [{
        co: "230100",
        na: "哈尔滨市",
        ch: [{
            co: "230102",
            na: "道里区"
        },
        {
            co: "230103",
            na: "南岗区"
        },
        {
            co: "230104",
            na: "道外区"
        },
        {
            co: "230108",
            na: "平房区"
        },
        {
            co: "230109",
            na: "松北区"
        },
        {
            co: "230110",
            na: "香坊区"
        },
        {
            co: "230111",
            na: "呼兰区"
        },
        {
            co: "230112",
            na: "阿城区"
        },
        {
            co: "230113",
            na: "双城区"
        },
        {
            co: "230123",
            na: "依兰县"
        },
        {
            co: "230124",
            na: "方正县"
        },
        {
            co: "230125",
            na: "宾县"
        },
        {
            co: "230126",
            na: "巴彦县"
        },
        {
            co: "230127",
            na: "木兰县"
        },
        {
            co: "230128",
            na: "通河县"
        },
        {
            co: "230129",
            na: "延寿县"
        },
        {
            co: "230183",
            na: "尚志市"
        },
        {
            co: "230184",
            na: "五常市"
        },
        {
            co: "230185",
            na: "哈尔滨新区"
        },
        {
            co: "230186",
            na: "高新区"
        }]
    },
    {
        co: "230200",
        na: "齐齐哈尔市",
        ch: [{
            co: "230202",
            na: "龙沙区"
        },
        {
            co: "230203",
            na: "建华区"
        },
        {
            co: "230204",
            na: "铁锋区"
        },
        {
            co: "230205",
            na: "昂昂溪区"
        },
        {
            co: "230206",
            na: "富拉尔基区"
        },
        {
            co: "230207",
            na: "碾子山区"
        },
        {
            co: "230208",
            na: "梅里斯达斡尔族区"
        },
        {
            co: "230221",
            na: "龙江县"
        },
        {
            co: "230223",
            na: "依安县"
        },
        {
            co: "230224",
            na: "泰来县"
        },
        {
            co: "230225",
            na: "甘南县"
        },
        {
            co: "230227",
            na: "富裕县"
        },
        {
            co: "230229",
            na: "克山县"
        },
        {
            co: "230230",
            na: "克东县"
        },
        {
            co: "230231",
            na: "拜泉县"
        },
        {
            co: "230281",
            na: "讷河市"
        },
        {
            co: "230282",
            na: "高新区"
        }]
    },
    {
        co: "230300",
        na: "鸡西市",
        ch: [{
            co: "230302",
            na: "鸡冠区"
        },
        {
            co: "230303",
            na: "恒山区"
        },
        {
            co: "230304",
            na: "滴道区"
        },
        {
            co: "230305",
            na: "梨树区"
        },
        {
            co: "230306",
            na: "城子河区"
        },
        {
            co: "230307",
            na: "麻山区"
        },
        {
            co: "230321",
            na: "鸡东县"
        },
        {
            co: "230381",
            na: "虎林市"
        },
        {
            co: "230382",
            na: "密山市"
        }]
    },
    {
        co: "230400",
        na: "鹤岗市",
        ch: [{
            co: "230402",
            na: "向阳区"
        },
        {
            co: "230403",
            na: "工农区"
        },
        {
            co: "230404",
            na: "南山区"
        },
        {
            co: "230405",
            na: "兴安区"
        },
        {
            co: "230406",
            na: "东山区"
        },
        {
            co: "230407",
            na: "兴山区"
        },
        {
            co: "230421",
            na: "萝北县"
        },
        {
            co: "230422",
            na: "绥滨县"
        }]
    },
    {
        co: "230500",
        na: "双鸭山市",
        ch: [{
            co: "230502",
            na: "尖山区"
        },
        {
            co: "230503",
            na: "岭东区"
        },
        {
            co: "230505",
            na: "四方台区"
        },
        {
            co: "230506",
            na: "宝山区"
        },
        {
            co: "230521",
            na: "集贤县"
        },
        {
            co: "230522",
            na: "友谊县"
        },
        {
            co: "230523",
            na: "宝清县"
        },
        {
            co: "230524",
            na: "饶河县"
        }]
    },
    {
        co: "230600",
        na: "大庆市",
        ch: [{
            co: "230602",
            na: "萨尔图区"
        },
        {
            co: "230603",
            na: "龙凤区"
        },
        {
            co: "230604",
            na: "让胡路区"
        },
        {
            co: "230605",
            na: "红岗区"
        },
        {
            co: "230606",
            na: "大同区"
        },
        {
            co: "230621",
            na: "肇州县"
        },
        {
            co: "230622",
            na: "肇源县"
        },
        {
            co: "230623",
            na: "林甸县"
        },
        {
            co: "230624",
            na: "杜尔伯特蒙古族自治县"
        },
        {
            co: "230625",
            na: "高新区"
        }]
    },
    {
        co: "230700",
        na: "伊春市",
        ch: [{
            co: "230702",
            na: "伊春区"
        },
        {
            co: "230703",
            na: "南岔区"
        },
        {
            co: "230704",
            na: "友好区"
        },
        {
            co: "230705",
            na: "西林区"
        },
        {
            co: "230706",
            na: "翠峦区"
        },
        {
            co: "230707",
            na: "新青区"
        },
        {
            co: "230708",
            na: "美溪区"
        },
        {
            co: "230709",
            na: "金山屯区"
        },
        {
            co: "230710",
            na: "五营区"
        },
        {
            co: "230711",
            na: "乌马河区"
        },
        {
            co: "230712",
            na: "汤旺河区"
        },
        {
            co: "230713",
            na: "带岭区"
        },
        {
            co: "230714",
            na: "乌伊岭区"
        },
        {
            co: "230715",
            na: "红星区"
        },
        {
            co: "230716",
            na: "上甘岭区"
        },
        {
            co: "230722",
            na: "嘉荫县"
        },
        {
            co: "230781",
            na: "铁力市"
        }]
    },
    {
        co: "230800",
        na: "佳木斯市",
        ch: [{
            co: "230803",
            na: "向阳区"
        },
        {
            co: "230804",
            na: "前进区"
        },
        {
            co: "230805",
            na: "东风区"
        },
        {
            co: "230811",
            na: "郊区"
        },
        {
            co: "230822",
            na: "桦南县"
        },
        {
            co: "230826",
            na: "桦川县"
        },
        {
            co: "230828",
            na: "汤原县"
        },
        {
            co: "230833",
            na: "抚远市"
        },
        {
            co: "230881",
            na: "同江市"
        },
        {
            co: "230882",
            na: "富锦市"
        }]
    },
    {
        co: "230900",
        na: "七台河市",
        ch: [{
            co: "230902",
            na: "新兴区"
        },
        {
            co: "230903",
            na: "桃山区"
        },
        {
            co: "230904",
            na: "茄子河区"
        },
        {
            co: "230921",
            na: "勃利县"
        }]
    },
    {
        co: "231000",
        na: "牡丹江市",
        ch: [{
            co: "231002",
            na: "东安区"
        },
        {
            co: "231003",
            na: "阳明区"
        },
        {
            co: "231004",
            na: "爱民区"
        },
        {
            co: "231005",
            na: "西安区"
        },
        {
            co: "231025",
            na: "林口县"
        },
        {
            co: "231081",
            na: "绥芬河市"
        },
        {
            co: "231083",
            na: "海林市"
        },
        {
            co: "231084",
            na: "宁安市"
        },
        {
            co: "231085",
            na: "穆棱市"
        },
        {
            co: "231086",
            na: "东宁市"
        }]
    },
    {
        co: "231100",
        na: "黑河市",
        ch: [{
            co: "231102",
            na: "爱辉区"
        },
        {
            co: "231121",
            na: "嫩江县"
        },
        {
            co: "231123",
            na: "逊克县"
        },
        {
            co: "231124",
            na: "孙吴县"
        },
        {
            co: "231181",
            na: "北安市"
        },
        {
            co: "231182",
            na: "五大连池市"
        }]
    },
    {
        co: "231200",
        na: "绥化市",
        ch: [{
            co: "231202",
            na: "北林区"
        },
        {
            co: "231221",
            na: "望奎县"
        },
        {
            co: "231222",
            na: "兰西县"
        },
        {
            co: "231223",
            na: "青冈县"
        },
        {
            co: "231224",
            na: "庆安县"
        },
        {
            co: "231225",
            na: "明水县"
        },
        {
            co: "231226",
            na: "绥棱县"
        },
        {
            co: "231281",
            na: "安达市"
        },
        {
            co: "231282",
            na: "肇东市"
        },
        {
            co: "231283",
            na: "海伦市"
        }]
    },
    {
        co: "232700",
        na: "大兴安岭地区",
        ch: [{
            co: "232701",
            na: "加格达奇区"
        },
        {
            co: "232702",
            na: "新林区"
        },
        {
            co: "232703",
            na: "松岭区"
        },
        {
            co: "232704",
            na: "呼中区"
        },
        {
            co: "232721",
            na: "呼玛县"
        },
        {
            co: "232722",
            na: "塔河县"
        },
        {
            co: "232723",
            na: "漠河县"
        }]
    }]
},
{
    co: "310000",
    na: "上海",
    ch: [{
        co: "310100",
        na: "上海市",
        ch: [{
            co: "310101",
            na: "黄浦区"
        },
        {
            co: "310104",
            na: "徐汇区"
        },
        {
            co: "310105",
            na: "长宁区"
        },
        {
            co: "310106",
            na: "静安区"
        },
        {
            co: "310107",
            na: "普陀区"
        },
        {
            co: "310109",
            na: "虹口区"
        },
        {
            co: "310110",
            na: "杨浦区"
        },
        {
            co: "310112",
            na: "闵行区"
        },
        {
            co: "310113",
            na: "宝山区"
        },
        {
            co: "310114",
            na: "嘉定区"
        },
        {
            co: "310115",
            na: "浦东新区"
        },
        {
            co: "310116",
            na: "金山区"
        },
        {
            co: "310117",
            na: "松江区"
        },
        {
            co: "310118",
            na: "青浦区"
        },
        {
            co: "310120",
            na: "奉贤区"
        },
        {
            co: "310230",
            na: "崇明区"
        },
        {
            co: "310231",
            na: "张江高新区"
        },
        {
            co: "310232",
            na: "紫竹高新区"
        },
        {
            co: "310233",
            na: "漕河泾开发区"
        }]
    }]
},
{
    co: "320000",
    na: "江苏",
    ch: [{
        co: "320100",
        na: "南京市",
        ch: [{
            co: "320102",
            na: "玄武区"
        },
        {
            co: "320104",
            na: "秦淮区"
        },
        {
            co: "320105",
            na: "建邺区"
        },
        {
            co: "320106",
            na: "鼓楼区"
        },
        {
            co: "320111",
            na: "浦口区"
        },
        {
            co: "320113",
            na: "栖霞区"
        },
        {
            co: "320114",
            na: "雨花台区"
        },
        {
            co: "320115",
            na: "江宁区"
        },
        {
            co: "320116",
            na: "六合区"
        },
        {
            co: "320117",
            na: "溧水区"
        },
        {
            co: "320118",
            na: "高淳区"
        },
        {
            co: "320119",
            na: "江北新区"
        }]
    },
    {
        co: "320200",
        na: "无锡市",
        ch: [{
            co: "320205",
            na: "锡山区"
        },
        {
            co: "320206",
            na: "惠山区"
        },
        {
            co: "320211",
            na: "滨湖区"
        },
        {
            co: "320213",
            na: "梁溪区"
        },
        {
            co: "320214",
            na: "新吴区"
        },
        {
            co: "320281",
            na: "江阴市"
        },
        {
            co: "320282",
            na: "宜兴市"
        }]
    },
    {
        co: "320300",
        na: "徐州市",
        ch: [{
            co: "320302",
            na: "鼓楼区"
        },
        {
            co: "320303",
            na: "云龙区"
        },
        {
            co: "320305",
            na: "贾汪区"
        },
        {
            co: "320311",
            na: "泉山区"
        },
        {
            co: "320312",
            na: "铜山区"
        },
        {
            co: "320321",
            na: "丰县"
        },
        {
            co: "320322",
            na: "沛县"
        },
        {
            co: "320324",
            na: "睢宁县"
        },
        {
            co: "320381",
            na: "新沂市"
        },
        {
            co: "320382",
            na: "邳州市"
        },
        {
            co: "320383",
            na: "经济技术开发区"
        },
        {
            co: "320384",
            na: "高新技术产业开发区"
        },
        {
            co: "320385",
            na: "软件园"
        }]
    },
    {
        co: "320400",
        na: "常州市",
        ch: [{
            co: "320402",
            na: "天宁区"
        },
        {
            co: "320404",
            na: "钟楼区"
        },
        {
            co: "320411",
            na: "新北区"
        },
        {
            co: "320412",
            na: "武进区"
        },
        {
            co: "320413",
            na: "金坛区"
        },
        {
            co: "320481",
            na: "溧阳市"
        },
        {
            co: "320482",
            na: "高新区"
        }]
    },
    {
        co: "320500",
        na: "苏州市",
        ch: [{
            co: "320505",
            na: "虎丘区"
        },
        {
            co: "320506",
            na: "吴中区"
        },
        {
            co: "320507",
            na: "相城区"
        },
        {
            co: "320508",
            na: "姑苏区"
        },
        {
            co: "320509",
            na: "吴江区"
        },
        {
            co: "320581",
            na: "常熟市"
        },
        {
            co: "320582",
            na: "张家港市"
        },
        {
            co: "320583",
            na: "昆山市"
        },
        {
            co: "320585",
            na: "太仓市"
        },
        {
            co: "320586",
            na: "苏州新区"
        },
        {
            co: "320587",
            na: "工业园区"
        },
        {
            co: "320588",
            na: "高新区"
        }]
    },
    {
        co: "320600",
        na: "南通市",
        ch: [{
            co: "320602",
            na: "崇川区"
        },
        {
            co: "320611",
            na: "港闸区"
        },
        {
            co: "320612",
            na: "通州区"
        },
        {
            co: "320621",
            na: "海安县"
        },
        {
            co: "320623",
            na: "如东县"
        },
        {
            co: "320681",
            na: "启东市"
        },
        {
            co: "320682",
            na: "如皋市"
        },
        {
            co: "320684",
            na: "海门市"
        },
        {
            co: "320685",
            na: "经济技术开发区"
        }]
    },
    {
        co: "320700",
        na: "连云港市",
        ch: [{
            co: "320703",
            na: "连云区"
        },
        {
            co: "320706",
            na: "海州区"
        },
        {
            co: "320707",
            na: "赣榆区"
        },
        {
            co: "320722",
            na: "东海县"
        },
        {
            co: "320723",
            na: "灌云县"
        },
        {
            co: "320724",
            na: "灌南县"
        }]
    },
    {
        co: "320800",
        na: "淮安市",
        ch: [{
            co: "320802",
            na: "清江浦区"
        },
        {
            co: "320803",
            na: "淮安区"
        },
        {
            co: "320804",
            na: "淮阴区"
        },
        {
            co: "320826",
            na: "涟水县"
        },
        {
            co: "320829",
            na: "洪泽区"
        },
        {
            co: "320830",
            na: "盱眙县"
        },
        {
            co: "320831",
            na: "金湖县"
        },
        {
            co: "320832",
            na: "经济开发区"
        }]
    },
    {
        co: "320900",
        na: "盐城市",
        ch: [{
            co: "320902",
            na: "亭湖区"
        },
        {
            co: "320903",
            na: "盐都区"
        },
        {
            co: "320904",
            na: "大丰区"
        },
        {
            co: "320921",
            na: "响水县"
        },
        {
            co: "320922",
            na: "滨海县"
        },
        {
            co: "320923",
            na: "阜宁县"
        },
        {
            co: "320924",
            na: "射阳县"
        },
        {
            co: "320925",
            na: "建湖县"
        },
        {
            co: "320981",
            na: "东台市"
        }]
    },
    {
        co: "321000",
        na: "扬州市",
        ch: [{
            co: "321002",
            na: "广陵区"
        },
        {
            co: "321003",
            na: "邗江区"
        },
        {
            co: "321012",
            na: "江都区"
        },
        {
            co: "321023",
            na: "宝应县"
        },
        {
            co: "321081",
            na: "仪征市"
        },
        {
            co: "321084",
            na: "高邮市"
        }]
    },
    {
        co: "321100",
        na: "镇江市",
        ch: [{
            co: "321102",
            na: "京口区"
        },
        {
            co: "321111",
            na: "润州区"
        },
        {
            co: "321112",
            na: "丹徒区"
        },
        {
            co: "321181",
            na: "丹阳市"
        },
        {
            co: "321182",
            na: "扬中市"
        },
        {
            co: "321183",
            na: "句容市"
        },
        {
            co: "321184",
            na: "镇江新区"
        },
        {
            co: "321185",
            na: "镇江新区"
        },
        {
            co: "321186",
            na: "经济开发区"
        }]
    },
    {
        co: "321200",
        na: "泰州市",
        ch: [{
            co: "321202",
            na: "海陵区"
        },
        {
            co: "321203",
            na: "高港区"
        },
        {
            co: "321204",
            na: "姜堰区"
        },
        {
            co: "321281",
            na: "兴化市"
        },
        {
            co: "321282",
            na: "靖江市"
        },
        {
            co: "321283",
            na: "泰兴市"
        }]
    },
    {
        co: "321300",
        na: "宿迁市",
        ch: [{
            co: "321302",
            na: "宿城区"
        },
        {
            co: "321311",
            na: "宿豫区"
        },
        {
            co: "321322",
            na: "沭阳县"
        },
        {
            co: "321323",
            na: "泗阳县"
        },
        {
            co: "321324",
            na: "泗洪县"
        },
        {
            co: "321325",
            na: "经济开发区"
        }]
    }]
},
{
    co: "330000",
    na: "浙江",
    ch: [{
        co: "330100",
        na: "杭州市",
        ch: [{
            co: "330102",
            na: "上城区"
        },
        {
            co: "330103",
            na: "下城区"
        },
        {
            co: "330104",
            na: "江干区"
        },
        {
            co: "330105",
            na: "拱墅区"
        },
        {
            co: "330106",
            na: "西湖区"
        },
        {
            co: "330108",
            na: "滨江区"
        },
        {
            co: "330109",
            na: "萧山区"
        },
        {
            co: "330110",
            na: "余杭区"
        },
        {
            co: "330111",
            na: "富阳区"
        },
        {
            co: "330122",
            na: "桐庐县"
        },
        {
            co: "330127",
            na: "淳安县"
        },
        {
            co: "330182",
            na: "建德市"
        },
        {
            co: "330185",
            na: "临安市"
        },
        {
            co: "330186",
            na: "高新区"
        }]
    },
    {
        co: "330200",
        na: "宁波市",
        ch: [{
            co: "330203",
            na: "海曙区"
        },
        {
            co: "330204",
            na: "江东区"
        },
        {
            co: "330205",
            na: "江北区"
        },
        {
            co: "330206",
            na: "北仑区"
        },
        {
            co: "330211",
            na: "镇海区"
        },
        {
            co: "330212",
            na: "鄞州区"
        },
        {
            co: "330225",
            na: "象山县"
        },
        {
            co: "330226",
            na: "宁海县"
        },
        {
            co: "330281",
            na: "余姚市"
        },
        {
            co: "330282",
            na: "慈溪市"
        },
        {
            co: "330283",
            na: "奉化市"
        },
        {
            co: "330284",
            na: "杭州湾新区"
        },
        {
            co: "330285",
            na: "高新区"
        }]
    },
    {
        co: "330300",
        na: "温州市",
        ch: [{
            co: "330302",
            na: "鹿城区"
        },
        {
            co: "330303",
            na: "龙湾区"
        },
        {
            co: "330304",
            na: "瓯海区"
        },
        {
            co: "330305",
            na: "洞头区"
        },
        {
            co: "330324",
            na: "永嘉县"
        },
        {
            co: "330326",
            na: "平阳县"
        },
        {
            co: "330327",
            na: "苍南县"
        },
        {
            co: "330328",
            na: "文成县"
        },
        {
            co: "330329",
            na: "泰顺县"
        },
        {
            co: "330381",
            na: "瑞安市"
        },
        {
            co: "330382",
            na: "乐清市"
        }]
    },
    {
        co: "330400",
        na: "嘉兴市",
        ch: [{
            co: "330402",
            na: "南湖区"
        },
        {
            co: "330411",
            na: "秀洲区"
        },
        {
            co: "330421",
            na: "嘉善县"
        },
        {
            co: "330424",
            na: "海盐县"
        },
        {
            co: "330481",
            na: "海宁市"
        },
        {
            co: "330482",
            na: "平湖市"
        },
        {
            co: "330483",
            na: "桐乡市"
        }]
    },
    {
        co: "330500",
        na: "湖州市",
        ch: [{
            co: "330502",
            na: "吴兴区"
        },
        {
            co: "330503",
            na: "南浔区"
        },
        {
            co: "330521",
            na: "德清县"
        },
        {
            co: "330522",
            na: "长兴县"
        },
        {
            co: "330523",
            na: "安吉县"
        }]
    },
    {
        co: "330600",
        na: "绍兴市",
        ch: [{
            co: "330602",
            na: "越城区"
        },
        {
            co: "330603",
            na: "柯桥区"
        },
        {
            co: "330604",
            na: "上虞区"
        },
        {
            co: "330624",
            na: "新昌县"
        },
        {
            co: "330681",
            na: "诸暨市"
        },
        {
            co: "330683",
            na: "嵊州市"
        }]
    },
    {
        co: "330700",
        na: "金华市",
        ch: [{
            co: "330702",
            na: "婺城区"
        },
        {
            co: "330703",
            na: "金东区"
        },
        {
            co: "330723",
            na: "武义县"
        },
        {
            co: "330726",
            na: "浦江县"
        },
        {
            co: "330727",
            na: "磐安县"
        },
        {
            co: "330781",
            na: "兰溪市"
        },
        {
            co: "330782",
            na: "义乌市"
        },
        {
            co: "330783",
            na: "东阳市"
        },
        {
            co: "330784",
            na: "永康市"
        }]
    },
    {
        co: "330800",
        na: "衢州市",
        ch: [{
            co: "330802",
            na: "柯城区"
        },
        {
            co: "330803",
            na: "衢江区"
        },
        {
            co: "330822",
            na: "常山县"
        },
        {
            co: "330824",
            na: "开化县"
        },
        {
            co: "330825",
            na: "龙游县"
        },
        {
            co: "330881",
            na: "江山市"
        }]
    },
    {
        co: "330900",
        na: "舟山市",
        ch: [{
            co: "330902",
            na: "定海区"
        },
        {
            co: "330903",
            na: "普陀区"
        },
        {
            co: "330921",
            na: "岱山县"
        },
        {
            co: "330922",
            na: "嵊泗县"
        }]
    },
    {
        co: "331000",
        na: "台州市",
        ch: [{
            co: "331002",
            na: "椒江区"
        },
        {
            co: "331003",
            na: "黄岩区"
        },
        {
            co: "331004",
            na: "路桥区"
        },
        {
            co: "331021",
            na: "玉环县"
        },
        {
            co: "331022",
            na: "三门县"
        },
        {
            co: "331023",
            na: "天台县"
        },
        {
            co: "331024",
            na: "仙居县"
        },
        {
            co: "331081",
            na: "温岭市"
        },
        {
            co: "331082",
            na: "临海市"
        }]
    },
    {
        co: "331100",
        na: "丽水市",
        ch: [{
            co: "331102",
            na: "莲都区"
        },
        {
            co: "331121",
            na: "青田县"
        },
        {
            co: "331122",
            na: "缙云县"
        },
        {
            co: "331123",
            na: "遂昌县"
        },
        {
            co: "331124",
            na: "松阳县"
        },
        {
            co: "331125",
            na: "云和县"
        },
        {
            co: "331126",
            na: "庆元县"
        },
        {
            co: "331127",
            na: "景宁畲族自治县"
        },
        {
            co: "331181",
            na: "龙泉市"
        }]
    },
    {
        co: "331200",
        na: "舟山群岛新区",
        ch: [{
            co: "331201",
            na: "金塘岛"
        },
        {
            co: "331202",
            na: "六横岛"
        },
        {
            co: "331203",
            na: "衢山岛"
        },
        {
            co: "331204",
            na: "舟山本岛西北部"
        },
        {
            co: "331205",
            na: "岱山岛西南部"
        },
        {
            co: "331206",
            na: "泗礁岛"
        },
        {
            co: "331207",
            na: "朱家尖岛"
        },
        {
            co: "331208",
            na: "洋山岛"
        },
        {
            co: "331209",
            na: "长涂岛"
        },
        {
            co: "331210",
            na: "虾峙岛"
        }]
    }]
},
{
    co: "340000",
    na: "安徽",
    ch: [{
        co: "340100",
        na: "合肥市",
        ch: [{
            co: "340102",
            na: "瑶海区"
        },
        {
            co: "340103",
            na: "庐阳区"
        },
        {
            co: "340104",
            na: "蜀山区"
        },
        {
            co: "340111",
            na: "包河区"
        },
        {
            co: "340121",
            na: "长丰县"
        },
        {
            co: "340122",
            na: "肥东县"
        },
        {
            co: "340123",
            na: "肥西县"
        },
        {
            co: "340124",
            na: "庐江县"
        },
        {
            co: "340181",
            na: "巢湖市"
        },
        {
            co: "340184",
            na: "经济技术开发区"
        },
        {
            co: "340185",
            na: "高新技术开发区"
        },
        {
            co: "340186",
            na: "北城新区"
        },
        {
            co: "340187",
            na: "滨湖新区"
        },
        {
            co: "340188",
            na: "政务文化新区"
        },
        {
            co: "340189",
            na: "新站综合开发试验区"
        }]
    },
    {
        co: "340200",
        na: "芜湖市",
        ch: [{
            co: "340202",
            na: "镜湖区"
        },
        {
            co: "340203",
            na: "弋江区"
        },
        {
            co: "340207",
            na: "鸠江区"
        },
        {
            co: "340208",
            na: "三山区"
        },
        {
            co: "340221",
            na: "芜湖县"
        },
        {
            co: "340222",
            na: "繁昌县"
        },
        {
            co: "340223",
            na: "南陵县"
        },
        {
            co: "340225",
            na: "无为县"
        }]
    },
    {
        co: "340300",
        na: "蚌埠市",
        ch: [{
            co: "340302",
            na: "龙子湖区"
        },
        {
            co: "340303",
            na: "蚌山区"
        },
        {
            co: "340304",
            na: "禹会区"
        },
        {
            co: "340311",
            na: "淮上区"
        },
        {
            co: "340321",
            na: "怀远县"
        },
        {
            co: "340322",
            na: "五河县"
        },
        {
            co: "340323",
            na: "固镇县"
        },
        {
            co: "340324",
            na: "高新区"
        }]
    },
    {
        co: "340400",
        na: "淮南市",
        ch: [{
            co: "340402",
            na: "大通区"
        },
        {
            co: "340403",
            na: "田家庵区"
        },
        {
            co: "340404",
            na: "谢家集区"
        },
        {
            co: "340405",
            na: "八公山区"
        },
        {
            co: "340406",
            na: "潘集区"
        },
        {
            co: "340421",
            na: "凤台县"
        },
        {
            co: "340422",
            na: "寿县"
        },
        {
            co: "340423",
            na: "山南新区"
        },
        {
            co: "340424",
            na: "毛集实验区"
        },
        {
            co: "340425",
            na: "经济开发区"
        }]
    },
    {
        co: "340500",
        na: "马鞍山市",
        ch: [{
            co: "340503",
            na: "花山区"
        },
        {
            co: "340504",
            na: "雨山区"
        },
        {
            co: "340506",
            na: "博望区"
        },
        {
            co: "340521",
            na: "当涂县"
        },
        {
            co: "340522",
            na: "含山县"
        },
        {
            co: "340523",
            na: "和县"
        }]
    },
    {
        co: "340600",
        na: "淮北市",
        ch: [{
            co: "340602",
            na: "杜集区"
        },
        {
            co: "340603",
            na: "相山区"
        },
        {
            co: "340604",
            na: "烈山区"
        },
        {
            co: "340621",
            na: "濉溪县"
        }]
    },
    {
        co: "340700",
        na: "铜陵市",
        ch: [{
            co: "340705",
            na: "铜官区"
        },
        {
            co: "340706",
            na: "义安区"
        },
        {
            co: "340711",
            na: "郊区"
        },
        {
            co: "340722",
            na: "枞阳县"
        }]
    },
    {
        co: "340800",
        na: "安庆市",
        ch: [{
            co: "340802",
            na: "迎江区"
        },
        {
            co: "340803",
            na: "大观区"
        },
        {
            co: "340811",
            na: "宜秀区"
        },
        {
            co: "340822",
            na: "怀宁县"
        },
        {
            co: "340824",
            na: "潜山县"
        },
        {
            co: "340825",
            na: "太湖县"
        },
        {
            co: "340826",
            na: "宿松县"
        },
        {
            co: "340827",
            na: "望江县"
        },
        {
            co: "340828",
            na: "岳西县"
        },
        {
            co: "340881",
            na: "桐城市"
        }]
    },
    {
        co: "341000",
        na: "黄山市",
        ch: [{
            co: "341002",
            na: "屯溪区"
        },
        {
            co: "341003",
            na: "黄山区"
        },
        {
            co: "341004",
            na: "徽州区"
        },
        {
            co: "341021",
            na: "歙县"
        },
        {
            co: "341022",
            na: "休宁县"
        },
        {
            co: "341023",
            na: "黟县"
        },
        {
            co: "341024",
            na: "祁门县"
        }]
    },
    {
        co: "341100",
        na: "滁州市",
        ch: [{
            co: "341102",
            na: "琅琊区"
        },
        {
            co: "341103",
            na: "南谯区"
        },
        {
            co: "341122",
            na: "来安县"
        },
        {
            co: "341124",
            na: "全椒县"
        },
        {
            co: "341125",
            na: "定远县"
        },
        {
            co: "341126",
            na: "凤阳县"
        },
        {
            co: "341181",
            na: "天长市"
        },
        {
            co: "341182",
            na: "明光市"
        }]
    },
    {
        co: "341200",
        na: "阜阳市",
        ch: [{
            co: "341202",
            na: "颍州区"
        },
        {
            co: "341203",
            na: "颍东区"
        },
        {
            co: "341204",
            na: "颍泉区"
        },
        {
            co: "341221",
            na: "临泉县"
        },
        {
            co: "341222",
            na: "太和县"
        },
        {
            co: "341225",
            na: "阜南县"
        },
        {
            co: "341226",
            na: "颍上县"
        },
        {
            co: "341282",
            na: "界首市"
        },
        {
            co: "341283",
            na: "经济开发区"
        }]
    },
    {
        co: "341300",
        na: "宿州市",
        ch: [{
            co: "341302",
            na: "埇桥区"
        },
        {
            co: "341321",
            na: "砀山县"
        },
        {
            co: "341322",
            na: "萧县"
        },
        {
            co: "341323",
            na: "灵璧县"
        },
        {
            co: "341324",
            na: "泗县"
        },
        {
            co: "341325",
            na: "经济开发区"
        }]
    },
    {
        co: "341500",
        na: "六安市",
        ch: [{
            co: "341502",
            na: "金安区"
        },
        {
            co: "341503",
            na: "裕安区"
        },
        {
            co: "341504",
            na: "叶集区"
        },
        {
            co: "341522",
            na: "霍邱县"
        },
        {
            co: "341523",
            na: "舒城县"
        },
        {
            co: "341524",
            na: "金寨县"
        },
        {
            co: "341525",
            na: "霍山县"
        }]
    },
    {
        co: "341600",
        na: "亳州市",
        ch: [{
            co: "341602",
            na: "谯城区"
        },
        {
            co: "341621",
            na: "涡阳县"
        },
        {
            co: "341622",
            na: "蒙城县"
        },
        {
            co: "341623",
            na: "利辛县"
        }]
    },
    {
        co: "341700",
        na: "池州市",
        ch: [{
            co: "341702",
            na: "贵池区"
        },
        {
            co: "341721",
            na: "东至县"
        },
        {
            co: "341722",
            na: "石台县"
        },
        {
            co: "341723",
            na: "青阳县"
        }]
    },
    {
        co: "341800",
        na: "宣城市",
        ch: [{
            co: "341802",
            na: "宣州区"
        },
        {
            co: "341821",
            na: "郎溪县"
        },
        {
            co: "341822",
            na: "广德县"
        },
        {
            co: "341823",
            na: "泾县"
        },
        {
            co: "341824",
            na: "绩溪县"
        },
        {
            co: "341825",
            na: "旌德县"
        },
        {
            co: "341881",
            na: "宁国市"
        }]
    }]
},
{
    co: "350000",
    na: "福建",
    ch: [{
        co: "350100",
        na: "福州市",
        ch: [{
            co: "350102",
            na: "鼓楼区"
        },
        {
            co: "350103",
            na: "台江区"
        },
        {
            co: "350104",
            na: "仓山区"
        },
        {
            co: "350105",
            na: "马尾区"
        },
        {
            co: "350111",
            na: "晋安区"
        },
        {
            co: "350121",
            na: "闽侯县"
        },
        {
            co: "350122",
            na: "连江县"
        },
        {
            co: "350123",
            na: "罗源县"
        },
        {
            co: "350124",
            na: "闽清县"
        },
        {
            co: "350125",
            na: "永泰县"
        },
        {
            co: "350128",
            na: "平潭县"
        },
        {
            co: "350181",
            na: "福清市"
        },
        {
            co: "350182",
            na: "长乐市"
        },
        {
            co: "350183",
            na: "福州新区"
        }]
    },
    {
        co: "350200",
        na: "厦门市",
        ch: [{
            co: "350203",
            na: "思明区"
        },
        {
            co: "350205",
            na: "海沧区"
        },
        {
            co: "350206",
            na: "湖里区"
        },
        {
            co: "350211",
            na: "集美区"
        },
        {
            co: "350212",
            na: "同安区"
        },
        {
            co: "350213",
            na: "翔安区"
        }]
    },
    {
        co: "350300",
        na: "莆田市",
        ch: [{
            co: "350302",
            na: "城厢区"
        },
        {
            co: "350303",
            na: "涵江区"
        },
        {
            co: "350304",
            na: "荔城区"
        },
        {
            co: "350305",
            na: "秀屿区"
        },
        {
            co: "350322",
            na: "仙游县"
        }]
    },
    {
        co: "350400",
        na: "三明市",
        ch: [{
            co: "350402",
            na: "梅列区"
        },
        {
            co: "350403",
            na: "三元区"
        },
        {
            co: "350421",
            na: "明溪县"
        },
        {
            co: "350423",
            na: "清流县"
        },
        {
            co: "350424",
            na: "宁化县"
        },
        {
            co: "350425",
            na: "大田县"
        },
        {
            co: "350426",
            na: "尤溪县"
        },
        {
            co: "350427",
            na: "沙县"
        },
        {
            co: "350428",
            na: "将乐县"
        },
        {
            co: "350429",
            na: "泰宁县"
        },
        {
            co: "350430",
            na: "建宁县"
        },
        {
            co: "350481",
            na: "永安市"
        }]
    },
    {
        co: "350500",
        na: "泉州市",
        ch: [{
            co: "350502",
            na: "鲤城区"
        },
        {
            co: "350503",
            na: "丰泽区"
        },
        {
            co: "350504",
            na: "洛江区"
        },
        {
            co: "350505",
            na: "泉港区"
        },
        {
            co: "350521",
            na: "惠安县"
        },
        {
            co: "350524",
            na: "安溪县"
        },
        {
            co: "350525",
            na: "永春县"
        },
        {
            co: "350526",
            na: "德化县"
        },
        {
            co: "350527",
            na: "金门县"
        },
        {
            co: "350581",
            na: "石狮市"
        },
        {
            co: "350582",
            na: "晋江市"
        },
        {
            co: "350583",
            na: "南安市"
        },
        {
            co: "350584",
            na: "台商投资区"
        },
        {
            co: "350585",
            na: "经济技术开发区"
        },
        {
            co: "350586",
            na: "高新技术开发区"
        },
        {
            co: "350587",
            na: "综合保税区"
        }]
    },
    {
        co: "350600",
        na: "漳州市",
        ch: [{
            co: "350602",
            na: "芗城区"
        },
        {
            co: "350603",
            na: "龙文区"
        },
        {
            co: "350622",
            na: "云霄县"
        },
        {
            co: "350623",
            na: "漳浦县"
        },
        {
            co: "350624",
            na: "诏安县"
        },
        {
            co: "350625",
            na: "长泰县"
        },
        {
            co: "350626",
            na: "东山县"
        },
        {
            co: "350627",
            na: "南靖县"
        },
        {
            co: "350628",
            na: "平和县"
        },
        {
            co: "350629",
            na: "华安县"
        },
        {
            co: "350681",
            na: "龙海市"
        }]
    },
    {
        co: "350700",
        na: "南平市",
        ch: [{
            co: "350702",
            na: "延平区"
        },
        {
            co: "350703",
            na: "建阳区"
        },
        {
            co: "350721",
            na: "顺昌县"
        },
        {
            co: "350722",
            na: "浦城县"
        },
        {
            co: "350723",
            na: "光泽县"
        },
        {
            co: "350724",
            na: "松溪县"
        },
        {
            co: "350725",
            na: "政和县"
        },
        {
            co: "350781",
            na: "邵武市"
        },
        {
            co: "350782",
            na: "武夷山市"
        },
        {
            co: "350783",
            na: "建瓯市"
        }]
    },
    {
        co: "350800",
        na: "龙岩市",
        ch: [{
            co: "350802",
            na: "新罗区"
        },
        {
            co: "350803",
            na: "永定区"
        },
        {
            co: "350821",
            na: "长汀县"
        },
        {
            co: "350823",
            na: "上杭县"
        },
        {
            co: "350824",
            na: "武平县"
        },
        {
            co: "350825",
            na: "连城县"
        },
        {
            co: "350881",
            na: "漳平市"
        }]
    },
    {
        co: "350900",
        na: "宁德市",
        ch: [{
            co: "350902",
            na: "蕉城区"
        },
        {
            co: "350921",
            na: "霞浦县"
        },
        {
            co: "350922",
            na: "古田县"
        },
        {
            co: "350923",
            na: "屏南县"
        },
        {
            co: "350924",
            na: "寿宁县"
        },
        {
            co: "350925",
            na: "周宁县"
        },
        {
            co: "350926",
            na: "柘荣县"
        },
        {
            co: "350981",
            na: "福安市"
        },
        {
            co: "350982",
            na: "福鼎市"
        },
        {
            co: "350983",
            na: "东侨开发区"
        }]
    }]
},
{
    co: "360000",
    na: "江西",
    ch: [{
        co: "360100",
        na: "南昌市",
        ch: [{
            co: "360102",
            na: "东湖区"
        },
        {
            co: "360103",
            na: "西湖区"
        },
        {
            co: "360104",
            na: "青云谱区"
        },
        {
            co: "360105",
            na: "湾里区"
        },
        {
            co: "360111",
            na: "青山湖区"
        },
        {
            co: "360112",
            na: "新建区"
        },
        {
            co: "360121",
            na: "南昌县"
        },
        {
            co: "360123",
            na: "安义县"
        },
        {
            co: "360124",
            na: "进贤县"
        },
        {
            co: "360125",
            na: "红谷滩新区"
        },
        {
            co: "360126",
            na: "高新区"
        },
        {
            co: "360127",
            na: "经济开发区"
        },
        {
            co: "360128",
            na: "小蓝开发区"
        },
        {
            co: "360129",
            na: "桑海开发区"
        },
        {
            co: "360130",
            na: "望城新区"
        },
        {
            co: "360131",
            na: "赣江新区"
        }]
    },
    {
        co: "360200",
        na: "景德镇市",
        ch: [{
            co: "360202",
            na: "昌江区"
        },
        {
            co: "360203",
            na: "珠山区"
        },
        {
            co: "360222",
            na: "浮梁县"
        },
        {
            co: "360281",
            na: "乐平市"
        }]
    },
    {
        co: "360300",
        na: "萍乡市",
        ch: [{
            co: "360302",
            na: "安源区"
        },
        {
            co: "360313",
            na: "湘东区"
        },
        {
            co: "360321",
            na: "莲花县"
        },
        {
            co: "360322",
            na: "上栗县"
        },
        {
            co: "360323",
            na: "芦溪县"
        }]
    },
    {
        co: "360400",
        na: "九江市",
        ch: [{
            co: "360402",
            na: "濂溪区"
        },
        {
            co: "360403",
            na: "浔阳区"
        },
        {
            co: "360421",
            na: "九江县"
        },
        {
            co: "360423",
            na: "武宁县"
        },
        {
            co: "360424",
            na: "修水县"
        },
        {
            co: "360425",
            na: "永修县"
        },
        {
            co: "360426",
            na: "德安县"
        },
        {
            co: "360428",
            na: "都昌县"
        },
        {
            co: "360429",
            na: "湖口县"
        },
        {
            co: "360430",
            na: "彭泽县"
        },
        {
            co: "360481",
            na: "瑞昌市"
        },
        {
            co: "360482",
            na: "共青城市"
        },
        {
            co: "360483",
            na: "庐山市"
        },
        {
            co: "360484",
            na: "经济技术开发区"
        },
        {
            co: "360485",
            na: "八里湖新区"
        },
        {
            co: "360486",
            na: "庐山风景名胜区"
        }]
    },
    {
        co: "360500",
        na: "新余市",
        ch: [{
            co: "360502",
            na: "渝水区"
        },
        {
            co: "360521",
            na: "分宜县"
        }]
    },
    {
        co: "360600",
        na: "鹰潭市",
        ch: [{
            co: "360602",
            na: "月湖区"
        },
        {
            co: "360622",
            na: "余江县"
        },
        {
            co: "360681",
            na: "贵溪市"
        }]
    },
    {
        co: "360700",
        na: "赣州市",
        ch: [{
            co: "360702",
            na: "章贡区"
        },
        {
            co: "360703",
            na: "南康区"
        },
        {
            co: "360721",
            na: "赣县"
        },
        {
            co: "360722",
            na: "信丰县"
        },
        {
            co: "360723",
            na: "大余县"
        },
        {
            co: "360724",
            na: "上犹县"
        },
        {
            co: "360725",
            na: "崇义县"
        },
        {
            co: "360726",
            na: "安远县"
        },
        {
            co: "360727",
            na: "龙南县"
        },
        {
            co: "360728",
            na: "定南县"
        },
        {
            co: "360729",
            na: "全南县"
        },
        {
            co: "360730",
            na: "宁都县"
        },
        {
            co: "360731",
            na: "于都县"
        },
        {
            co: "360732",
            na: "兴国县"
        },
        {
            co: "360733",
            na: "会昌县"
        },
        {
            co: "360734",
            na: "寻乌县"
        },
        {
            co: "360735",
            na: "石城县"
        },
        {
            co: "360781",
            na: "瑞金市"
        },
        {
            co: "360782",
            na: "章康新区"
        }]
    },
    {
        co: "360800",
        na: "吉安市",
        ch: [{
            co: "360802",
            na: "吉州区"
        },
        {
            co: "360803",
            na: "青原区"
        },
        {
            co: "360821",
            na: "吉安县"
        },
        {
            co: "360822",
            na: "吉水县"
        },
        {
            co: "360823",
            na: "峡江县"
        },
        {
            co: "360824",
            na: "新干县"
        },
        {
            co: "360825",
            na: "永丰县"
        },
        {
            co: "360826",
            na: "泰和县"
        },
        {
            co: "360827",
            na: "遂川县"
        },
        {
            co: "360828",
            na: "万安县"
        },
        {
            co: "360829",
            na: "安福县"
        },
        {
            co: "360830",
            na: "永新县"
        },
        {
            co: "360881",
            na: "井冈山市"
        }]
    },
    {
        co: "360900",
        na: "宜春市",
        ch: [{
            co: "360902",
            na: "袁州区"
        },
        {
            co: "360921",
            na: "奉新县"
        },
        {
            co: "360922",
            na: "万载县"
        },
        {
            co: "360923",
            na: "上高县"
        },
        {
            co: "360924",
            na: "宜丰县"
        },
        {
            co: "360925",
            na: "靖安县"
        },
        {
            co: "360926",
            na: "铜鼓县"
        },
        {
            co: "360981",
            na: "丰城市"
        },
        {
            co: "360982",
            na: "樟树市"
        },
        {
            co: "360983",
            na: "高安市"
        }]
    },
    {
        co: "361000",
        na: "抚州市",
        ch: [{
            co: "361002",
            na: "临川区"
        },
        {
            co: "361021",
            na: "南城县"
        },
        {
            co: "361022",
            na: "黎川县"
        },
        {
            co: "361023",
            na: "南丰县"
        },
        {
            co: "361024",
            na: "崇仁县"
        },
        {
            co: "361025",
            na: "乐安县"
        },
        {
            co: "361026",
            na: "宜黄县"
        },
        {
            co: "361027",
            na: "金溪县"
        },
        {
            co: "361028",
            na: "资溪县"
        },
        {
            co: "361029",
            na: "东乡县"
        },
        {
            co: "361030",
            na: "广昌县"
        }]
    },
    {
        co: "361100",
        na: "上饶市",
        ch: [{
            co: "361102",
            na: "信州区"
        },
        {
            co: "361103",
            na: "广丰区"
        },
        {
            co: "361121",
            na: "上饶县"
        },
        {
            co: "361123",
            na: "玉山县"
        },
        {
            co: "361124",
            na: "铅山县"
        },
        {
            co: "361125",
            na: "横峰县"
        },
        {
            co: "361126",
            na: "弋阳县"
        },
        {
            co: "361127",
            na: "余干县"
        },
        {
            co: "361128",
            na: "鄱阳县"
        },
        {
            co: "361129",
            na: "万年县"
        },
        {
            co: "361130",
            na: "婺源县"
        },
        {
            co: "361181",
            na: "德兴市"
        }]
    }]
},
{
    co: "370000",
    na: "山东",
    ch: [{
        co: "370100",
        na: "济南市",
        ch: [{
            co: "370102",
            na: "历下区"
        },
        {
            co: "370103",
            na: "市中区"
        },
        {
            co: "370104",
            na: "槐荫区"
        },
        {
            co: "370105",
            na: "天桥区"
        },
        {
            co: "370112",
            na: "历城区"
        },
        {
            co: "370113",
            na: "长清区"
        },
        {
            co: "370124",
            na: "平阴县"
        },
        {
            co: "370125",
            na: "济阳县"
        },
        {
            co: "370126",
            na: "商河县"
        },
        {
            co: "370181",
            na: "章丘市"
        },
        {
            co: "370182",
            na: "高新区"
        }]
    },
    {
        co: "370200",
        na: "青岛市",
        ch: [{
            co: "370202",
            na: "市南区"
        },
        {
            co: "370203",
            na: "市北区"
        },
        {
            co: "370211",
            na: "黄岛区"
        },
        {
            co: "370212",
            na: "崂山区"
        },
        {
            co: "370213",
            na: "李沧区"
        },
        {
            co: "370214",
            na: "城阳区"
        },
        {
            co: "370281",
            na: "胶州市"
        },
        {
            co: "370282",
            na: "即墨市"
        },
        {
            co: "370283",
            na: "平度市"
        },
        {
            co: "370285",
            na: "莱西市"
        },
        {
            co: "370286",
            na: "西海岸新区"
        },
        {
            co: "370287",
            na: "高新区"
        }]
    },
    {
        co: "370300",
        na: "淄博市",
        ch: [{
            co: "370302",
            na: "淄川区"
        },
        {
            co: "370303",
            na: "张店区"
        },
        {
            co: "370304",
            na: "博山区"
        },
        {
            co: "370305",
            na: "临淄区"
        },
        {
            co: "370306",
            na: "周村区"
        },
        {
            co: "370321",
            na: "桓台县"
        },
        {
            co: "370322",
            na: "高青县"
        },
        {
            co: "370323",
            na: "沂源县"
        },
        {
            co: "370324",
            na: "高新区"
        }]
    },
    {
        co: "370400",
        na: "枣庄市",
        ch: [{
            co: "370402",
            na: "市中区"
        },
        {
            co: "370403",
            na: "薛城区"
        },
        {
            co: "370404",
            na: "峄城区"
        },
        {
            co: "370405",
            na: "台儿庄区"
        },
        {
            co: "370406",
            na: "山亭区"
        },
        {
            co: "370481",
            na: "滕州市"
        },
        {
            co: "370482",
            na: "高新区"
        }]
    },
    {
        co: "370500",
        na: "东营市",
        ch: [{
            co: "370502",
            na: "东营区"
        },
        {
            co: "370503",
            na: "河口区"
        },
        {
            co: "370521",
            na: "垦利区"
        },
        {
            co: "370522",
            na: "利津县"
        },
        {
            co: "370523",
            na: "广饶县"
        }]
    },
    {
        co: "370600",
        na: "烟台市",
        ch: [{
            co: "370602",
            na: "芝罘区"
        },
        {
            co: "370611",
            na: "福山区"
        },
        {
            co: "370612",
            na: "牟平区"
        },
        {
            co: "370613",
            na: "莱山区"
        },
        {
            co: "370634",
            na: "长岛县"
        },
        {
            co: "370681",
            na: "龙口市"
        },
        {
            co: "370682",
            na: "莱阳市"
        },
        {
            co: "370683",
            na: "莱州市"
        },
        {
            co: "370684",
            na: "蓬莱市"
        },
        {
            co: "370685",
            na: "招远市"
        },
        {
            co: "370686",
            na: "栖霞市"
        },
        {
            co: "370687",
            na: "海阳市"
        },
        {
            co: "370688",
            na: "高新区"
        },
        {
            co: "370689",
            na: "经济开发区"
        }]
    },
    {
        co: "370700",
        na: "潍坊市",
        ch: [{
            co: "370702",
            na: "潍城区"
        },
        {
            co: "370703",
            na: "寒亭区"
        },
        {
            co: "370704",
            na: "坊子区"
        },
        {
            co: "370705",
            na: "奎文区"
        },
        {
            co: "370724",
            na: "临朐县"
        },
        {
            co: "370725",
            na: "昌乐县"
        },
        {
            co: "370781",
            na: "青州市"
        },
        {
            co: "370782",
            na: "诸城市"
        },
        {
            co: "370783",
            na: "寿光市"
        },
        {
            co: "370784",
            na: "安丘市"
        },
        {
            co: "370785",
            na: "高密市"
        },
        {
            co: "370786",
            na: "昌邑市"
        },
        {
            co: "370787",
            na: "高新区"
        }]
    },
    {
        co: "370800",
        na: "济宁市",
        ch: [{
            co: "370811",
            na: "任城区"
        },
        {
            co: "370812",
            na: "兖州区"
        },
        {
            co: "370826",
            na: "微山县"
        },
        {
            co: "370827",
            na: "鱼台县"
        },
        {
            co: "370828",
            na: "金乡县"
        },
        {
            co: "370829",
            na: "嘉祥县"
        },
        {
            co: "370830",
            na: "汶上县"
        },
        {
            co: "370831",
            na: "泗水县"
        },
        {
            co: "370832",
            na: "梁山县"
        },
        {
            co: "370881",
            na: "曲阜市"
        },
        {
            co: "370883",
            na: "邹城市"
        },
        {
            co: "370884",
            na: "高新区"
        }]
    },
    {
        co: "370900",
        na: "泰安市",
        ch: [{
            co: "370902",
            na: "泰山区"
        },
        {
            co: "370911",
            na: "岱岳区"
        },
        {
            co: "370921",
            na: "宁阳县"
        },
        {
            co: "370923",
            na: "东平县"
        },
        {
            co: "370982",
            na: "新泰市"
        },
        {
            co: "370983",
            na: "肥城市"
        }]
    },
    {
        co: "371000",
        na: "威海市",
        ch: [{
            co: "371002",
            na: "环翠区"
        },
        {
            co: "371003",
            na: "文登区"
        },
        {
            co: "371082",
            na: "荣成市"
        },
        {
            co: "371083",
            na: "乳山市"
        }]
    },
    {
        co: "371100",
        na: "日照市",
        ch: [{
            co: "371102",
            na: "东港区"
        },
        {
            co: "371103",
            na: "岚山区"
        },
        {
            co: "371121",
            na: "五莲县"
        },
        {
            co: "371122",
            na: "莒县"
        }]
    },
    {
        co: "371200",
        na: "莱芜市",
        ch: [{
            co: "371202",
            na: "莱城区"
        },
        {
            co: "371203",
            na: "钢城区"
        }]
    },
    {
        co: "371300",
        na: "临沂市",
        ch: [{
            co: "371302",
            na: "兰山区"
        },
        {
            co: "371311",
            na: "罗庄区"
        },
        {
            co: "371312",
            na: "河东区"
        },
        {
            co: "371321",
            na: "沂南县"
        },
        {
            co: "371322",
            na: "郯城县"
        },
        {
            co: "371323",
            na: "沂水县"
        },
        {
            co: "371324",
            na: "兰陵县"
        },
        {
            co: "371325",
            na: "费县"
        },
        {
            co: "371326",
            na: "平邑县"
        },
        {
            co: "371327",
            na: "莒南县"
        },
        {
            co: "371328",
            na: "蒙阴县"
        },
        {
            co: "371329",
            na: "临沭县"
        }]
    },
    {
        co: "371400",
        na: "德州市",
        ch: [{
            co: "371402",
            na: "德城区"
        },
        {
            co: "371403",
            na: "陵城区"
        },
        {
            co: "371422",
            na: "宁津县"
        },
        {
            co: "371423",
            na: "庆云县"
        },
        {
            co: "371424",
            na: "临邑县"
        },
        {
            co: "371425",
            na: "齐河县"
        },
        {
            co: "371426",
            na: "平原县"
        },
        {
            co: "371427",
            na: "夏津县"
        },
        {
            co: "371428",
            na: "武城县"
        },
        {
            co: "371481",
            na: "乐陵市"
        },
        {
            co: "371482",
            na: "禹城市"
        }]
    },
    {
        co: "371500",
        na: "聊城市",
        ch: [{
            co: "371502",
            na: "东昌府区"
        },
        {
            co: "371521",
            na: "阳谷县"
        },
        {
            co: "371522",
            na: "莘县"
        },
        {
            co: "371523",
            na: "茌平县"
        },
        {
            co: "371524",
            na: "东阿县"
        },
        {
            co: "371525",
            na: "冠县"
        },
        {
            co: "371526",
            na: "高唐县"
        },
        {
            co: "371581",
            na: "临清市"
        }]
    },
    {
        co: "371600",
        na: "滨州市",
        ch: [{
            co: "371602",
            na: "滨城区"
        },
        {
            co: "371603",
            na: "沾化区"
        },
        {
            co: "371621",
            na: "惠民县"
        },
        {
            co: "371622",
            na: "阳信县"
        },
        {
            co: "371623",
            na: "无棣县"
        },
        {
            co: "371625",
            na: "博兴县"
        },
        {
            co: "371626",
            na: "邹平县"
        },
        {
            co: "371627",
            na: "北海新区"
        }]
    },
    {
        co: "371700",
        na: "菏泽市",
        ch: [{
            co: "371702",
            na: "牡丹区"
        },
        {
            co: "371721",
            na: "曹县"
        },
        {
            co: "371722",
            na: "单县"
        },
        {
            co: "371723",
            na: "成武县"
        },
        {
            co: "371724",
            na: "巨野县"
        },
        {
            co: "371725",
            na: "郓城县"
        },
        {
            co: "371726",
            na: "鄄城县"
        },
        {
            co: "371727",
            na: "定陶区"
        },
        {
            co: "371728",
            na: "东明县"
        }]
    }]
},
{
    co: "410000",
    na: "河南",
    ch: [{
        co: "410100",
        na: "郑州市",
        ch: [{
            co: "410102",
            na: "中原区"
        },
        {
            co: "410103",
            na: "二七区"
        },
        {
            co: "410104",
            na: "管城回族区"
        },
        {
            co: "410105",
            na: "金水区"
        },
        {
            co: "410106",
            na: "上街区"
        },
        {
            co: "410108",
            na: "惠济区"
        },
        {
            co: "410122",
            na: "中牟县"
        },
        {
            co: "410181",
            na: "巩义市"
        },
        {
            co: "410182",
            na: "荥阳市"
        },
        {
            co: "410183",
            na: "新密市"
        },
        {
            co: "410184",
            na: "新郑市"
        },
        {
            co: "410185",
            na: "登封市"
        },
        {
            co: "410186",
            na: "郑东新区"
        },
        {
            co: "410187",
            na: "郑汴新区"
        },
        {
            co: "410188",
            na: "高新开发区"
        },
        {
            co: "410189",
            na: "经济开发区"
        }]
    },
    {
        co: "410200",
        na: "开封市",
        ch: [{
            co: "410202",
            na: "龙亭区"
        },
        {
            co: "410203",
            na: "顺河回族区"
        },
        {
            co: "410204",
            na: "鼓楼区"
        },
        {
            co: "410205",
            na: "禹王台区"
        },
        {
            co: "410212",
            na: "祥符区"
        },
        {
            co: "410221",
            na: "杞县"
        },
        {
            co: "410222",
            na: "通许县"
        },
        {
            co: "410223",
            na: "尉氏县"
        },
        {
            co: "410225",
            na: "兰考县"
        }]
    },
    {
        co: "410300",
        na: "洛阳市",
        ch: [{
            co: "410302",
            na: "老城区"
        },
        {
            co: "410303",
            na: "西工区"
        },
        {
            co: "410304",
            na: "瀍河回族区"
        },
        {
            co: "410305",
            na: "涧西区"
        },
        {
            co: "410306",
            na: "吉利区"
        },
        {
            co: "410311",
            na: "洛龙区"
        },
        {
            co: "410322",
            na: "孟津县"
        },
        {
            co: "410323",
            na: "新安县"
        },
        {
            co: "410324",
            na: "栾川县"
        },
        {
            co: "410325",
            na: "嵩县"
        },
        {
            co: "410326",
            na: "汝阳县"
        },
        {
            co: "410327",
            na: "宜阳县"
        },
        {
            co: "410328",
            na: "洛宁县"
        },
        {
            co: "410329",
            na: "伊川县"
        },
        {
            co: "410381",
            na: "偃师市"
        },
        {
            co: "410382",
            na: "洛阳新区"
        },
        {
            co: "410383",
            na: "高新区"
        }]
    },
    {
        co: "410400",
        na: "平顶山市",
        ch: [{
            co: "410402",
            na: "新华区"
        },
        {
            co: "410403",
            na: "卫东区"
        },
        {
            co: "410404",
            na: "石龙区"
        },
        {
            co: "410411",
            na: "湛河区"
        },
        {
            co: "410421",
            na: "宝丰县"
        },
        {
            co: "410422",
            na: "叶县"
        },
        {
            co: "410423",
            na: "鲁山县"
        },
        {
            co: "410425",
            na: "郏县"
        },
        {
            co: "410481",
            na: "舞钢市"
        },
        {
            co: "410482",
            na: "汝州市"
        }]
    },
    {
        co: "410500",
        na: "安阳市",
        ch: [{
            co: "410502",
            na: "文峰区"
        },
        {
            co: "410503",
            na: "北关区"
        },
        {
            co: "410505",
            na: "殷都区"
        },
        {
            co: "410506",
            na: "龙安区"
        },
        {
            co: "410522",
            na: "安阳县"
        },
        {
            co: "410523",
            na: "汤阴县"
        },
        {
            co: "410526",
            na: "滑县"
        },
        {
            co: "410527",
            na: "内黄县"
        },
        {
            co: "410581",
            na: "林州市"
        },
        {
            co: "410582",
            na: "安阳新区"
        }]
    },
    {
        co: "410600",
        na: "鹤壁市",
        ch: [{
            co: "410602",
            na: "鹤山区"
        },
        {
            co: "410603",
            na: "山城区"
        },
        {
            co: "410611",
            na: "淇滨区"
        },
        {
            co: "410621",
            na: "浚县"
        },
        {
            co: "410622",
            na: "淇县"
        }]
    },
    {
        co: "410700",
        na: "新乡市",
        ch: [{
            co: "410702",
            na: "红旗区"
        },
        {
            co: "410703",
            na: "卫滨区"
        },
        {
            co: "410704",
            na: "凤泉区"
        },
        {
            co: "410711",
            na: "牧野区"
        },
        {
            co: "410721",
            na: "新乡县"
        },
        {
            co: "410724",
            na: "获嘉县"
        },
        {
            co: "410725",
            na: "原阳县"
        },
        {
            co: "410726",
            na: "延津县"
        },
        {
            co: "410727",
            na: "封丘县"
        },
        {
            co: "410728",
            na: "长垣县"
        },
        {
            co: "410781",
            na: "卫辉市"
        },
        {
            co: "410782",
            na: "辉县市"
        }]
    },
    {
        co: "410800",
        na: "焦作市",
        ch: [{
            co: "410802",
            na: "解放区"
        },
        {
            co: "410803",
            na: "中站区"
        },
        {
            co: "410804",
            na: "马村区"
        },
        {
            co: "410811",
            na: "山阳区"
        },
        {
            co: "410821",
            na: "修武县"
        },
        {
            co: "410822",
            na: "博爱县"
        },
        {
            co: "410823",
            na: "武陟县"
        },
        {
            co: "410825",
            na: "温县"
        },
        {
            co: "410882",
            na: "沁阳市"
        },
        {
            co: "410883",
            na: "孟州市"
        }]
    },
    {
        co: "410900",
        na: "濮阳市",
        ch: [{
            co: "410902",
            na: "华龙区"
        },
        {
            co: "410922",
            na: "清丰县"
        },
        {
            co: "410923",
            na: "南乐县"
        },
        {
            co: "410926",
            na: "范县"
        },
        {
            co: "410927",
            na: "台前县"
        },
        {
            co: "410928",
            na: "濮阳县"
        }]
    },
    {
        co: "411000",
        na: "许昌市",
        ch: [{
            co: "411002",
            na: "魏都区"
        },
        {
            co: "411023",
            na: "许昌县"
        },
        {
            co: "411024",
            na: "鄢陵县"
        },
        {
            co: "411025",
            na: "襄城县"
        },
        {
            co: "411081",
            na: "禹州市"
        },
        {
            co: "411082",
            na: "长葛市"
        }]
    },
    {
        co: "411100",
        na: "漯河市",
        ch: [{
            co: "411102",
            na: "源汇区"
        },
        {
            co: "411103",
            na: "郾城区"
        },
        {
            co: "411104",
            na: "召陵区"
        },
        {
            co: "411121",
            na: "舞阳县"
        },
        {
            co: "411122",
            na: "临颍县"
        }]
    },
    {
        co: "411200",
        na: "三门峡市",
        ch: [{
            co: "411202",
            na: "湖滨区"
        },
        {
            co: "411203",
            na: "陕州区"
        },
        {
            co: "411221",
            na: "渑池县"
        },
        {
            co: "411224",
            na: "卢氏县"
        },
        {
            co: "411281",
            na: "义马市"
        },
        {
            co: "411282",
            na: "灵宝市"
        }]
    },
    {
        co: "411300",
        na: "南阳市",
        ch: [{
            co: "411302",
            na: "宛城区"
        },
        {
            co: "411303",
            na: "卧龙区"
        },
        {
            co: "411321",
            na: "南召县"
        },
        {
            co: "411322",
            na: "方城县"
        },
        {
            co: "411323",
            na: "西峡县"
        },
        {
            co: "411324",
            na: "镇平县"
        },
        {
            co: "411325",
            na: "内乡县"
        },
        {
            co: "411326",
            na: "淅川县"
        },
        {
            co: "411327",
            na: "社旗县"
        },
        {
            co: "411328",
            na: "唐河县"
        },
        {
            co: "411329",
            na: "新野县"
        },
        {
            co: "411330",
            na: "桐柏县"
        },
        {
            co: "411381",
            na: "邓州市"
        }]
    },
    {
        co: "411400",
        na: "商丘市",
        ch: [{
            co: "411402",
            na: "梁园区"
        },
        {
            co: "411403",
            na: "睢阳区"
        },
        {
            co: "411421",
            na: "民权县"
        },
        {
            co: "411422",
            na: "睢县"
        },
        {
            co: "411423",
            na: "宁陵县"
        },
        {
            co: "411424",
            na: "柘城县"
        },
        {
            co: "411425",
            na: "虞城县"
        },
        {
            co: "411426",
            na: "夏邑县"
        },
        {
            co: "411481",
            na: "永城市"
        }]
    },
    {
        co: "411500",
        na: "信阳市",
        ch: [{
            co: "411502",
            na: "浉河区"
        },
        {
            co: "411503",
            na: "平桥区"
        },
        {
            co: "411521",
            na: "罗山县"
        },
        {
            co: "411522",
            na: "光山县"
        },
        {
            co: "411523",
            na: "新县"
        },
        {
            co: "411524",
            na: "商城县"
        },
        {
            co: "411525",
            na: "固始县"
        },
        {
            co: "411526",
            na: "潢川县"
        },
        {
            co: "411527",
            na: "淮滨县"
        },
        {
            co: "411528",
            na: "息县"
        }]
    },
    {
        co: "411600",
        na: "周口市",
        ch: [{
            co: "411602",
            na: "川汇区"
        },
        {
            co: "411621",
            na: "扶沟县"
        },
        {
            co: "411622",
            na: "西华县"
        },
        {
            co: "411623",
            na: "商水县"
        },
        {
            co: "411624",
            na: "沈丘县"
        },
        {
            co: "411625",
            na: "郸城县"
        },
        {
            co: "411626",
            na: "淮阳县"
        },
        {
            co: "411627",
            na: "太康县"
        },
        {
            co: "411628",
            na: "鹿邑县"
        },
        {
            co: "411681",
            na: "项城市"
        },
        {
            co: "411682",
            na: "东新区"
        },
        {
            co: "411683",
            na: "经济开发区"
        }]
    },
    {
        co: "411700",
        na: "驻马店市",
        ch: [{
            co: "411702",
            na: "驿城区"
        },
        {
            co: "411721",
            na: "西平县"
        },
        {
            co: "411722",
            na: "上蔡县"
        },
        {
            co: "411723",
            na: "平舆县"
        },
        {
            co: "411724",
            na: "正阳县"
        },
        {
            co: "411725",
            na: "确山县"
        },
        {
            co: "411726",
            na: "泌阳县"
        },
        {
            co: "411727",
            na: "汝南县"
        },
        {
            co: "411728",
            na: "遂平县"
        },
        {
            co: "411729",
            na: "新蔡县"
        }]
    },
    {
        co: "419001",
        na: "济源市",
        ch: [{
            co: "419011",
            na: "沁园街道"
        },
        {
            co: "419012",
            na: "济水街道"
        },
        {
            co: "419013",
            na: "北海街道"
        },
        {
            co: "419014",
            na: "天坛街道"
        },
        {
            co: "419015",
            na: "玉泉街道"
        },
        {
            co: "419016",
            na: "克井镇"
        },
        {
            co: "419017",
            na: "五龙口镇"
        },
        {
            co: "419018",
            na: "梨林镇"
        },
        {
            co: "419019",
            na: "轵城镇"
        },
        {
            co: "419020",
            na: "承留镇"
        },
        {
            co: "419021",
            na: "坡头镇"
        },
        {
            co: "419022",
            na: "大峪镇"
        },
        {
            co: "419023",
            na: "邵原镇"
        },
        {
            co: "419024",
            na: "思礼镇"
        },
        {
            co: "419025",
            na: "王屋镇"
        },
        {
            co: "419026",
            na: "下冶镇"
        }]
    }]
},
{
    co: "420000",
    na: "湖北",
    ch: [{
        co: "420100",
        na: "武汉市",
        ch: [{
            co: "420102",
            na: "江岸区"
        },
        {
            co: "420103",
            na: "江汉区"
        },
        {
            co: "420104",
            na: "硚口区"
        },
        {
            co: "420105",
            na: "汉阳区"
        },
        {
            co: "420106",
            na: "武昌区"
        },
        {
            co: "420107",
            na: "青山区"
        },
        {
            co: "420111",
            na: "洪山区"
        },
        {
            co: "420112",
            na: "东西湖区"
        },
        {
            co: "420113",
            na: "汉南区"
        },
        {
            co: "420114",
            na: "蔡甸区"
        },
        {
            co: "420115",
            na: "江夏区"
        },
        {
            co: "420116",
            na: "黄陂区"
        },
        {
            co: "420117",
            na: "新洲区"
        },
        {
            co: "420118",
            na: "经济技术开发区"
        }]
    },
    {
        co: "420200",
        na: "黄石市",
        ch: [{
            co: "420202",
            na: "黄石港区"
        },
        {
            co: "420203",
            na: "西塞山区"
        },
        {
            co: "420204",
            na: "下陆区"
        },
        {
            co: "420205",
            na: "铁山区"
        },
        {
            co: "420222",
            na: "阳新县"
        },
        {
            co: "420281",
            na: "大冶市"
        },
        {
            co: "420282",
            na: "经济开发区"
        }]
    },
    {
        co: "420300",
        na: "十堰市",
        ch: [{
            co: "420302",
            na: "茅箭区"
        },
        {
            co: "420303",
            na: "张湾区"
        },
        {
            co: "420304",
            na: "郧阳区"
        },
        {
            co: "420322",
            na: "郧西县"
        },
        {
            co: "420323",
            na: "竹山县"
        },
        {
            co: "420324",
            na: "竹溪县"
        },
        {
            co: "420325",
            na: "房县"
        },
        {
            co: "420381",
            na: "丹江口市"
        }]
    },
    {
        co: "420500",
        na: "宜昌市",
        ch: [{
            co: "420502",
            na: "西陵区"
        },
        {
            co: "420503",
            na: "伍家岗区"
        },
        {
            co: "420504",
            na: "点军区"
        },
        {
            co: "420505",
            na: "猇亭区"
        },
        {
            co: "420506",
            na: "夷陵区"
        },
        {
            co: "420525",
            na: "远安县"
        },
        {
            co: "420526",
            na: "兴山县"
        },
        {
            co: "420527",
            na: "秭归县"
        },
        {
            co: "420528",
            na: "长阳土家族自治县"
        },
        {
            co: "420529",
            na: "五峰土家族自治县"
        },
        {
            co: "420581",
            na: "宜都市"
        },
        {
            co: "420582",
            na: "当阳市"
        },
        {
            co: "420583",
            na: "枝江市"
        },
        {
            co: "420584",
            na: "宜昌新区"
        }]
    },
    {
        co: "420600",
        na: "襄阳市",
        ch: [{
            co: "420602",
            na: "襄城区"
        },
        {
            co: "420606",
            na: "樊城区"
        },
        {
            co: "420607",
            na: "襄州区"
        },
        {
            co: "420624",
            na: "南漳县"
        },
        {
            co: "420625",
            na: "谷城县"
        },
        {
            co: "420626",
            na: "保康县"
        },
        {
            co: "420682",
            na: "老河口市"
        },
        {
            co: "420683",
            na: "枣阳市"
        },
        {
            co: "420684",
            na: "宜城市"
        },
        {
            co: "420685",
            na: "高新区"
        },
        {
            co: "420686",
            na: "经济开发区"
        }]
    },
    {
        co: "420700",
        na: "鄂州市",
        ch: [{
            co: "420702",
            na: "梁子湖区"
        },
        {
            co: "420703",
            na: "华容区"
        },
        {
            co: "420704",
            na: "鄂城区"
        }]
    },
    {
        co: "420800",
        na: "荆门市",
        ch: [{
            co: "420802",
            na: "东宝区"
        },
        {
            co: "420804",
            na: "掇刀区"
        },
        {
            co: "420821",
            na: "京山县"
        },
        {
            co: "420822",
            na: "沙洋县"
        },
        {
            co: "420881",
            na: "钟祥市"
        }]
    },
    {
        co: "420900",
        na: "孝感市",
        ch: [{
            co: "420902",
            na: "孝南区"
        },
        {
            co: "420921",
            na: "孝昌县"
        },
        {
            co: "420922",
            na: "大悟县"
        },
        {
            co: "420923",
            na: "云梦县"
        },
        {
            co: "420981",
            na: "应城市"
        },
        {
            co: "420982",
            na: "安陆市"
        },
        {
            co: "420984",
            na: "汉川市"
        }]
    },
    {
        co: "421000",
        na: "荆州市",
        ch: [{
            co: "421002",
            na: "沙市区"
        },
        {
            co: "421003",
            na: "荆州区"
        },
        {
            co: "421022",
            na: "公安县"
        },
        {
            co: "421023",
            na: "监利县"
        },
        {
            co: "421024",
            na: "江陵县"
        },
        {
            co: "421081",
            na: "石首市"
        },
        {
            co: "421083",
            na: "洪湖市"
        },
        {
            co: "421087",
            na: "松滋市"
        }]
    },
    {
        co: "421100",
        na: "黄冈市",
        ch: [{
            co: "421102",
            na: "黄州区"
        },
        {
            co: "421121",
            na: "团风县"
        },
        {
            co: "421122",
            na: "红安县"
        },
        {
            co: "421123",
            na: "罗田县"
        },
        {
            co: "421124",
            na: "英山县"
        },
        {
            co: "421125",
            na: "浠水县"
        },
        {
            co: "421126",
            na: "蕲春县"
        },
        {
            co: "421127",
            na: "黄梅县"
        },
        {
            co: "421181",
            na: "麻城市"
        },
        {
            co: "421182",
            na: "武穴市"
        }]
    },
    {
        co: "421200",
        na: "咸宁市",
        ch: [{
            co: "421202",
            na: "咸安区"
        },
        {
            co: "421221",
            na: "嘉鱼县"
        },
        {
            co: "421222",
            na: "通城县"
        },
        {
            co: "421223",
            na: "崇阳县"
        },
        {
            co: "421224",
            na: "通山县"
        },
        {
            co: "421281",
            na: "赤壁市"
        }]
    },
    {
        co: "421300",
        na: "随州市",
        ch: [{
            co: "421303",
            na: "曾都区"
        },
        {
            co: "421321",
            na: "随县"
        },
        {
            co: "421381",
            na: "广水市"
        }]
    },
    {
        co: "422800",
        na: "恩施土家族苗族自治州",
        ch: [{
            co: "422801",
            na: "恩施市"
        },
        {
            co: "422802",
            na: "利川市"
        },
        {
            co: "422822",
            na: "建始县"
        },
        {
            co: "422823",
            na: "巴东县"
        },
        {
            co: "422825",
            na: "宣恩县"
        },
        {
            co: "422826",
            na: "咸丰县"
        },
        {
            co: "422827",
            na: "来凤县"
        },
        {
            co: "422828",
            na: "鹤峰县"
        }]
    },
    {
        co: "429004",
        na: "仙桃市",
        ch: [{
            co: "429401",
            na: "沙嘴街道"
        },
        {
            co: "429402",
            na: "干河街道"
        },
        {
            co: "429403",
            na: "龙华山街道"
        },
        {
            co: "429404",
            na: "郑场镇"
        },
        {
            co: "429405",
            na: "毛嘴镇"
        },
        {
            co: "429406",
            na: "豆河镇"
        },
        {
            co: "429407",
            na: "三伏潭镇"
        },
        {
            co: "429408",
            na: "胡场镇"
        },
        {
            co: "429409",
            na: "长埫口镇"
        },
        {
            co: "429410",
            na: "西流河镇"
        },
        {
            co: "429411",
            na: "沙湖镇"
        },
        {
            co: "429412",
            na: "杨林尾镇"
        },
        {
            co: "429413",
            na: "彭场镇"
        },
        {
            co: "429414",
            na: "张沟镇"
        },
        {
            co: "429415",
            na: "郭河镇"
        },
        {
            co: "429416",
            na: "沔城镇"
        },
        {
            co: "429417",
            na: "通海口镇"
        },
        {
            co: "429418",
            na: "陈场镇"
        },
        {
            co: "429419",
            na: "高新区"
        },
        {
            co: "429420",
            na: "经济开发区"
        },
        {
            co: "429421",
            na: "工业园区"
        },
        {
            co: "429422",
            na: "九合垸原种场"
        },
        {
            co: "429423",
            na: "沙湖原种场"
        },
        {
            co: "429424",
            na: "排湖渔场"
        },
        {
            co: "429425",
            na: "五湖渔场"
        },
        {
            co: "429426",
            na: "赵西垸林场"
        },
        {
            co: "429427",
            na: "刘家垸林场"
        },
        {
            co: "429428",
            na: "畜禽良种场"
        }]
    },
    {
        co: "429005",
        na: "潜江市",
        ch: [{
            co: "429501",
            na: "园林"
        },
        {
            co: "429502",
            na: "广华"
        },
        {
            co: "429503",
            na: "杨市"
        },
        {
            co: "429504",
            na: "周矶"
        },
        {
            co: "429505",
            na: "泽口"
        },
        {
            co: "429506",
            na: "泰丰"
        },
        {
            co: "429507",
            na: "高场"
        },
        {
            co: "429508",
            na: "熊口镇"
        },
        {
            co: "429509",
            na: "竹根滩镇"
        },
        {
            co: "429510",
            na: "高石碑镇"
        },
        {
            co: "429511",
            na: "老新镇"
        },
        {
            co: "429512",
            na: "王场镇"
        },
        {
            co: "429513",
            na: "渔洋镇"
        },
        {
            co: "429514",
            na: "龙湾镇"
        },
        {
            co: "429515",
            na: "浩口镇"
        },
        {
            co: "429516",
            na: "积玉口镇"
        },
        {
            co: "429517",
            na: "张金镇"
        },
        {
            co: "429518",
            na: "白鹭湖管理区"
        },
        {
            co: "429519",
            na: "总口管理区"
        },
        {
            co: "429520",
            na: "熊口农场管理区"
        },
        {
            co: "429521",
            na: "运粮湖管理区"
        },
        {
            co: "429522",
            na: "后湖管理区"
        },
        {
            co: "429523",
            na: "周矶管理区"
        },
        {
            co: "429524",
            na: "经济开发区"
        }]
    },
    {
        co: "429006",
        na: "天门市",
        ch: [{
            co: "429601",
            na: "竟陵街道"
        },
        {
            co: "429602",
            na: "杨林街道"
        },
        {
            co: "429603",
            na: "佛子山镇"
        },
        {
            co: "429604",
            na: "多宝镇"
        },
        {
            co: "429605",
            na: "拖市镇"
        },
        {
            co: "429606",
            na: "张港镇"
        },
        {
            co: "429607",
            na: "蒋场镇"
        },
        {
            co: "429608",
            na: "汪场镇"
        },
        {
            co: "429609",
            na: "渔薪镇"
        },
        {
            co: "429610",
            na: "黄潭镇"
        },
        {
            co: "429611",
            na: "岳口镇"
        },
        {
            co: "429612",
            na: "横林镇"
        },
        {
            co: "429613",
            na: "彭市镇"
        },
        {
            co: "429614",
            na: "麻洋镇"
        },
        {
            co: "429615",
            na: "多祥镇"
        },
        {
            co: "429616",
            na: "干驿镇"
        },
        {
            co: "429617",
            na: "马湾镇"
        },
        {
            co: "429618",
            na: "卢市镇"
        },
        {
            co: "429619",
            na: "小板镇"
        },
        {
            co: "429620",
            na: "九真镇"
        },
        {
            co: "429621",
            na: "皂市镇"
        },
        {
            co: "429622",
            na: "胡市镇"
        },
        {
            co: "429623",
            na: "石河镇"
        },
        {
            co: "429624",
            na: "净潭乡"
        },
        {
            co: "429625",
            na: "蒋湖农场"
        },
        {
            co: "429626",
            na: "白茅湖农场"
        },
        {
            co: "429627",
            na: "沉湖林业科技示范区"
        },
        {
            co: "429628",
            na: "天门工业园"
        },
        {
            co: "429629",
            na: "侨乡街道开发区"
        }]
    },
    {
        co: "429021",
        na: "神农架林区",
        ch: [{
            co: "429022",
            na: "松柏镇"
        },
        {
            co: "429023",
            na: "阳日镇"
        },
        {
            co: "429024",
            na: "木鱼镇"
        },
        {
            co: "429025",
            na: "红坪镇"
        },
        {
            co: "429026",
            na: "新华镇"
        },
        {
            co: "429027",
            na: "大九湖"
        },
        {
            co: "429028",
            na: "宋洛"
        },
        {
            co: "429029",
            na: "下谷坪乡"
        }]
    }]
},
{
    co: "430000",
    na: "湖南",
    ch: [{
        co: "430100",
        na: "长沙市",
        ch: [{
            co: "430102",
            na: "芙蓉区"
        },
        {
            co: "430103",
            na: "天心区"
        },
        {
            co: "430104",
            na: "岳麓区"
        },
        {
            co: "430105",
            na: "开福区"
        },
        {
            co: "430111",
            na: "雨花区"
        },
        {
            co: "430112",
            na: "望城区"
        },
        {
            co: "430121",
            na: "长沙县"
        },
        {
            co: "430124",
            na: "宁乡县"
        },
        {
            co: "430181",
            na: "浏阳市"
        },
        {
            co: "430182",
            na: "湘江新区"
        }]
    },
    {
        co: "430200",
        na: "株洲市",
        ch: [{
            co: "430202",
            na: "荷塘区"
        },
        {
            co: "430203",
            na: "芦淞区"
        },
        {
            co: "430204",
            na: "石峰区"
        },
        {
            co: "430211",
            na: "天元区"
        },
        {
            co: "430221",
            na: "株洲县"
        },
        {
            co: "430223",
            na: "攸县"
        },
        {
            co: "430224",
            na: "茶陵县"
        },
        {
            co: "430225",
            na: "炎陵县"
        },
        {
            co: "430281",
            na: "醴陵市"
        }]
    },
    {
        co: "430300",
        na: "湘潭市",
        ch: [{
            co: "430302",
            na: "雨湖区"
        },
        {
            co: "430304",
            na: "岳塘区"
        },
        {
            co: "430321",
            na: "湘潭县"
        },
        {
            co: "430381",
            na: "湘乡市"
        },
        {
            co: "430382",
            na: "韶山市"
        },
        {
            co: "430383",
            na: "高新区"
        }]
    },
    {
        co: "430400",
        na: "衡阳市",
        ch: [{
            co: "430405",
            na: "珠晖区"
        },
        {
            co: "430406",
            na: "雁峰区"
        },
        {
            co: "430407",
            na: "石鼓区"
        },
        {
            co: "430408",
            na: "蒸湘区"
        },
        {
            co: "430412",
            na: "南岳区"
        },
        {
            co: "430421",
            na: "衡阳县"
        },
        {
            co: "430422",
            na: "衡南县"
        },
        {
            co: "430423",
            na: "衡山县"
        },
        {
            co: "430424",
            na: "衡东县"
        },
        {
            co: "430426",
            na: "祁东县"
        },
        {
            co: "430481",
            na: "耒阳市"
        },
        {
            co: "430482",
            na: "常宁市"
        }]
    },
    {
        co: "430500",
        na: "邵阳市",
        ch: [{
            co: "430502",
            na: "双清区"
        },
        {
            co: "430503",
            na: "大祥区"
        },
        {
            co: "430511",
            na: "北塔区"
        },
        {
            co: "430521",
            na: "邵东县"
        },
        {
            co: "430522",
            na: "新邵县"
        },
        {
            co: "430523",
            na: "邵阳县"
        },
        {
            co: "430524",
            na: "隆回县"
        },
        {
            co: "430525",
            na: "洞口县"
        },
        {
            co: "430527",
            na: "绥宁县"
        },
        {
            co: "430528",
            na: "新宁县"
        },
        {
            co: "430529",
            na: "城步苗族自治县"
        },
        {
            co: "430581",
            na: "武冈市"
        }]
    },
    {
        co: "430600",
        na: "岳阳市",
        ch: [{
            co: "430602",
            na: "岳阳楼区"
        },
        {
            co: "430603",
            na: "云溪区"
        },
        {
            co: "430611",
            na: "君山区"
        },
        {
            co: "430621",
            na: "岳阳县"
        },
        {
            co: "430623",
            na: "华容县"
        },
        {
            co: "430624",
            na: "湘阴县"
        },
        {
            co: "430626",
            na: "平江县"
        },
        {
            co: "430681",
            na: "汨罗市"
        },
        {
            co: "430682",
            na: "临湘市"
        }]
    },
    {
        co: "430700",
        na: "常德市",
        ch: [{
            co: "430702",
            na: "武陵区"
        },
        {
            co: "430703",
            na: "鼎城区"
        },
        {
            co: "430721",
            na: "安乡县"
        },
        {
            co: "430722",
            na: "汉寿县"
        },
        {
            co: "430723",
            na: "澧县"
        },
        {
            co: "430724",
            na: "临澧县"
        },
        {
            co: "430725",
            na: "桃源县"
        },
        {
            co: "430726",
            na: "石门县"
        },
        {
            co: "430781",
            na: "津市市"
        }]
    },
    {
        co: "430800",
        na: "张家界市",
        ch: [{
            co: "430802",
            na: "永定区"
        },
        {
            co: "430811",
            na: "武陵源区"
        },
        {
            co: "430821",
            na: "慈利县"
        },
        {
            co: "430822",
            na: "桑植县"
        }]
    },
    {
        co: "430900",
        na: "益阳市",
        ch: [{
            co: "430902",
            na: "资阳区"
        },
        {
            co: "430903",
            na: "赫山区"
        },
        {
            co: "430921",
            na: "南县"
        },
        {
            co: "430922",
            na: "桃江县"
        },
        {
            co: "430923",
            na: "安化县"
        },
        {
            co: "430981",
            na: "沅江市"
        }]
    },
    {
        co: "431000",
        na: "郴州市",
        ch: [{
            co: "431002",
            na: "北湖区"
        },
        {
            co: "431003",
            na: "苏仙区"
        },
        {
            co: "431021",
            na: "桂阳县"
        },
        {
            co: "431022",
            na: "宜章县"
        },
        {
            co: "431023",
            na: "永兴县"
        },
        {
            co: "431024",
            na: "嘉禾县"
        },
        {
            co: "431025",
            na: "临武县"
        },
        {
            co: "431026",
            na: "汝城县"
        },
        {
            co: "431027",
            na: "桂东县"
        },
        {
            co: "431028",
            na: "安仁县"
        },
        {
            co: "431081",
            na: "资兴市"
        }]
    },
    {
        co: "431100",
        na: "永州市",
        ch: [{
            co: "431102",
            na: "零陵区"
        },
        {
            co: "431103",
            na: "冷水滩区"
        },
        {
            co: "431121",
            na: "祁阳县"
        },
        {
            co: "431122",
            na: "东安县"
        },
        {
            co: "431123",
            na: "双牌县"
        },
        {
            co: "431124",
            na: "道县"
        },
        {
            co: "431125",
            na: "江永县"
        },
        {
            co: "431126",
            na: "宁远县"
        },
        {
            co: "431127",
            na: "蓝山县"
        },
        {
            co: "431128",
            na: "新田县"
        },
        {
            co: "431129",
            na: "江华瑶族自治县"
        }]
    },
    {
        co: "431200",
        na: "怀化市",
        ch: [{
            co: "431202",
            na: "鹤城区"
        },
        {
            co: "431221",
            na: "中方县"
        },
        {
            co: "431222",
            na: "沅陵县"
        },
        {
            co: "431223",
            na: "辰溪县"
        },
        {
            co: "431224",
            na: "溆浦县"
        },
        {
            co: "431225",
            na: "会同县"
        },
        {
            co: "431226",
            na: "麻阳苗族自治县"
        },
        {
            co: "431227",
            na: "新晃侗族自治县"
        },
        {
            co: "431228",
            na: "芷江侗族自治县"
        },
        {
            co: "431229",
            na: "靖州苗族侗族自治县"
        },
        {
            co: "431230",
            na: "通道侗族自治县"
        },
        {
            co: "431281",
            na: "洪江市"
        }]
    },
    {
        co: "431300",
        na: "娄底市",
        ch: [{
            co: "431302",
            na: "娄星区"
        },
        {
            co: "431321",
            na: "双峰县"
        },
        {
            co: "431322",
            na: "新化县"
        },
        {
            co: "431381",
            na: "冷水江市"
        },
        {
            co: "431382",
            na: "涟源市"
        }]
    },
    {
        co: "433100",
        na: "湘西土家族苗族自治州",
        ch: [{
            co: "433101",
            na: "吉首市"
        },
        {
            co: "433122",
            na: "泸溪县"
        },
        {
            co: "433123",
            na: "凤凰县"
        },
        {
            co: "433124",
            na: "花垣县"
        },
        {
            co: "433125",
            na: "保靖县"
        },
        {
            co: "433126",
            na: "古丈县"
        },
        {
            co: "433127",
            na: "永顺县"
        },
        {
            co: "433130",
            na: "龙山县"
        }]
    }]
},
{
    co: "440000",
    na: "广东",
    ch: [{
        co: "440100",
        na: "广州市",
        ch: [{
            co: "440103",
            na: "荔湾区"
        },
        {
            co: "440104",
            na: "越秀区"
        },
        {
            co: "440105",
            na: "海珠区"
        },
        {
            co: "440106",
            na: "天河区"
        },
        {
            co: "440111",
            na: "白云区"
        },
        {
            co: "440112",
            na: "黄埔区"
        },
        {
            co: "440113",
            na: "番禺区"
        },
        {
            co: "440114",
            na: "花都区"
        },
        {
            co: "440115",
            na: "南沙新区"
        },
        {
            co: "440117",
            na: "从化区"
        },
        {
            co: "440118",
            na: "增城区"
        }]
    },
    {
        co: "440200",
        na: "韶关市",
        ch: [{
            co: "440203",
            na: "武江区"
        },
        {
            co: "440204",
            na: "浈江区"
        },
        {
            co: "440205",
            na: "曲江区"
        },
        {
            co: "440222",
            na: "始兴县"
        },
        {
            co: "440224",
            na: "仁化县"
        },
        {
            co: "440229",
            na: "翁源县"
        },
        {
            co: "440232",
            na: "乳源瑶族自治县"
        },
        {
            co: "440233",
            na: "新丰县"
        },
        {
            co: "440281",
            na: "乐昌市"
        },
        {
            co: "440282",
            na: "南雄市"
        }]
    },
    {
        co: "440300",
        na: "深圳市",
        ch: [{
            co: "440303",
            na: "罗湖区"
        },
        {
            co: "440304",
            na: "福田区"
        },
        {
            co: "440305",
            na: "南山区"
        },
        {
            co: "440306",
            na: "宝安区"
        },
        {
            co: "440307",
            na: "龙岗区"
        },
        {
            co: "440308",
            na: "盐田区"
        },
        {
            co: "440309",
            na: "光明新区"
        },
        {
            co: "440310",
            na: "坪山新区"
        },
        {
            co: "440311",
            na: "大鹏新区"
        },
        {
            co: "440312",
            na: "龙华新区"
        }]
    },
    {
        co: "440400",
        na: "珠海市",
        ch: [{
            co: "440402",
            na: "香洲区"
        },
        {
            co: "440403",
            na: "斗门区"
        },
        {
            co: "440404",
            na: "金湾区"
        },
        {
            co: "440405",
            na: "横琴新区"
        },
        {
            co: "440406",
            na: "经济开发区"
        }]
    },
    {
        co: "440500",
        na: "汕头市",
        ch: [{
            co: "440507",
            na: "龙湖区"
        },
        {
            co: "440511",
            na: "金平区"
        },
        {
            co: "440512",
            na: "濠江区"
        },
        {
            co: "440513",
            na: "潮阳区"
        },
        {
            co: "440514",
            na: "潮南区"
        },
        {
            co: "440515",
            na: "澄海区"
        },
        {
            co: "440523",
            na: "南澳县"
        }]
    },
    {
        co: "440600",
        na: "佛山市",
        ch: [{
            co: "440604",
            na: "禅城区"
        },
        {
            co: "440605",
            na: "南海区"
        },
        {
            co: "440606",
            na: "顺德区"
        },
        {
            co: "440607",
            na: "三水区"
        },
        {
            co: "440608",
            na: "高明区"
        }]
    },
    {
        co: "440700",
        na: "江门市",
        ch: [{
            co: "440703",
            na: "蓬江区"
        },
        {
            co: "440704",
            na: "江海区"
        },
        {
            co: "440705",
            na: "新会区"
        },
        {
            co: "440781",
            na: "台山市"
        },
        {
            co: "440783",
            na: "开平市"
        },
        {
            co: "440784",
            na: "鹤山市"
        },
        {
            co: "440785",
            na: "恩平市"
        }]
    },
    {
        co: "440800",
        na: "湛江市",
        ch: [{
            co: "440802",
            na: "赤坎区"
        },
        {
            co: "440803",
            na: "霞山区"
        },
        {
            co: "440804",
            na: "坡头区"
        },
        {
            co: "440811",
            na: "麻章区"
        },
        {
            co: "440823",
            na: "遂溪县"
        },
        {
            co: "440825",
            na: "徐闻县"
        },
        {
            co: "440881",
            na: "廉江市"
        },
        {
            co: "440882",
            na: "雷州市"
        },
        {
            co: "440883",
            na: "吴川市"
        },
        {
            co: "440884",
            na: "经济开发区"
        }]
    },
    {
        co: "440900",
        na: "茂名市",
        ch: [{
            co: "440902",
            na: "茂南区"
        },
        {
            co: "440904",
            na: "电白区"
        },
        {
            co: "440981",
            na: "高州市"
        },
        {
            co: "440982",
            na: "化州市"
        },
        {
            co: "440983",
            na: "信宜市"
        }]
    },
    {
        co: "441200",
        na: "肇庆市",
        ch: [{
            co: "441202",
            na: "端州区"
        },
        {
            co: "441203",
            na: "鼎湖区"
        },
        {
            co: "441204",
            na: "高要区"
        },
        {
            co: "441223",
            na: "广宁县"
        },
        {
            co: "441224",
            na: "怀集县"
        },
        {
            co: "441225",
            na: "封开县"
        },
        {
            co: "441226",
            na: "德庆县"
        },
        {
            co: "441284",
            na: "四会市"
        }]
    },
    {
        co: "441300",
        na: "惠州市",
        ch: [{
            co: "441302",
            na: "惠城区"
        },
        {
            co: "441303",
            na: "惠阳区"
        },
        {
            co: "441322",
            na: "博罗县"
        },
        {
            co: "441323",
            na: "惠东县"
        },
        {
            co: "441324",
            na: "龙门县"
        },
        {
            co: "441325",
            na: "大亚湾区"
        }]
    },
    {
        co: "441400",
        na: "梅州市",
        ch: [{
            co: "441402",
            na: "梅江区"
        },
        {
            co: "441403",
            na: "梅县区"
        },
        {
            co: "441422",
            na: "大埔县"
        },
        {
            co: "441423",
            na: "丰顺县"
        },
        {
            co: "441424",
            na: "五华县"
        },
        {
            co: "441426",
            na: "平远县"
        },
        {
            co: "441427",
            na: "蕉岭县"
        },
        {
            co: "441481",
            na: "兴宁市"
        }]
    },
    {
        co: "441500",
        na: "汕尾市",
        ch: [{
            co: "441502",
            na: "城区"
        },
        {
            co: "441521",
            na: "海丰县"
        },
        {
            co: "441523",
            na: "陆河县"
        },
        {
            co: "441581",
            na: "陆丰市"
        }]
    },
    {
        co: "441600",
        na: "河源市",
        ch: [{
            co: "441602",
            na: "源城区"
        },
        {
            co: "441621",
            na: "紫金县"
        },
        {
            co: "441622",
            na: "龙川县"
        },
        {
            co: "441623",
            na: "连平县"
        },
        {
            co: "441624",
            na: "和平县"
        },
        {
            co: "441625",
            na: "东源县"
        }]
    },
    {
        co: "441700",
        na: "阳江市",
        ch: [{
            co: "441702",
            na: "江城区"
        },
        {
            co: "441704",
            na: "阳东区"
        },
        {
            co: "441721",
            na: "阳西县"
        },
        {
            co: "441781",
            na: "阳春市"
        }]
    },
    {
        co: "441800",
        na: "清远市",
        ch: [{
            co: "441802",
            na: "清城区"
        },
        {
            co: "441803",
            na: "清新区"
        },
        {
            co: "441821",
            na: "佛冈县"
        },
        {
            co: "441823",
            na: "阳山县"
        },
        {
            co: "441825",
            na: "连山壮族瑶族自治县"
        },
        {
            co: "441826",
            na: "连南瑶族自治县"
        },
        {
            co: "441881",
            na: "英德市"
        },
        {
            co: "441882",
            na: "连州市"
        }]
    },
    {
        co: "441900",
        na: "东莞市",
        ch: [{
            co: "441901",
            na: "莞城区"
        },
        {
            co: "441902",
            na: "南城区"
        },
        {
            co: "441903",
            na: "东城区"
        },
        {
            co: "441904",
            na: "万江区"
        },
        {
            co: "441905",
            na: "石碣镇"
        },
        {
            co: "441906",
            na: "石龙镇"
        },
        {
            co: "441907",
            na: "茶山镇"
        },
        {
            co: "441908",
            na: "石排镇"
        },
        {
            co: "441909",
            na: "企石镇"
        },
        {
            co: "441910",
            na: "横沥镇"
        },
        {
            co: "441911",
            na: "桥头镇"
        },
        {
            co: "441912",
            na: "谢岗镇"
        },
        {
            co: "441913",
            na: "东坑镇"
        },
        {
            co: "441914",
            na: "常平镇"
        },
        {
            co: "441915",
            na: "寮步镇"
        },
        {
            co: "441916",
            na: "大朗镇"
        },
        {
            co: "441917",
            na: "麻涌镇"
        },
        {
            co: "441918",
            na: "中堂镇"
        },
        {
            co: "441919",
            na: "高埗镇"
        },
        {
            co: "441920",
            na: "樟木头镇"
        },
        {
            co: "441921",
            na: "大岭山镇"
        },
        {
            co: "441922",
            na: "望牛墩镇"
        },
        {
            co: "441923",
            na: "黄江镇"
        },
        {
            co: "441924",
            na: "洪梅镇"
        },
        {
            co: "441925",
            na: "清溪镇"
        },
        {
            co: "441926",
            na: "沙田镇"
        },
        {
            co: "441927",
            na: "道滘镇"
        },
        {
            co: "441928",
            na: "塘厦镇"
        },
        {
            co: "441929",
            na: "虎门镇"
        },
        {
            co: "441930",
            na: "厚街镇"
        },
        {
            co: "441931",
            na: "凤岗镇"
        },
        {
            co: "441932",
            na: "长安镇"
        },
        {
            co: "441933",
            na: "松山湖高新区"
        }]
    },
    {
        co: "442000",
        na: "中山市",
        ch: [{
            co: "442001",
            na: "石岐区"
        },
        {
            co: "442002",
            na: "东区"
        },
        {
            co: "442003",
            na: "西区"
        },
        {
            co: "442004",
            na: "南区"
        },
        {
            co: "442005",
            na: "五桂山区"
        },
        {
            co: "442006",
            na: "火炬开发区"
        },
        {
            co: "442007",
            na: "黄圃镇"
        },
        {
            co: "442008",
            na: "南头镇"
        },
        {
            co: "442009",
            na: "东凤镇"
        },
        {
            co: "442010",
            na: "阜沙镇"
        },
        {
            co: "442011",
            na: "小榄镇"
        },
        {
            co: "442012",
            na: "东升镇"
        },
        {
            co: "442013",
            na: "古镇镇"
        },
        {
            co: "442014",
            na: "横栏镇"
        },
        {
            co: "442015",
            na: "三角镇"
        },
        {
            co: "442016",
            na: "民众镇"
        },
        {
            co: "442017",
            na: "南朗镇"
        },
        {
            co: "442018",
            na: "港口镇"
        },
        {
            co: "442019",
            na: "大涌镇"
        },
        {
            co: "442020",
            na: "沙溪镇"
        },
        {
            co: "442021",
            na: "三乡镇"
        },
        {
            co: "442022",
            na: "板芙镇"
        },
        {
            co: "442023",
            na: "神湾镇"
        },
        {
            co: "442024",
            na: "坦洲镇"
        }]
    },
    {
        co: "445100",
        na: "潮州市",
        ch: [{
            co: "445102",
            na: "湘桥区"
        },
        {
            co: "445103",
            na: "潮安区"
        },
        {
            co: "445122",
            na: "饶平县"
        }]
    },
    {
        co: "445200",
        na: "揭阳市",
        ch: [{
            co: "445202",
            na: "榕城区"
        },
        {
            co: "445203",
            na: "揭东区"
        },
        {
            co: "445222",
            na: "揭西县"
        },
        {
            co: "445224",
            na: "惠来县"
        },
        {
            co: "445281",
            na: "普宁市"
        }]
    },
    {
        co: "445300",
        na: "云浮市",
        ch: [{
            co: "445302",
            na: "云城区"
        },
        {
            co: "445303",
            na: "云安区"
        },
        {
            co: "445321",
            na: "新兴县"
        },
        {
            co: "445322",
            na: "郁南县"
        },
        {
            co: "445381",
            na: "罗定市"
        }]
    }]
},
{
    co: "450000",
    na: "广西",
    ch: [{
        co: "450100",
        na: "南宁市",
        ch: [{
            co: "450102",
            na: "兴宁区"
        },
        {
            co: "450103",
            na: "青秀区"
        },
        {
            co: "450105",
            na: "江南区"
        },
        {
            co: "450107",
            na: "西乡塘区"
        },
        {
            co: "450108",
            na: "良庆区"
        },
        {
            co: "450109",
            na: "邕宁区"
        },
        {
            co: "450110",
            na: "武鸣区"
        },
        {
            co: "450123",
            na: "隆安县"
        },
        {
            co: "450124",
            na: "马山县"
        },
        {
            co: "450125",
            na: "上林县"
        },
        {
            co: "450126",
            na: "宾阳县"
        },
        {
            co: "450127",
            na: "横县"
        },
        {
            co: "450128",
            na: "埌东新区"
        }]
    },
    {
        co: "450200",
        na: "柳州市",
        ch: [{
            co: "450202",
            na: "城中区"
        },
        {
            co: "450203",
            na: "鱼峰区"
        },
        {
            co: "450204",
            na: "柳南区"
        },
        {
            co: "450205",
            na: "柳北区"
        },
        {
            co: "450221",
            na: "柳江区"
        },
        {
            co: "450222",
            na: "柳城县"
        },
        {
            co: "450223",
            na: "鹿寨县"
        },
        {
            co: "450224",
            na: "融安县"
        },
        {
            co: "450225",
            na: "融水苗族自治县"
        },
        {
            co: "450226",
            na: "三江侗族自治县"
        },
        {
            co: "450227",
            na: "柳东新区"
        }]
    },
    {
        co: "450300",
        na: "桂林市",
        ch: [{
            co: "450302",
            na: "秀峰区"
        },
        {
            co: "450303",
            na: "叠彩区"
        },
        {
            co: "450304",
            na: "象山区"
        },
        {
            co: "450305",
            na: "七星区"
        },
        {
            co: "450311",
            na: "雁山区"
        },
        {
            co: "450312",
            na: "临桂区"
        },
        {
            co: "450321",
            na: "阳朔县"
        },
        {
            co: "450323",
            na: "灵川县"
        },
        {
            co: "450324",
            na: "全州县"
        },
        {
            co: "450325",
            na: "兴安县"
        },
        {
            co: "450326",
            na: "永福县"
        },
        {
            co: "450327",
            na: "灌阳县"
        },
        {
            co: "450328",
            na: "龙胜各族自治县"
        },
        {
            co: "450329",
            na: "资源县"
        },
        {
            co: "450330",
            na: "平乐县"
        },
        {
            co: "450331",
            na: "荔浦县"
        },
        {
            co: "450332",
            na: "恭城瑶族自治县"
        }]
    },
    {
        co: "450400",
        na: "梧州市",
        ch: [{
            co: "450403",
            na: "万秀区"
        },
        {
            co: "450405",
            na: "长洲区"
        },
        {
            co: "450406",
            na: "龙圩区"
        },
        {
            co: "450421",
            na: "苍梧县"
        },
        {
            co: "450422",
            na: "藤县"
        },
        {
            co: "450423",
            na: "蒙山县"
        },
        {
            co: "450481",
            na: "岑溪市"
        }]
    },
    {
        co: "450500",
        na: "北海市",
        ch: [{
            co: "450502",
            na: "海城区"
        },
        {
            co: "450503",
            na: "银海区"
        },
        {
            co: "450512",
            na: "铁山港区"
        },
        {
            co: "450521",
            na: "合浦县"
        }]
    },
    {
        co: "450600",
        na: "防城港市",
        ch: [{
            co: "450602",
            na: "港口区"
        },
        {
            co: "450603",
            na: "防城区"
        },
        {
            co: "450621",
            na: "上思县"
        },
        {
            co: "450681",
            na: "东兴市"
        }]
    },
    {
        co: "450700",
        na: "钦州市",
        ch: [{
            co: "450702",
            na: "钦南区"
        },
        {
            co: "450703",
            na: "钦北区"
        },
        {
            co: "450721",
            na: "灵山县"
        },
        {
            co: "450722",
            na: "浦北县"
        }]
    },
    {
        co: "450800",
        na: "贵港市",
        ch: [{
            co: "450802",
            na: "港北区"
        },
        {
            co: "450803",
            na: "港南区"
        },
        {
            co: "450804",
            na: "覃塘区"
        },
        {
            co: "450821",
            na: "平南县"
        },
        {
            co: "450881",
            na: "桂平市"
        }]
    },
    {
        co: "450900",
        na: "玉林市",
        ch: [{
            co: "450902",
            na: "玉州区"
        },
        {
            co: "450903",
            na: "福绵区"
        },
        {
            co: "450904",
            na: "玉东新区"
        },
        {
            co: "450921",
            na: "容县"
        },
        {
            co: "450922",
            na: "陆川县"
        },
        {
            co: "450923",
            na: "博白县"
        },
        {
            co: "450924",
            na: "兴业县"
        },
        {
            co: "450981",
            na: "北流市"
        }]
    },
    {
        co: "451000",
        na: "百色市",
        ch: [{
            co: "451002",
            na: "右江区"
        },
        {
            co: "451021",
            na: "田阳县"
        },
        {
            co: "451022",
            na: "田东县"
        },
        {
            co: "451023",
            na: "平果县"
        },
        {
            co: "451024",
            na: "德保县"
        },
        {
            co: "451026",
            na: "那坡县"
        },
        {
            co: "451027",
            na: "凌云县"
        },
        {
            co: "451028",
            na: "乐业县"
        },
        {
            co: "451029",
            na: "田林县"
        },
        {
            co: "451030",
            na: "西林县"
        },
        {
            co: "451031",
            na: "隆林各族自治县"
        },
        {
            co: "451081",
            na: "靖西市"
        }]
    },
    {
        co: "451100",
        na: "贺州市",
        ch: [{
            co: "451102",
            na: "八步区"
        },
        {
            co: "451103",
            na: "平桂区"
        },
        {
            co: "451121",
            na: "昭平县"
        },
        {
            co: "451122",
            na: "钟山县"
        },
        {
            co: "451123",
            na: "富川瑶族自治县"
        }]
    },
    {
        co: "451200",
        na: "河池市",
        ch: [{
            co: "451202",
            na: "金城江区"
        },
        {
            co: "451221",
            na: "南丹县"
        },
        {
            co: "451222",
            na: "天峨县"
        },
        {
            co: "451223",
            na: "凤山县"
        },
        {
            co: "451224",
            na: "东兰县"
        },
        {
            co: "451225",
            na: "罗城仫佬族自治县"
        },
        {
            co: "451226",
            na: "环江毛南族自治县"
        },
        {
            co: "451227",
            na: "巴马瑶族自治县"
        },
        {
            co: "451228",
            na: "都安瑶族自治县"
        },
        {
            co: "451229",
            na: "大化瑶族自治县"
        },
        {
            co: "451281",
            na: "宜州市"
        }]
    },
    {
        co: "451300",
        na: "来宾市",
        ch: [{
            co: "451302",
            na: "兴宾区"
        },
        {
            co: "451321",
            na: "忻城县"
        },
        {
            co: "451322",
            na: "象州县"
        },
        {
            co: "451323",
            na: "武宣县"
        },
        {
            co: "451324",
            na: "金秀瑶族自治县"
        },
        {
            co: "451381",
            na: "合山市"
        }]
    },
    {
        co: "451400",
        na: "崇左市",
        ch: [{
            co: "451402",
            na: "江州区"
        },
        {
            co: "451421",
            na: "扶绥县"
        },
        {
            co: "451422",
            na: "宁明县"
        },
        {
            co: "451423",
            na: "龙州县"
        },
        {
            co: "451424",
            na: "大新县"
        },
        {
            co: "451425",
            na: "天等县"
        },
        {
            co: "451481",
            na: "凭祥市"
        }]
    }]
},
{
    co: "460000",
    na: "海南",
    ch: [{
        co: "460100",
        na: "海口市",
        ch: [{
            co: "460105",
            na: "秀英区"
        },
        {
            co: "460106",
            na: "龙华区"
        },
        {
            co: "460107",
            na: "琼山区"
        },
        {
            co: "460108",
            na: "美兰区"
        }]
    },
    {
        co: "460200",
        na: "三亚市",
        ch: [{
            co: "460202",
            na: "海棠区"
        },
        {
            co: "460203",
            na: "吉阳区"
        },
        {
            co: "460204",
            na: "天涯区"
        },
        {
            co: "460205",
            na: "崖州区"
        }]
    },
    {
        co: "460300",
        na: "三沙市",
        ch: [{
            co: "460321",
            na: "西沙群岛"
        },
        {
            co: "460322",
            na: "南沙群岛"
        },
        {
            co: "460323",
            na: "中沙群岛"
        }]
    },
    {
        co: "460400",
        na: "儋州市",
        ch: [{
            co: "460401",
            na: "洋浦经济开发区"
        },
        {
            co: "460402",
            na: "那大镇"
        },
        {
            co: "460403",
            na: "南丰镇"
        },
        {
            co: "460404",
            na: "雅星镇"
        },
        {
            co: "460405",
            na: "和庆镇"
        },
        {
            co: "460406",
            na: "大成镇"
        },
        {
            co: "460407",
            na: "新州镇"
        },
        {
            co: "460408",
            na: "光村镇"
        },
        {
            co: "460409",
            na: "东成镇"
        },
        {
            co: "460410",
            na: "中和镇"
        },
        {
            co: "460411",
            na: "峨蔓镇"
        },
        {
            co: "460412",
            na: "兰洋镇"
        },
        {
            co: "460413",
            na: "王五镇"
        },
        {
            co: "460414",
            na: "排浦镇"
        },
        {
            co: "460415",
            na: "海头镇"
        },
        {
            co: "460416",
            na: "木棠镇"
        },
        {
            co: "460417",
            na: "白马井镇"
        },
        {
            co: "460418",
            na: "三都镇"
        },
        {
            co: "460419",
            na: "西培农场"
        },
        {
            co: "460420",
            na: "西联农场"
        },
        {
            co: "460421",
            na: "蓝洋农场"
        },
        {
            co: "460422",
            na: "八一农场"
        },
        {
            co: "460423",
            na: "西华农场"
        },
        {
            co: "460424",
            na: "西庆农场"
        },
        {
            co: "460425",
            na: "西流农场"
        },
        {
            co: "460426",
            na: "新盈农场"
        },
        {
            co: "460427",
            na: "龙山农场"
        },
        {
            co: "460428",
            na: "红岭农场"
        }]
    },
    {
        co: "469001",
        na: "五指山市",
        ch: [{
            co: "469101",
            na: "通什镇"
        },
        {
            co: "469102",
            na: "南圣镇"
        },
        {
            co: "469103",
            na: "毛阳镇"
        },
        {
            co: "469104",
            na: "番阳镇"
        },
        {
            co: "469105",
            na: "畅好乡"
        },
        {
            co: "469106",
            na: "毛道乡"
        },
        {
            co: "469107",
            na: "水满乡"
        }]
    },
    {
        co: "469002",
        na: "琼海市",
        ch: [{
            co: "469201",
            na: "嘉积镇"
        },
        {
            co: "469202",
            na: "万泉镇"
        },
        {
            co: "469203",
            na: "石壁镇"
        },
        {
            co: "469204",
            na: "中原镇"
        },
        {
            co: "469205",
            na: "博鳌镇"
        },
        {
            co: "469206",
            na: "阳江镇"
        },
        {
            co: "469207",
            na: "龙江镇"
        },
        {
            co: "469208",
            na: "潭门镇"
        },
        {
            co: "469209",
            na: "塔洋镇"
        },
        {
            co: "469210",
            na: "长坡镇"
        },
        {
            co: "469211",
            na: "大路镇"
        },
        {
            co: "469212",
            na: "会山镇"
        },
        {
            co: "469213",
            na: "东太农场"
        },
        {
            co: "469214",
            na: "东红农场"
        },
        {
            co: "469215",
            na: "东升农场"
        },
        {
            co: "469216",
            na: "南俸农场"
        },
        {
            co: "469217",
            na: "彬村山华侨农场"
        }]
    },
    {
        co: "469005",
        na: "文昌市",
        ch: [{
            co: "469501",
            na: "文城镇"
        },
        {
            co: "469502",
            na: "重兴镇"
        },
        {
            co: "469503",
            na: "蓬莱镇"
        },
        {
            co: "469504",
            na: "会文镇"
        },
        {
            co: "469505",
            na: "东路镇"
        },
        {
            co: "469506",
            na: "潭牛镇"
        },
        {
            co: "469507",
            na: "东阁镇"
        },
        {
            co: "469508",
            na: "文教镇"
        },
        {
            co: "469509",
            na: "东郊镇"
        },
        {
            co: "469510",
            na: "龙楼镇"
        },
        {
            co: "469511",
            na: "昌洒镇"
        },
        {
            co: "469512",
            na: "翁田镇"
        },
        {
            co: "469513",
            na: "抱罗镇"
        },
        {
            co: "469514",
            na: "冯坡镇"
        },
        {
            co: "469515",
            na: "锦山镇"
        },
        {
            co: "469516",
            na: "铺前镇"
        },
        {
            co: "469517",
            na: "公坡镇"
        },
        {
            co: "469518",
            na: "迈号镇"
        },
        {
            co: "469519",
            na: "清谰镇"
        },
        {
            co: "469520",
            na: "南阳镇"
        },
        {
            co: "469521",
            na: "新桥镇"
        },
        {
            co: "469522",
            na: "头苑镇"
        },
        {
            co: "469523",
            na: "宝芳乡"
        },
        {
            co: "469524",
            na: "龙马乡"
        },
        {
            co: "469525",
            na: "湖山乡"
        },
        {
            co: "469526",
            na: "东路农场"
        },
        {
            co: "469527",
            na: "南阳农场"
        },
        {
            co: "469528",
            na: "罗豆农场"
        }]
    },
    {
        co: "469006",
        na: "万宁市",
        ch: [{
            co: "469601",
            na: "万城镇"
        },
        {
            co: "469602",
            na: "龙滚镇"
        },
        {
            co: "469603",
            na: "和乐镇"
        },
        {
            co: "469604",
            na: "后安镇"
        },
        {
            co: "469605",
            na: "大茂镇"
        },
        {
            co: "469606",
            na: "东澳镇"
        },
        {
            co: "469607",
            na: "礼纪镇"
        },
        {
            co: "469608",
            na: "长丰镇"
        },
        {
            co: "469609",
            na: "山根镇"
        },
        {
            co: "469610",
            na: "北大镇"
        },
        {
            co: "469611",
            na: "南桥镇"
        },
        {
            co: "469612",
            na: "三更罗镇"
        },
        {
            co: "469613",
            na: "东岭农场"
        },
        {
            co: "469614",
            na: "南林农场"
        },
        {
            co: "469615",
            na: "东兴农场"
        },
        {
            co: "469616",
            na: "东和农场"
        },
        {
            co: "469617",
            na: "新中农场"
        },
        {
            co: "469618",
            na: "兴隆华侨农场"
        }]
    },
    {
        co: "469007",
        na: "东方市",
        ch: [{
            co: "469701",
            na: "八所镇"
        },
        {
            co: "469702",
            na: "东河镇"
        },
        {
            co: "469703",
            na: "大田镇"
        },
        {
            co: "469704",
            na: "感城镇"
        },
        {
            co: "469705",
            na: "板桥镇"
        },
        {
            co: "469706",
            na: "三家镇"
        },
        {
            co: "469707",
            na: "四更镇"
        },
        {
            co: "469708",
            na: "新龙镇"
        },
        {
            co: "469709",
            na: "天安乡"
        },
        {
            co: "469710",
            na: "江边乡"
        },
        {
            co: "469711",
            na: "广坝农场"
        },
        {
            co: "469712",
            na: "东方华侨农场"
        }]
    },
    {
        co: "469021",
        na: "定安县",
        ch: [{
            co: "469801",
            na: "定城镇"
        },
        {
            co: "469802",
            na: "新竹镇"
        },
        {
            co: "469803",
            na: "龙湖镇"
        },
        {
            co: "469804",
            na: "雷鸣镇"
        },
        {
            co: "469805",
            na: "龙门镇"
        },
        {
            co: "469806",
            na: "龙河镇"
        },
        {
            co: "469807",
            na: "岭口镇"
        },
        {
            co: "469808",
            na: "翰林镇"
        },
        {
            co: "469809",
            na: "富文镇"
        },
        {
            co: "469810",
            na: "黄竹镇"
        },
        {
            co: "469811",
            na: "金鸡岭农场"
        },
        {
            co: "469812",
            na: "中瑞农场"
        },
        {
            co: "469813",
            na: "南海农场"
        },
        {
            co: "469814",
            na: "城区"
        }]
    },
    {
        co: "469022",
        na: "屯昌县",
        ch: [{
            co: "469821",
            na: "屯城镇"
        },
        {
            co: "469822",
            na: "新兴镇"
        },
        {
            co: "469823",
            na: "枫木镇"
        },
        {
            co: "469824",
            na: "乌坡镇"
        },
        {
            co: "469825",
            na: "南吕镇"
        },
        {
            co: "469826",
            na: "南坤镇"
        },
        {
            co: "469827",
            na: "坡心镇"
        },
        {
            co: "469828",
            na: "西昌镇"
        },
        {
            co: "469829",
            na: "中建农场"
        },
        {
            co: "469830",
            na: "中坤农场"
        },
        {
            co: "469831",
            na: "县城内"
        }]
    },
    {
        co: "469023",
        na: "澄迈县",
        ch: [{
            co: "469841",
            na: "金江镇"
        },
        {
            co: "469842",
            na: "老城镇"
        },
        {
            co: "469843",
            na: "瑞溪镇"
        },
        {
            co: "469844",
            na: "永发镇"
        },
        {
            co: "469845",
            na: "加乐镇"
        },
        {
            co: "469846",
            na: "文儒镇"
        },
        {
            co: "469847",
            na: "中兴镇"
        },
        {
            co: "469848",
            na: "仁兴镇"
        },
        {
            co: "469849",
            na: "福山镇"
        },
        {
            co: "469850",
            na: "桥头镇"
        },
        {
            co: "469851",
            na: "大丰镇"
        },
        {
            co: "469852",
            na: "红光农场"
        },
        {
            co: "469853",
            na: "西达农场"
        },
        {
            co: "469854",
            na: "金安农场"
        },
        {
            co: "469855",
            na: "城区"
        }]
    },
    {
        co: "469024",
        na: "临高县",
        ch: [{
            co: "469861",
            na: "临城镇"
        },
        {
            co: "469862",
            na: "波莲镇"
        },
        {
            co: "469863",
            na: "东英镇"
        },
        {
            co: "469864",
            na: "博厚镇"
        },
        {
            co: "469865",
            na: "皇桐镇"
        },
        {
            co: "469866",
            na: "多文镇"
        },
        {
            co: "469867",
            na: "和舍镇"
        },
        {
            co: "469868",
            na: "南宝镇"
        },
        {
            co: "469869",
            na: "新盈镇"
        },
        {
            co: "469870",
            na: "调楼镇"
        },
        {
            co: "469871",
            na: "加来镇"
        },
        {
            co: "469872",
            na: "红华农场"
        },
        {
            co: "469873",
            na: "加来农场"
        },
        {
            co: "469874",
            na: "城区"
        }]
    },
    {
        co: "469025",
        na: "白沙黎族自治县",
        ch: [{
            co: "469881",
            na: "牙叉镇"
        },
        {
            co: "469882",
            na: "七坊镇"
        },
        {
            co: "469883",
            na: "邦溪镇"
        },
        {
            co: "469884",
            na: "打安镇"
        },
        {
            co: "469885",
            na: "细水乡"
        },
        {
            co: "469886",
            na: "元门乡"
        },
        {
            co: "469887",
            na: "南开乡"
        },
        {
            co: "469888",
            na: "阜龙乡"
        },
        {
            co: "469889",
            na: "青松乡"
        },
        {
            co: "469890",
            na: "金波乡"
        },
        {
            co: "469891",
            na: "荣邦乡"
        },
        {
            co: "469892",
            na: "白沙农场"
        },
        {
            co: "469893",
            na: "龙江农场"
        },
        {
            co: "469894",
            na: "邦溪农场"
        },
        {
            co: "469895",
            na: "城区"
        }]
    },
    {
        co: "469026",
        na: "昌江黎族自治县",
        ch: [{
            co: "469901",
            na: "石碌镇"
        },
        {
            co: "469902",
            na: "叉河镇"
        },
        {
            co: "469903",
            na: "十月田镇"
        },
        {
            co: "469904",
            na: "乌烈镇"
        },
        {
            co: "469905",
            na: "海尾镇"
        },
        {
            co: "469906",
            na: "南罗镇"
        },
        {
            co: "469907",
            na: "太坡镇"
        },
        {
            co: "469908",
            na: "昌化镇"
        },
        {
            co: "469909",
            na: "七叉镇"
        },
        {
            co: "469910",
            na: "保平乡"
        },
        {
            co: "469911",
            na: "昌城乡"
        },
        {
            co: "469912",
            na: "王下乡"
        },
        {
            co: "469913",
            na: "霸王岭林场"
        },
        {
            co: "469914",
            na: "红林农场"
        },
        {
            co: "469915",
            na: "城区"
        }]
    },
    {
        co: "469027",
        na: "乐东黎族自治县",
        ch: [{
            co: "469920",
            na: "抱由镇"
        },
        {
            co: "469921",
            na: "万冲镇"
        },
        {
            co: "469922",
            na: "大安镇"
        },
        {
            co: "469923",
            na: "志仲镇"
        },
        {
            co: "469924",
            na: "千家镇"
        },
        {
            co: "469925",
            na: "九所镇"
        },
        {
            co: "469926",
            na: "利国镇"
        },
        {
            co: "469927",
            na: "黄流镇"
        },
        {
            co: "469928",
            na: "佛罗镇"
        },
        {
            co: "469929",
            na: "尖峰镇"
        },
        {
            co: "469930",
            na: "莺歌海镇"
        },
        {
            co: "469931",
            na: "乐中农场"
        },
        {
            co: "469932",
            na: "山荣农场"
        },
        {
            co: "469933",
            na: "乐光农场"
        },
        {
            co: "469934",
            na: "报伦农场"
        },
        {
            co: "469935",
            na: "福报农场"
        },
        {
            co: "469936",
            na: "保国农场"
        },
        {
            co: "469937",
            na: "保显农场"
        },
        {
            co: "469938",
            na: "尖峰岭林业"
        },
        {
            co: "469939",
            na: "莺歌海盐场"
        },
        {
            co: "469940",
            na: "城区"
        }]
    },
    {
        co: "469028",
        na: "陵水黎族自治县",
        ch: [{
            co: "469941",
            na: "椰林镇"
        },
        {
            co: "469942",
            na: "光坡镇"
        },
        {
            co: "469943",
            na: "三才镇"
        },
        {
            co: "469944",
            na: "英州镇"
        },
        {
            co: "469945",
            na: "隆广镇"
        },
        {
            co: "469946",
            na: "文罗镇"
        },
        {
            co: "469947",
            na: "本号镇"
        },
        {
            co: "469948",
            na: "新村镇"
        },
        {
            co: "469949",
            na: "黎安镇"
        },
        {
            co: "469950",
            na: "提蒙乡"
        },
        {
            co: "469951",
            na: "群英乡"
        },
        {
            co: "469952",
            na: "岭门农场"
        },
        {
            co: "469953",
            na: "南平农场"
        },
        {
            co: "469954",
            na: "城区"
        }]
    },
    {
        co: "469029",
        na: "保亭黎族苗族自治县",
        ch: [{
            co: "469961",
            na: "保城镇"
        },
        {
            co: "469962",
            na: "什玲镇"
        },
        {
            co: "469963",
            na: "加茂镇"
        },
        {
            co: "469964",
            na: "响水镇"
        },
        {
            co: "469965",
            na: "新政镇"
        },
        {
            co: "469966",
            na: "三道镇"
        },
        {
            co: "469967",
            na: "六弓乡"
        },
        {
            co: "469968",
            na: "南林乡"
        },
        {
            co: "469969",
            na: "毛感乡"
        },
        {
            co: "469970",
            na: "新星农场"
        },
        {
            co: "469971",
            na: "金江农场"
        },
        {
            co: "469972",
            na: "三道农场"
        }]
    },
    {
        co: "469030",
        na: "琼中黎族苗族自治县",
        ch: [{
            co: "469981",
            na: "营根镇"
        },
        {
            co: "469982",
            na: "湾岭镇"
        },
        {
            co: "469983",
            na: "黎母山镇"
        },
        {
            co: "469984",
            na: "和平镇"
        },
        {
            co: "469985",
            na: "长征镇"
        },
        {
            co: "469986",
            na: "红毛镇"
        },
        {
            co: "469987",
            na: "中平镇"
        },
        {
            co: "469988",
            na: "上安乡"
        },
        {
            co: "469989",
            na: "什运乡"
        },
        {
            co: "469990",
            na: "吊罗山乡"
        },
        {
            co: "469991",
            na: "阳江农场"
        },
        {
            co: "469992",
            na: "乌石农场"
        },
        {
            co: "469993",
            na: "加钗农场"
        },
        {
            co: "469994",
            na: "长征农场"
        },
        {
            co: "469995",
            na: "城区"
        }]
    }]
},
{
    co: "500000",
    na: "重庆",
    ch: [{
        co: "500100",
        na: "重庆市",
        ch: [{
            co: "500101",
            na: "万州区"
        },
        {
            co: "500102",
            na: "涪陵区"
        },
        {
            co: "500103",
            na: "渝中区"
        },
        {
            co: "500104",
            na: "大渡口区"
        },
        {
            co: "500105",
            na: "江北区"
        },
        {
            co: "500106",
            na: "沙坪坝区"
        },
        {
            co: "500107",
            na: "九龙坡区"
        },
        {
            co: "500108",
            na: "南岸区"
        },
        {
            co: "500109",
            na: "北碚区"
        },
        {
            co: "500110",
            na: "綦江区"
        },
        {
            co: "500111",
            na: "大足区"
        },
        {
            co: "500112",
            na: "渝北区"
        },
        {
            co: "500113",
            na: "巴南区"
        },
        {
            co: "500114",
            na: "黔江区"
        },
        {
            co: "500115",
            na: "长寿区"
        },
        {
            co: "500116",
            na: "江津区"
        },
        {
            co: "500117",
            na: "合川区"
        },
        {
            co: "500118",
            na: "永川区"
        },
        {
            co: "500119",
            na: "南川区"
        },
        {
            co: "500120",
            na: "璧山区"
        },
        {
            co: "500151",
            na: "铜梁区"
        },
        {
            co: "500152",
            na: "潼南区"
        },
        {
            co: "500153",
            na: "荣昌区"
        },
        {
            co: "500228",
            na: "梁平县"
        },
        {
            co: "500229",
            na: "城口县"
        },
        {
            co: "500230",
            na: "丰都县"
        },
        {
            co: "500231",
            na: "垫江县"
        },
        {
            co: "500232",
            na: "武隆县"
        },
        {
            co: "500233",
            na: "忠县"
        },
        {
            co: "500234",
            na: "开州区"
        },
        {
            co: "500235",
            na: "云阳县"
        },
        {
            co: "500236",
            na: "奉节县"
        },
        {
            co: "500237",
            na: "巫山县"
        },
        {
            co: "500238",
            na: "巫溪县"
        },
        {
            co: "500240",
            na: "石柱土家族自治县"
        },
        {
            co: "500241",
            na: "秀山土家族苗族自治县"
        },
        {
            co: "500242",
            na: "酉阳土家族苗族自治县"
        },
        {
            co: "500243",
            na: "彭水苗族土家族自治县"
        },
        {
            co: "500300",
            na: "两江新区"
        },
        {
            co: "500301",
            na: "高新区"
        },
        {
            co: "500302",
            na: "璧山高新区"
        }]
    }]
},
{
    co: "510000",
    na: "四川",
    ch: [{
        co: "510100",
        na: "成都市",
        ch: [{
            co: "510104",
            na: "锦江区"
        },
        {
            co: "510105",
            na: "青羊区"
        },
        {
            co: "510106",
            na: "金牛区"
        },
        {
            co: "510107",
            na: "武侯区"
        },
        {
            co: "510108",
            na: "成华区"
        },
        {
            co: "510112",
            na: "龙泉驿区"
        },
        {
            co: "510113",
            na: "青白江区"
        },
        {
            co: "510114",
            na: "新都区"
        },
        {
            co: "510115",
            na: "温江区"
        },
        {
            co: "510116",
            na: "双流区"
        },
        {
            co: "510121",
            na: "金堂县"
        },
        {
            co: "510124",
            na: "郫县"
        },
        {
            co: "510129",
            na: "大邑县"
        },
        {
            co: "510131",
            na: "蒲江县"
        },
        {
            co: "510132",
            na: "新津县"
        },
        {
            co: "510180",
            na: "简阳市"
        },
        {
            co: "510181",
            na: "都江堰市"
        },
        {
            co: "510182",
            na: "彭州市"
        },
        {
            co: "510183",
            na: "邛崃市"
        },
        {
            co: "510184",
            na: "崇州市"
        },
        {
            co: "510186",
            na: "天府新区"
        },
        {
            co: "510187",
            na: "高新南区"
        },
        {
            co: "510188",
            na: "高新西区"
        }]
    },
    {
        co: "510300",
        na: "自贡市",
        ch: [{
            co: "510302",
            na: "自流井区"
        },
        {
            co: "510303",
            na: "贡井区"
        },
        {
            co: "510304",
            na: "大安区"
        },
        {
            co: "510311",
            na: "沿滩区"
        },
        {
            co: "510321",
            na: "荣县"
        },
        {
            co: "510322",
            na: "富顺县"
        }]
    },
    {
        co: "510400",
        na: "攀枝花市",
        ch: [{
            co: "510402",
            na: "东区"
        },
        {
            co: "510403",
            na: "西区"
        },
        {
            co: "510411",
            na: "仁和区"
        },
        {
            co: "510421",
            na: "米易县"
        },
        {
            co: "510422",
            na: "盐边县"
        }]
    },
    {
        co: "510500",
        na: "泸州市",
        ch: [{
            co: "510502",
            na: "江阳区"
        },
        {
            co: "510503",
            na: "纳溪区"
        },
        {
            co: "510504",
            na: "龙马潭区"
        },
        {
            co: "510521",
            na: "泸县"
        },
        {
            co: "510522",
            na: "合江县"
        },
        {
            co: "510524",
            na: "叙永县"
        },
        {
            co: "510525",
            na: "古蔺县"
        }]
    },
    {
        co: "510600",
        na: "德阳市",
        ch: [{
            co: "510603",
            na: "旌阳区"
        },
        {
            co: "510623",
            na: "中江县"
        },
        {
            co: "510626",
            na: "罗江县"
        },
        {
            co: "510681",
            na: "广汉市"
        },
        {
            co: "510682",
            na: "什邡市"
        },
        {
            co: "510683",
            na: "绵竹市"
        }]
    },
    {
        co: "510700",
        na: "绵阳市",
        ch: [{
            co: "510703",
            na: "涪城区"
        },
        {
            co: "510704",
            na: "游仙区"
        },
        {
            co: "510722",
            na: "三台县"
        },
        {
            co: "510723",
            na: "盐亭县"
        },
        {
            co: "510724",
            na: "安州区"
        },
        {
            co: "510725",
            na: "梓潼县"
        },
        {
            co: "510726",
            na: "北川羌族自治县"
        },
        {
            co: "510727",
            na: "平武县"
        },
        {
            co: "510781",
            na: "江油市"
        },
        {
            co: "510782",
            na: "高新区"
        },
        {
            co: "510783",
            na: "经开区"
        }]
    },
    {
        co: "510800",
        na: "广元市",
        ch: [{
            co: "510802",
            na: "利州区"
        },
        {
            co: "510811",
            na: "昭化区"
        },
        {
            co: "510812",
            na: "朝天区"
        },
        {
            co: "510821",
            na: "旺苍县"
        },
        {
            co: "510822",
            na: "青川县"
        },
        {
            co: "510823",
            na: "剑阁县"
        },
        {
            co: "510824",
            na: "苍溪县"
        }]
    },
    {
        co: "510900",
        na: "遂宁市",
        ch: [{
            co: "510903",
            na: "船山区"
        },
        {
            co: "510904",
            na: "安居区"
        },
        {
            co: "510921",
            na: "蓬溪县"
        },
        {
            co: "510922",
            na: "射洪县"
        },
        {
            co: "510923",
            na: "大英县"
        }]
    },
    {
        co: "511000",
        na: "内江市",
        ch: [{
            co: "511002",
            na: "市中区"
        },
        {
            co: "511011",
            na: "东兴区"
        },
        {
            co: "511024",
            na: "威远县"
        },
        {
            co: "511025",
            na: "资中县"
        },
        {
            co: "511028",
            na: "隆昌县"
        }]
    },
    {
        co: "511100",
        na: "乐山市",
        ch: [{
            co: "511102",
            na: "市中区"
        },
        {
            co: "511111",
            na: "沙湾区"
        },
        {
            co: "511112",
            na: "五通桥区"
        },
        {
            co: "511113",
            na: "金口河区"
        },
        {
            co: "511123",
            na: "犍为县"
        },
        {
            co: "511124",
            na: "井研县"
        },
        {
            co: "511126",
            na: "夹江县"
        },
        {
            co: "511129",
            na: "沐川县"
        },
        {
            co: "511132",
            na: "峨边彝族自治县"
        },
        {
            co: "511133",
            na: "马边彝族自治县"
        },
        {
            co: "511181",
            na: "峨眉山市"
        }]
    },
    {
        co: "511300",
        na: "南充市",
        ch: [{
            co: "511302",
            na: "顺庆区"
        },
        {
            co: "511303",
            na: "高坪区"
        },
        {
            co: "511304",
            na: "嘉陵区"
        },
        {
            co: "511321",
            na: "南部县"
        },
        {
            co: "511322",
            na: "营山县"
        },
        {
            co: "511323",
            na: "蓬安县"
        },
        {
            co: "511324",
            na: "仪陇县"
        },
        {
            co: "511325",
            na: "西充县"
        },
        {
            co: "511381",
            na: "阆中市"
        }]
    },
    {
        co: "511400",
        na: "眉山市",
        ch: [{
            co: "511402",
            na: "东坡区"
        },
        {
            co: "511403",
            na: "彭山区"
        },
        {
            co: "511421",
            na: "仁寿县"
        },
        {
            co: "511423",
            na: "洪雅县"
        },
        {
            co: "511424",
            na: "丹棱县"
        },
        {
            co: "511425",
            na: "青神县"
        }]
    },
    {
        co: "511500",
        na: "宜宾市",
        ch: [{
            co: "511502",
            na: "翠屏区"
        },
        {
            co: "511503",
            na: "南溪区"
        },
        {
            co: "511521",
            na: "宜宾县"
        },
        {
            co: "511523",
            na: "江安县"
        },
        {
            co: "511524",
            na: "长宁县"
        },
        {
            co: "511525",
            na: "高县"
        },
        {
            co: "511526",
            na: "珙县"
        },
        {
            co: "511527",
            na: "筠连县"
        },
        {
            co: "511528",
            na: "兴文县"
        },
        {
            co: "511529",
            na: "屏山县"
        }]
    },
    {
        co: "511600",
        na: "广安市",
        ch: [{
            co: "511602",
            na: "广安区"
        },
        {
            co: "511603",
            na: "前锋区"
        },
        {
            co: "511621",
            na: "岳池县"
        },
        {
            co: "511622",
            na: "武胜县"
        },
        {
            co: "511623",
            na: "邻水县"
        },
        {
            co: "511681",
            na: "华蓥市"
        }]
    },
    {
        co: "511700",
        na: "达州市",
        ch: [{
            co: "511702",
            na: "通川区"
        },
        {
            co: "511703",
            na: "达川区"
        },
        {
            co: "511722",
            na: "宣汉县"
        },
        {
            co: "511723",
            na: "开江县"
        },
        {
            co: "511724",
            na: "大竹县"
        },
        {
            co: "511725",
            na: "渠县"
        },
        {
            co: "511781",
            na: "万源市"
        }]
    },
    {
        co: "511800",
        na: "雅安市",
        ch: [{
            co: "511802",
            na: "雨城区"
        },
        {
            co: "511803",
            na: "名山区"
        },
        {
            co: "511822",
            na: "荥经县"
        },
        {
            co: "511823",
            na: "汉源县"
        },
        {
            co: "511824",
            na: "石棉县"
        },
        {
            co: "511825",
            na: "天全县"
        },
        {
            co: "511826",
            na: "芦山县"
        },
        {
            co: "511827",
            na: "宝兴县"
        }]
    },
    {
        co: "511900",
        na: "巴中市",
        ch: [{
            co: "511902",
            na: "巴州区"
        },
        {
            co: "511903",
            na: "恩阳区"
        },
        {
            co: "511921",
            na: "通江县"
        },
        {
            co: "511922",
            na: "南江县"
        },
        {
            co: "511923",
            na: "平昌县"
        }]
    },
    {
        co: "512000",
        na: "资阳市",
        ch: [{
            co: "512002",
            na: "雁江区"
        },
        {
            co: "512021",
            na: "安岳县"
        },
        {
            co: "512022",
            na: "乐至县"
        }]
    },
    {
        co: "513200",
        na: "阿坝藏族羌族自治州",
        ch: [{
            co: "513201",
            na: "马尔康市"
        },
        {
            co: "513221",
            na: "汶川县"
        },
        {
            co: "513222",
            na: "理县"
        },
        {
            co: "513223",
            na: "茂县"
        },
        {
            co: "513224",
            na: "松潘县"
        },
        {
            co: "513225",
            na: "九寨沟县"
        },
        {
            co: "513226",
            na: "金川县"
        },
        {
            co: "513227",
            na: "小金县"
        },
        {
            co: "513228",
            na: "黑水县"
        },
        {
            co: "513230",
            na: "壤塘县"
        },
        {
            co: "513231",
            na: "阿坝县"
        },
        {
            co: "513232",
            na: "若尔盖县"
        },
        {
            co: "513233",
            na: "红原县"
        }]
    },
    {
        co: "513300",
        na: "甘孜藏族自治州",
        ch: [{
            co: "513301",
            na: "康定市"
        },
        {
            co: "513322",
            na: "泸定县"
        },
        {
            co: "513323",
            na: "丹巴县"
        },
        {
            co: "513324",
            na: "九龙县"
        },
        {
            co: "513325",
            na: "雅江县"
        },
        {
            co: "513326",
            na: "道孚县"
        },
        {
            co: "513327",
            na: "炉霍县"
        },
        {
            co: "513328",
            na: "甘孜县"
        },
        {
            co: "513329",
            na: "新龙县"
        },
        {
            co: "513330",
            na: "德格县"
        },
        {
            co: "513331",
            na: "白玉县"
        },
        {
            co: "513332",
            na: "石渠县"
        },
        {
            co: "513333",
            na: "色达县"
        },
        {
            co: "513334",
            na: "理塘县"
        },
        {
            co: "513335",
            na: "巴塘县"
        },
        {
            co: "513336",
            na: "乡城县"
        },
        {
            co: "513337",
            na: "稻城县"
        },
        {
            co: "513338",
            na: "得荣县"
        }]
    },
    {
        co: "513400",
        na: "凉山彝族自治州",
        ch: [{
            co: "513401",
            na: "西昌市"
        },
        {
            co: "513422",
            na: "木里藏族自治县"
        },
        {
            co: "513423",
            na: "盐源县"
        },
        {
            co: "513424",
            na: "德昌县"
        },
        {
            co: "513425",
            na: "会理县"
        },
        {
            co: "513426",
            na: "会东县"
        },
        {
            co: "513427",
            na: "宁南县"
        },
        {
            co: "513428",
            na: "普格县"
        },
        {
            co: "513429",
            na: "布拖县"
        },
        {
            co: "513430",
            na: "金阳县"
        },
        {
            co: "513431",
            na: "昭觉县"
        },
        {
            co: "513432",
            na: "喜德县"
        },
        {
            co: "513433",
            na: "冕宁县"
        },
        {
            co: "513434",
            na: "越西县"
        },
        {
            co: "513435",
            na: "甘洛县"
        },
        {
            co: "513436",
            na: "美姑县"
        },
        {
            co: "513437",
            na: "雷波县"
        }]
    }]
},
{
    co: "520000",
    na: "贵州",
    ch: [{
        co: "520100",
        na: "贵阳市",
        ch: [{
            co: "520102",
            na: "南明区"
        },
        {
            co: "520103",
            na: "云岩区"
        },
        {
            co: "520111",
            na: "花溪区"
        },
        {
            co: "520112",
            na: "乌当区"
        },
        {
            co: "520113",
            na: "白云区"
        },
        {
            co: "520115",
            na: "观山湖区"
        },
        {
            co: "520121",
            na: "开阳县"
        },
        {
            co: "520122",
            na: "息烽县"
        },
        {
            co: "520123",
            na: "修文县"
        },
        {
            co: "520181",
            na: "清镇市"
        },
        {
            co: "520182",
            na: "贵安新区"
        },
        {
            co: "520183",
            na: "高新区"
        }]
    },
    {
        co: "520200",
        na: "六盘水市",
        ch: [{
            co: "520201",
            na: "钟山区"
        },
        {
            co: "520203",
            na: "六枝特区"
        },
        {
            co: "520221",
            na: "水城县"
        },
        {
            co: "520222",
            na: "盘县"
        }]
    },
    {
        co: "520300",
        na: "遵义市",
        ch: [{
            co: "520302",
            na: "红花岗区"
        },
        {
            co: "520303",
            na: "汇川区"
        },
        {
            co: "520304",
            na: "播州区"
        },
        {
            co: "520322",
            na: "桐梓县"
        },
        {
            co: "520323",
            na: "绥阳县"
        },
        {
            co: "520324",
            na: "正安县"
        },
        {
            co: "520325",
            na: "道真仡佬族苗族自治县"
        },
        {
            co: "520326",
            na: "务川仡佬族苗族自治县"
        },
        {
            co: "520327",
            na: "凤冈县"
        },
        {
            co: "520328",
            na: "湄潭县"
        },
        {
            co: "520329",
            na: "余庆县"
        },
        {
            co: "520330",
            na: "习水县"
        },
        {
            co: "520381",
            na: "赤水市"
        },
        {
            co: "520382",
            na: "仁怀市"
        }]
    },
    {
        co: "520400",
        na: "安顺市",
        ch: [{
            co: "520402",
            na: "西秀区"
        },
        {
            co: "520403",
            na: "平坝区"
        },
        {
            co: "520422",
            na: "普定县"
        },
        {
            co: "520423",
            na: "镇宁布依族苗族自治县"
        },
        {
            co: "520424",
            na: "关岭布依族苗族自治县"
        },
        {
            co: "520425",
            na: "紫云苗族布依族自治县"
        }]
    },
    {
        co: "520500",
        na: "毕节市",
        ch: [{
            co: "520502",
            na: "七星关区"
        },
        {
            co: "520521",
            na: "大方县"
        },
        {
            co: "520522",
            na: "黔西县"
        },
        {
            co: "520523",
            na: "金沙县"
        },
        {
            co: "520524",
            na: "织金县"
        },
        {
            co: "520525",
            na: "纳雍县"
        },
        {
            co: "520526",
            na: "威宁彝族回族苗族自治县"
        },
        {
            co: "520527",
            na: "赫章县"
        }]
    },
    {
        co: "520600",
        na: "铜仁市",
        ch: [{
            co: "520602",
            na: "碧江区"
        },
        {
            co: "520603",
            na: "万山区"
        },
        {
            co: "520621",
            na: "江口县"
        },
        {
            co: "520622",
            na: "玉屏侗族自治县"
        },
        {
            co: "520623",
            na: "石阡县"
        },
        {
            co: "520624",
            na: "思南县"
        },
        {
            co: "520625",
            na: "印江土家族苗族自治县"
        },
        {
            co: "520626",
            na: "德江县"
        },
        {
            co: "520627",
            na: "沿河土家族自治县"
        },
        {
            co: "520628",
            na: "松桃苗族自治县"
        }]
    },
    {
        co: "522300",
        na: "黔西南布依族苗族自治州",
        ch: [{
            co: "522301",
            na: "兴义市 "
        },
        {
            co: "522322",
            na: "兴仁县"
        },
        {
            co: "522323",
            na: "普安县"
        },
        {
            co: "522324",
            na: "晴隆县"
        },
        {
            co: "522325",
            na: "贞丰县"
        },
        {
            co: "522326",
            na: "望谟县"
        },
        {
            co: "522327",
            na: "册亨县"
        },
        {
            co: "522328",
            na: "安龙县"
        }]
    },
    {
        co: "522600",
        na: "黔东南苗族侗族自治州",
        ch: [{
            co: "522601",
            na: "凯里市"
        },
        {
            co: "522622",
            na: "黄平县"
        },
        {
            co: "522623",
            na: "施秉县"
        },
        {
            co: "522624",
            na: "三穗县"
        },
        {
            co: "522625",
            na: "镇远县"
        },
        {
            co: "522626",
            na: "岑巩县"
        },
        {
            co: "522627",
            na: "天柱县"
        },
        {
            co: "522628",
            na: "锦屏县"
        },
        {
            co: "522629",
            na: "剑河县"
        },
        {
            co: "522630",
            na: "台江县"
        },
        {
            co: "522631",
            na: "黎平县"
        },
        {
            co: "522632",
            na: "榕江县"
        },
        {
            co: "522633",
            na: "从江县"
        },
        {
            co: "522634",
            na: "雷山县"
        },
        {
            co: "522635",
            na: "麻江县"
        },
        {
            co: "522636",
            na: "丹寨县"
        }]
    },
    {
        co: "522700",
        na: "黔南布依族苗族自治州",
        ch: [{
            co: "522701",
            na: "都匀市"
        },
        {
            co: "522702",
            na: "福泉市"
        },
        {
            co: "522722",
            na: "荔波县"
        },
        {
            co: "522723",
            na: "贵定县"
        },
        {
            co: "522725",
            na: "瓮安县"
        },
        {
            co: "522726",
            na: "独山县"
        },
        {
            co: "522727",
            na: "平塘县"
        },
        {
            co: "522728",
            na: "罗甸县"
        },
        {
            co: "522729",
            na: "长顺县"
        },
        {
            co: "522730",
            na: "龙里县"
        },
        {
            co: "522731",
            na: "惠水县"
        },
        {
            co: "522732",
            na: "三都水族自治县"
        }]
    }]
},
{
    co: "530000",
    na: "云南",
    ch: [{
        co: "530100",
        na: "昆明市",
        ch: [{
            co: "530102",
            na: "五华区"
        },
        {
            co: "530103",
            na: "盘龙区"
        },
        {
            co: "530111",
            na: "官渡区"
        },
        {
            co: "530112",
            na: "西山区"
        },
        {
            co: "530113",
            na: "东川区"
        },
        {
            co: "530114",
            na: "呈贡区"
        },
        {
            co: "530122",
            na: "晋宁县"
        },
        {
            co: "530124",
            na: "富民县"
        },
        {
            co: "530125",
            na: "宜良县"
        },
        {
            co: "530126",
            na: "石林彝族自治县"
        },
        {
            co: "530127",
            na: "嵩明县"
        },
        {
            co: "530128",
            na: "禄劝彝族苗族自治县"
        },
        {
            co: "530129",
            na: "寻甸回族彝族自治县 "
        },
        {
            co: "530181",
            na: "安宁市"
        },
        {
            co: "530182",
            na: "滇中新区"
        },
        {
            co: "530183",
            na: "高新区"
        }]
    },
    {
        co: "530300",
        na: "曲靖市",
        ch: [{
            co: "530302",
            na: "麒麟区"
        },
        {
            co: "530303",
            na: "沾益区"
        },
        {
            co: "530321",
            na: "马龙县"
        },
        {
            co: "530322",
            na: "陆良县"
        },
        {
            co: "530323",
            na: "师宗县"
        },
        {
            co: "530324",
            na: "罗平县"
        },
        {
            co: "530325",
            na: "富源县"
        },
        {
            co: "530326",
            na: "会泽县"
        },
        {
            co: "530381",
            na: "宣威市"
        }]
    },
    {
        co: "530400",
        na: "玉溪市",
        ch: [{
            co: "530402",
            na: "红塔区"
        },
        {
            co: "530403",
            na: "江川区"
        },
        {
            co: "530422",
            na: "澄江县"
        },
        {
            co: "530423",
            na: "通海县"
        },
        {
            co: "530424",
            na: "华宁县"
        },
        {
            co: "530425",
            na: "易门县"
        },
        {
            co: "530426",
            na: "峨山彝族自治县"
        },
        {
            co: "530427",
            na: "新平彝族傣族自治县"
        },
        {
            co: "530428",
            na: "元江哈尼族彝族傣族自治县"
        }]
    },
    {
        co: "530500",
        na: "保山市",
        ch: [{
            co: "530502",
            na: "隆阳区"
        },
        {
            co: "530521",
            na: "施甸县"
        },
        {
            co: "530523",
            na: "龙陵县"
        },
        {
            co: "530524",
            na: "昌宁县"
        },
        {
            co: "530581",
            na: "腾冲市"
        }]
    },
    {
        co: "530600",
        na: "昭通市",
        ch: [{
            co: "530602",
            na: "昭阳区"
        },
        {
            co: "530621",
            na: "鲁甸县"
        },
        {
            co: "530622",
            na: "巧家县"
        },
        {
            co: "530623",
            na: "盐津县"
        },
        {
            co: "530624",
            na: "大关县"
        },
        {
            co: "530625",
            na: "永善县"
        },
        {
            co: "530626",
            na: "绥江县"
        },
        {
            co: "530627",
            na: "镇雄县"
        },
        {
            co: "530628",
            na: "彝良县"
        },
        {
            co: "530629",
            na: "威信县"
        },
        {
            co: "530630",
            na: "水富县"
        }]
    },
    {
        co: "530700",
        na: "丽江市",
        ch: [{
            co: "530702",
            na: "古城区"
        },
        {
            co: "530721",
            na: "玉龙纳西族自治县"
        },
        {
            co: "530722",
            na: "永胜县"
        },
        {
            co: "530723",
            na: "华坪县"
        },
        {
            co: "530724",
            na: "宁蒗彝族自治县"
        }]
    },
    {
        co: "530800",
        na: "普洱市",
        ch: [{
            co: "530802",
            na: "思茅区"
        },
        {
            co: "530821",
            na: "宁洱哈尼族彝族自治县"
        },
        {
            co: "530822",
            na: "墨江哈尼族自治县"
        },
        {
            co: "530823",
            na: "景东彝族自治县"
        },
        {
            co: "530824",
            na: "景谷傣族彝族自治县"
        },
        {
            co: "530825",
            na: "镇沅彝族哈尼族拉祜族自治县"
        },
        {
            co: "530826",
            na: "江城哈尼族彝族自治县"
        },
        {
            co: "530827",
            na: "孟连傣族拉祜族佤族自治县"
        },
        {
            co: "530828",
            na: "澜沧拉祜族自治县"
        },
        {
            co: "530829",
            na: "西盟佤族自治县"
        }]
    },
    {
        co: "530900",
        na: "临沧市",
        ch: [{
            co: "530902",
            na: "临翔区"
        },
        {
            co: "530921",
            na: "凤庆县"
        },
        {
            co: "530922",
            na: "云县"
        },
        {
            co: "530923",
            na: "永德县"
        },
        {
            co: "530924",
            na: "镇康县"
        },
        {
            co: "530925",
            na: "双江拉祜族佤族布朗族傣族自治县"
        },
        {
            co: "530926",
            na: "耿马傣族佤族自治县"
        },
        {
            co: "530927",
            na: "沧源佤族自治县"
        }]
    },
    {
        co: "532300",
        na: "楚雄彝族自治州",
        ch: [{
            co: "532301",
            na: "楚雄市"
        },
        {
            co: "532322",
            na: "双柏县"
        },
        {
            co: "532323",
            na: "牟定县"
        },
        {
            co: "532324",
            na: "南华县"
        },
        {
            co: "532325",
            na: "姚安县"
        },
        {
            co: "532326",
            na: "大姚县"
        },
        {
            co: "532327",
            na: "永仁县"
        },
        {
            co: "532328",
            na: "元谋县"
        },
        {
            co: "532329",
            na: "武定县"
        },
        {
            co: "532331",
            na: "禄丰县"
        }]
    },
    {
        co: "532500",
        na: "红河哈尼族彝族自治州",
        ch: [{
            co: "532501",
            na: "个旧市"
        },
        {
            co: "532502",
            na: "开远市"
        },
        {
            co: "532503",
            na: "蒙自市"
        },
        {
            co: "532504",
            na: "弥勒市"
        },
        {
            co: "532523",
            na: "屏边苗族自治县"
        },
        {
            co: "532524",
            na: "建水县"
        },
        {
            co: "532525",
            na: "石屏县"
        },
        {
            co: "532527",
            na: "泸西县"
        },
        {
            co: "532528",
            na: "元阳县"
        },
        {
            co: "532529",
            na: "红河县"
        },
        {
            co: "532530",
            na: "金平苗族瑶族傣族自治县"
        },
        {
            co: "532531",
            na: "绿春县"
        },
        {
            co: "532532",
            na: "河口瑶族自治县"
        }]
    },
    {
        co: "532600",
        na: "文山壮族苗族自治州",
        ch: [{
            co: "532601",
            na: "文山市"
        },
        {
            co: "532622",
            na: "砚山县"
        },
        {
            co: "532623",
            na: "西畴县"
        },
        {
            co: "532624",
            na: "麻栗坡县"
        },
        {
            co: "532625",
            na: "马关县"
        },
        {
            co: "532626",
            na: "丘北县"
        },
        {
            co: "532627",
            na: "广南县"
        },
        {
            co: "532628",
            na: "富宁县"
        }]
    },
    {
        co: "532800",
        na: "西双版纳傣族自治州",
        ch: [{
            co: "532801",
            na: "景洪市"
        },
        {
            co: "532822",
            na: "勐海县"
        },
        {
            co: "532823",
            na: "勐腊县"
        }]
    },
    {
        co: "532900",
        na: "大理白族自治州",
        ch: [{
            co: "532901",
            na: "大理市"
        },
        {
            co: "532922",
            na: "漾濞彝族自治县"
        },
        {
            co: "532923",
            na: "祥云县"
        },
        {
            co: "532924",
            na: "宾川县"
        },
        {
            co: "532925",
            na: "弥渡县"
        },
        {
            co: "532926",
            na: "南涧彝族自治县"
        },
        {
            co: "532927",
            na: "巍山彝族回族自治县"
        },
        {
            co: "532928",
            na: "永平县"
        },
        {
            co: "532929",
            na: "云龙县"
        },
        {
            co: "532930",
            na: "洱源县"
        },
        {
            co: "532931",
            na: "剑川县"
        },
        {
            co: "532932",
            na: "鹤庆县"
        }]
    },
    {
        co: "533100",
        na: "德宏傣族景颇族自治州",
        ch: [{
            co: "533102",
            na: "瑞丽市"
        },
        {
            co: "533103",
            na: "芒市"
        },
        {
            co: "533122",
            na: "梁河县"
        },
        {
            co: "533123",
            na: "盈江县"
        },
        {
            co: "533124",
            na: "陇川县"
        }]
    },
    {
        co: "533300",
        na: "怒江傈僳族自治州",
        ch: [{
            co: "533321",
            na: "泸水市"
        },
        {
            co: "533323",
            na: "福贡县"
        },
        {
            co: "533324",
            na: "贡山独龙族怒族自治县"
        },
        {
            co: "533325",
            na: "兰坪白族普米族自治县"
        }]
    },
    {
        co: "533400",
        na: "迪庆藏族自治州",
        ch: [{
            co: "533401",
            na: "香格里拉市"
        },
        {
            co: "533422",
            na: "德钦县"
        },
        {
            co: "533423",
            na: "维西傈僳族自治县"
        }]
    }]
},
{
    co: "540000",
    na: "西藏",
    ch: [{
        co: "540100",
        na: "拉萨市",
        ch: [{
            co: "540102",
            na: "城关区"
        },
        {
            co: "540103",
            na: "堆龙德庆区"
        },
        {
            co: "540121",
            na: "林周县"
        },
        {
            co: "540122",
            na: "当雄县"
        },
        {
            co: "540123",
            na: "尼木县"
        },
        {
            co: "540124",
            na: "曲水县"
        },
        {
            co: "540126",
            na: "达孜县"
        },
        {
            co: "540127",
            na: "墨竹工卡县"
        }]
    },
    {
        co: "540200",
        na: "日喀则市",
        ch: [{
            co: "540202",
            na: "桑珠孜区"
        },
        {
            co: "540221",
            na: "南木林县"
        },
        {
            co: "540222",
            na: "江孜县"
        },
        {
            co: "540223",
            na: "定日县"
        },
        {
            co: "540224",
            na: "萨迦县"
        },
        {
            co: "540225",
            na: "拉孜县"
        },
        {
            co: "540226",
            na: "昂仁县"
        },
        {
            co: "540227",
            na: "谢通门县"
        },
        {
            co: "540228",
            na: "白朗县"
        },
        {
            co: "540229",
            na: "仁布县"
        },
        {
            co: "540230",
            na: "康马县"
        },
        {
            co: "540231",
            na: "定结县"
        },
        {
            co: "540232",
            na: "仲巴县"
        },
        {
            co: "540233",
            na: "亚东县"
        },
        {
            co: "540234",
            na: "吉隆县"
        },
        {
            co: "540235",
            na: "聂拉木县"
        },
        {
            co: "540236",
            na: "萨嘎县"
        },
        {
            co: "540237",
            na: "岗巴县"
        }]
    },
    {
        co: "540300",
        na: "昌都市",
        ch: [{
            co: "540302",
            na: "卡若区"
        },
        {
            co: "540321",
            na: "江达县"
        },
        {
            co: "540322",
            na: "贡觉县"
        },
        {
            co: "540323",
            na: "类乌齐县"
        },
        {
            co: "540324",
            na: "丁青县"
        },
        {
            co: "540325",
            na: "察雅县"
        },
        {
            co: "540326",
            na: "八宿县"
        },
        {
            co: "540327",
            na: "左贡县"
        },
        {
            co: "540328",
            na: "芒康县"
        },
        {
            co: "540329",
            na: "洛隆县"
        },
        {
            co: "540330",
            na: "边坝县"
        }]
    },
    {
        co: "540400",
        na: "林芝市",
        ch: [{
            co: "540402",
            na: "巴宜区"
        },
        {
            co: "540421",
            na: "工布江达县"
        },
        {
            co: "540422",
            na: "米林县"
        },
        {
            co: "540423",
            na: "墨脱县"
        },
        {
            co: "540424",
            na: "波密县"
        },
        {
            co: "540425",
            na: "察隅县"
        },
        {
            co: "540426",
            na: "朗县"
        }]
    },
    {
        co: "540500",
        na: "山南市",
        ch: [{
            co: "540502",
            na: "乃东区"
        },
        {
            co: "540521",
            na: "扎囊县"
        },
        {
            co: "540522",
            na: "贡嘎县"
        },
        {
            co: "540523",
            na: "桑日县"
        },
        {
            co: "540524",
            na: "琼结县"
        },
        {
            co: "540525",
            na: "曲松县"
        },
        {
            co: "540526",
            na: "措美县"
        },
        {
            co: "540527",
            na: "洛扎县"
        },
        {
            co: "540528",
            na: "加查县"
        },
        {
            co: "540529",
            na: "隆子县"
        },
        {
            co: "540530",
            na: "错那县"
        },
        {
            co: "540531",
            na: "浪卡子县"
        }]
    },
    {
        co: "542400",
        na: "那曲地区",
        ch: [{
            co: "542421",
            na: "那曲县"
        },
        {
            co: "542422",
            na: "嘉黎县"
        },
        {
            co: "542423",
            na: "比如县"
        },
        {
            co: "542424",
            na: "聂荣县"
        },
        {
            co: "542425",
            na: "安多县"
        },
        {
            co: "542426",
            na: "申扎县"
        },
        {
            co: "542427",
            na: "索县"
        },
        {
            co: "542428",
            na: "班戈县"
        },
        {
            co: "542429",
            na: "巴青县"
        },
        {
            co: "542430",
            na: "尼玛县"
        },
        {
            co: "542431",
            na: "双湖县"
        }]
    },
    {
        co: "542500",
        na: "阿里地区",
        ch: [{
            co: "542521",
            na: "普兰县"
        },
        {
            co: "542522",
            na: "札达县"
        },
        {
            co: "542523",
            na: "噶尔县"
        },
        {
            co: "542524",
            na: "日土县"
        },
        {
            co: "542525",
            na: "革吉县"
        },
        {
            co: "542526",
            na: "改则县"
        },
        {
            co: "542527",
            na: "措勤县"
        }]
    }]
},
{
    co: "610000",
    na: "陕西",
    ch: [{
        co: "610100",
        na: "西安市",
        ch: [{
            co: "610102",
            na: "新城区"
        },
        {
            co: "610103",
            na: "碑林区"
        },
        {
            co: "610104",
            na: "莲湖区"
        },
        {
            co: "610111",
            na: "灞桥区"
        },
        {
            co: "610112",
            na: "未央区"
        },
        {
            co: "610113",
            na: "雁塔区"
        },
        {
            co: "610114",
            na: "阎良区"
        },
        {
            co: "610115",
            na: "临潼区"
        },
        {
            co: "610116",
            na: "长安区"
        },
        {
            co: "610117",
            na: "高陵区"
        },
        {
            co: "610122",
            na: "蓝田县"
        },
        {
            co: "610124",
            na: "周至县"
        },
        {
            co: "610125",
            na: "户县"
        },
        {
            co: "610127",
            na: "曲江新区"
        },
        {
            co: "610128",
            na: "高新区"
        }]
    },
    {
        co: "610200",
        na: "铜川市",
        ch: [{
            co: "610202",
            na: "王益区"
        },
        {
            co: "610203",
            na: "印台区"
        },
        {
            co: "610204",
            na: "耀州区"
        },
        {
            co: "610222",
            na: "宜君县"
        }]
    },
    {
        co: "610300",
        na: "宝鸡市",
        ch: [{
            co: "610302",
            na: "渭滨区"
        },
        {
            co: "610303",
            na: "金台区"
        },
        {
            co: "610304",
            na: "陈仓区"
        },
        {
            co: "610322",
            na: "凤翔县"
        },
        {
            co: "610323",
            na: "岐山县"
        },
        {
            co: "610324",
            na: "扶风县"
        },
        {
            co: "610326",
            na: "眉县"
        },
        {
            co: "610327",
            na: "陇县"
        },
        {
            co: "610328",
            na: "千阳县"
        },
        {
            co: "610329",
            na: "麟游县"
        },
        {
            co: "610330",
            na: "凤县"
        },
        {
            co: "610331",
            na: "太白县"
        },
        {
            co: "610332",
            na: "高新区"
        }]
    },
    {
        co: "610400",
        na: "咸阳市",
        ch: [{
            co: "610402",
            na: "秦都区"
        },
        {
            co: "610403",
            na: "杨陵区"
        },
        {
            co: "610404",
            na: "渭城区"
        },
        {
            co: "610422",
            na: "三原县"
        },
        {
            co: "610423",
            na: "泾阳县"
        },
        {
            co: "610424",
            na: "乾县"
        },
        {
            co: "610425",
            na: "礼泉县"
        },
        {
            co: "610426",
            na: "永寿县"
        },
        {
            co: "610427",
            na: "彬县"
        },
        {
            co: "610428",
            na: "长武县"
        },
        {
            co: "610429",
            na: "旬邑县"
        },
        {
            co: "610430",
            na: "淳化县"
        },
        {
            co: "610431",
            na: "武功县"
        },
        {
            co: "610481",
            na: "兴平市"
        },
        {
            co: "610482",
            na: "高新区"
        }]
    },
    {
        co: "610500",
        na: "渭南市",
        ch: [{
            co: "610502",
            na: "临渭区"
        },
        {
            co: "610503",
            na: "华州区"
        },
        {
            co: "610522",
            na: "潼关县"
        },
        {
            co: "610523",
            na: "大荔县"
        },
        {
            co: "610524",
            na: "合阳县"
        },
        {
            co: "610525",
            na: "澄城县"
        },
        {
            co: "610526",
            na: "蒲城县"
        },
        {
            co: "610527",
            na: "白水县"
        },
        {
            co: "610528",
            na: "富平县"
        },
        {
            co: "610581",
            na: "韩城市"
        },
        {
            co: "610582",
            na: "华阴市"
        }]
    },
    {
        co: "610600",
        na: "延安市",
        ch: [{
            co: "610602",
            na: "宝塔区"
        },
        {
            co: "610621",
            na: "延长县"
        },
        {
            co: "610622",
            na: "延川县"
        },
        {
            co: "610623",
            na: "子长县"
        },
        {
            co: "610624",
            na: "安塞区"
        },
        {
            co: "610625",
            na: "志丹县"
        },
        {
            co: "610626",
            na: "吴起县"
        },
        {
            co: "610627",
            na: "甘泉县"
        },
        {
            co: "610628",
            na: "富县"
        },
        {
            co: "610629",
            na: "洛川县"
        },
        {
            co: "610630",
            na: "宜川县"
        },
        {
            co: "610631",
            na: "黄龙县"
        },
        {
            co: "610632",
            na: "黄陵县"
        }]
    },
    {
        co: "610700",
        na: "汉中市",
        ch: [{
            co: "610702",
            na: "汉台区"
        },
        {
            co: "610721",
            na: "南郑县"
        },
        {
            co: "610722",
            na: "城固县"
        },
        {
            co: "610723",
            na: "洋县"
        },
        {
            co: "610724",
            na: "西乡县"
        },
        {
            co: "610725",
            na: "勉县"
        },
        {
            co: "610726",
            na: "宁强县"
        },
        {
            co: "610727",
            na: "略阳县"
        },
        {
            co: "610728",
            na: "镇巴县"
        },
        {
            co: "610729",
            na: "留坝县"
        },
        {
            co: "610730",
            na: "佛坪县"
        }]
    },
    {
        co: "610800",
        na: "榆林市",
        ch: [{
            co: "610802",
            na: "榆阳区"
        },
        {
            co: "610803",
            na: "横山区"
        },
        {
            co: "610821",
            na: "神木县"
        },
        {
            co: "610822",
            na: "府谷县"
        },
        {
            co: "610824",
            na: "靖边县"
        },
        {
            co: "610825",
            na: "定边县"
        },
        {
            co: "610826",
            na: "绥德县"
        },
        {
            co: "610827",
            na: "米脂县"
        },
        {
            co: "610828",
            na: "佳县"
        },
        {
            co: "610829",
            na: "吴堡县"
        },
        {
            co: "610830",
            na: "清涧县"
        },
        {
            co: "610831",
            na: "子洲县"
        }]
    },
    {
        co: "610900",
        na: "安康市",
        ch: [{
            co: "610902",
            na: "汉滨区"
        },
        {
            co: "610921",
            na: "汉阴县"
        },
        {
            co: "610922",
            na: "石泉县"
        },
        {
            co: "610923",
            na: "宁陕县"
        },
        {
            co: "610924",
            na: "紫阳县"
        },
        {
            co: "610925",
            na: "岚皋县"
        },
        {
            co: "610926",
            na: "平利县"
        },
        {
            co: "610927",
            na: "镇坪县"
        },
        {
            co: "610928",
            na: "旬阳县"
        },
        {
            co: "610929",
            na: "白河县"
        }]
    },
    {
        co: "611000",
        na: "商洛市",
        ch: [{
            co: "611002",
            na: "商州区"
        },
        {
            co: "611021",
            na: "洛南县"
        },
        {
            co: "611022",
            na: "丹凤县"
        },
        {
            co: "611023",
            na: "商南县"
        },
        {
            co: "611024",
            na: "山阳县"
        },
        {
            co: "611025",
            na: "镇安县"
        },
        {
            co: "611026",
            na: "柞水县"
        }]
    },
    {
        co: "611100",
        na: "西咸新区",
        ch: [{
            co: "611101",
            na: "空港新城"
        },
        {
            co: "611102",
            na: "沣东新城"
        },
        {
            co: "611103",
            na: "秦汉新城"
        },
        {
            co: "611104",
            na: "沣西新城"
        },
        {
            co: "611105",
            na: "泾河新城"
        }]
    }]
},
{
    co: "620000",
    na: "甘肃",
    ch: [{
        co: "620100",
        na: "兰州市",
        ch: [{
            co: "620102",
            na: "城关区"
        },
        {
            co: "620103",
            na: "七里河区"
        },
        {
            co: "620104",
            na: "西固区"
        },
        {
            co: "620105",
            na: "安宁区"
        },
        {
            co: "620111",
            na: "红古区"
        },
        {
            co: "620121",
            na: "永登县"
        },
        {
            co: "620122",
            na: "皋兰县"
        },
        {
            co: "620123",
            na: "榆中县"
        },
        {
            co: "620124",
            na: "兰州新区"
        },
        {
            co: "620125",
            na: "高新区"
        },
        {
            co: "620126",
            na: "经济开发区"
        }]
    },
    {
        co: "620200",
        na: "嘉峪关市",
        ch: [{
            co: "620201",
            na: "雄关区"
        },
        {
            co: "620202",
            na: "长城区"
        },
        {
            co: "620203",
            na: "镜铁区"
        }]
    },
    {
        co: "620300",
        na: "金昌市",
        ch: [{
            co: "620302",
            na: "金川区"
        },
        {
            co: "620321",
            na: "永昌县"
        }]
    },
    {
        co: "620400",
        na: "白银市",
        ch: [{
            co: "620402",
            na: "白银区"
        },
        {
            co: "620403",
            na: "平川区"
        },
        {
            co: "620421",
            na: "靖远县"
        },
        {
            co: "620422",
            na: "会宁县"
        },
        {
            co: "620423",
            na: "景泰县"
        }]
    },
    {
        co: "620500",
        na: "天水市",
        ch: [{
            co: "620502",
            na: "秦州区"
        },
        {
            co: "620503",
            na: "麦积区"
        },
        {
            co: "620521",
            na: "清水县"
        },
        {
            co: "620522",
            na: "秦安县"
        },
        {
            co: "620523",
            na: "甘谷县"
        },
        {
            co: "620524",
            na: "武山县"
        },
        {
            co: "620525",
            na: "张家川回族自治县"
        }]
    },
    {
        co: "620600",
        na: "武威市",
        ch: [{
            co: "620602",
            na: "凉州区"
        },
        {
            co: "620621",
            na: "民勤县"
        },
        {
            co: "620622",
            na: "古浪县"
        },
        {
            co: "620623",
            na: "天祝藏族自治县"
        }]
    },
    {
        co: "620700",
        na: "张掖市",
        ch: [{
            co: "620702",
            na: "甘州区"
        },
        {
            co: "620721",
            na: "肃南裕固族自治县"
        },
        {
            co: "620722",
            na: "民乐县"
        },
        {
            co: "620723",
            na: "临泽县"
        },
        {
            co: "620724",
            na: "高台县"
        },
        {
            co: "620725",
            na: "山丹县"
        }]
    },
    {
        co: "620800",
        na: "平凉市",
        ch: [{
            co: "620802",
            na: "崆峒区"
        },
        {
            co: "620821",
            na: "泾川县"
        },
        {
            co: "620822",
            na: "灵台县"
        },
        {
            co: "620823",
            na: "崇信县"
        },
        {
            co: "620824",
            na: "华亭县"
        },
        {
            co: "620825",
            na: "庄浪县"
        },
        {
            co: "620826",
            na: "静宁县"
        }]
    },
    {
        co: "620900",
        na: "酒泉市",
        ch: [{
            co: "620902",
            na: "肃州区"
        },
        {
            co: "620921",
            na: "金塔县"
        },
        {
            co: "620922",
            na: "瓜州县"
        },
        {
            co: "620923",
            na: "肃北蒙古族自治县"
        },
        {
            co: "620924",
            na: "阿克塞哈萨克族自治县"
        },
        {
            co: "620981",
            na: "玉门市"
        },
        {
            co: "620982",
            na: "敦煌市"
        }]
    },
    {
        co: "621000",
        na: "庆阳市",
        ch: [{
            co: "621002",
            na: "西峰区"
        },
        {
            co: "621021",
            na: "庆城县"
        },
        {
            co: "621022",
            na: "环县"
        },
        {
            co: "621023",
            na: "华池县"
        },
        {
            co: "621024",
            na: "合水县"
        },
        {
            co: "621025",
            na: "正宁县"
        },
        {
            co: "621026",
            na: "宁县"
        },
        {
            co: "621027",
            na: "镇原县"
        }]
    },
    {
        co: "621100",
        na: "定西市",
        ch: [{
            co: "621102",
            na: "安定区"
        },
        {
            co: "621121",
            na: "通渭县"
        },
        {
            co: "621122",
            na: "陇西县"
        },
        {
            co: "621123",
            na: "渭源县"
        },
        {
            co: "621124",
            na: "临洮县"
        },
        {
            co: "621125",
            na: "漳县"
        },
        {
            co: "621126",
            na: "岷县"
        }]
    },
    {
        co: "621200",
        na: "陇南市",
        ch: [{
            co: "621202",
            na: "武都区"
        },
        {
            co: "621221",
            na: "成县"
        },
        {
            co: "621222",
            na: "文县"
        },
        {
            co: "621223",
            na: "宕昌县"
        },
        {
            co: "621224",
            na: "康县"
        },
        {
            co: "621225",
            na: "西和县"
        },
        {
            co: "621226",
            na: "礼县"
        },
        {
            co: "621227",
            na: "徽县"
        },
        {
            co: "621228",
            na: "两当县"
        }]
    },
    {
        co: "622900",
        na: "临夏回族自治州",
        ch: [{
            co: "622901",
            na: "临夏市"
        },
        {
            co: "622921",
            na: "临夏县"
        },
        {
            co: "622922",
            na: "康乐县"
        },
        {
            co: "622923",
            na: "永靖县"
        },
        {
            co: "622924",
            na: "广河县"
        },
        {
            co: "622925",
            na: "和政县"
        },
        {
            co: "622926",
            na: "东乡族自治县"
        },
        {
            co: "622927",
            na: "积石山保安族东乡族撒拉族自治县"
        }]
    },
    {
        co: "623000",
        na: "甘南藏族自治州",
        ch: [{
            co: "623001",
            na: "合作市"
        },
        {
            co: "623021",
            na: "临潭县"
        },
        {
            co: "623022",
            na: "卓尼县"
        },
        {
            co: "623023",
            na: "舟曲县"
        },
        {
            co: "623024",
            na: "迭部县"
        },
        {
            co: "623025",
            na: "玛曲县"
        },
        {
            co: "623026",
            na: "碌曲县"
        },
        {
            co: "623027",
            na: "夏河县"
        }]
    }]
},
{
    co: "630000",
    na: "青海",
    ch: [{
        co: "630100",
        na: "西宁市",
        ch: [{
            co: "630102",
            na: "城东区"
        },
        {
            co: "630103",
            na: "城中区"
        },
        {
            co: "630104",
            na: "城西区"
        },
        {
            co: "630105",
            na: "城北区"
        },
        {
            co: "630121",
            na: "大通回族土族自治县"
        },
        {
            co: "630122",
            na: "湟中县"
        },
        {
            co: "630123",
            na: "湟源县"
        }]
    },
    {
        co: "630200",
        na: "海东市",
        ch: [{
            co: "630202",
            na: "乐都区"
        },
        {
            co: "630203",
            na: "平安区"
        },
        {
            co: "630222",
            na: "民和回族土族自治县"
        },
        {
            co: "630223",
            na: "互助土族自治县"
        },
        {
            co: "630224",
            na: "化隆回族自治县"
        },
        {
            co: "630225",
            na: "循化撒拉族自治县"
        }]
    },
    {
        co: "632200",
        na: "海北藏族自治州",
        ch: [{
            co: "632221",
            na: "门源回族自治县"
        },
        {
            co: "632222",
            na: "祁连县"
        },
        {
            co: "632223",
            na: "海晏县"
        },
        {
            co: "632224",
            na: "刚察县"
        }]
    },
    {
        co: "632300",
        na: "黄南藏族自治州",
        ch: [{
            co: "632321",
            na: "同仁县"
        },
        {
            co: "632322",
            na: "尖扎县"
        },
        {
            co: "632323",
            na: "泽库县"
        },
        {
            co: "632324",
            na: "河南蒙古族自治县"
        }]
    },
    {
        co: "632500",
        na: "海南藏族自治州",
        ch: [{
            co: "632521",
            na: "共和县"
        },
        {
            co: "632522",
            na: "同德县"
        },
        {
            co: "632523",
            na: "贵德县"
        },
        {
            co: "632524",
            na: "兴海县"
        },
        {
            co: "632525",
            na: "贵南县"
        }]
    },
    {
        co: "632600",
        na: "果洛藏族自治州",
        ch: [{
            co: "632621",
            na: "玛沁县"
        },
        {
            co: "632622",
            na: "班玛县"
        },
        {
            co: "632623",
            na: "甘德县"
        },
        {
            co: "632624",
            na: "达日县"
        },
        {
            co: "632625",
            na: "久治县"
        },
        {
            co: "632626",
            na: "玛多县"
        }]
    },
    {
        co: "632700",
        na: "玉树藏族自治州",
        ch: [{
            co: "632701",
            na: "玉树市"
        },
        {
            co: "632722",
            na: "杂多县"
        },
        {
            co: "632723",
            na: "称多县"
        },
        {
            co: "632724",
            na: "治多县"
        },
        {
            co: "632725",
            na: "囊谦县"
        },
        {
            co: "632726",
            na: "曲麻莱县"
        }]
    },
    {
        co: "632800",
        na: "海西蒙古族藏族自治州",
        ch: [{
            co: "632801",
            na: "格尔木市"
        },
        {
            co: "632802",
            na: "德令哈市"
        },
        {
            co: "632821",
            na: "乌兰县"
        },
        {
            co: "632822",
            na: "都兰县"
        },
        {
            co: "632823",
            na: "天峻县"
        }]
    }]
},
{
    co: "640000",
    na: "宁夏",
    ch: [{
        co: "640100",
        na: "银川市",
        ch: [{
            co: "640104",
            na: "兴庆区"
        },
        {
            co: "640105",
            na: "西夏区"
        },
        {
            co: "640106",
            na: "金凤区"
        },
        {
            co: "640121",
            na: "永宁县"
        },
        {
            co: "640122",
            na: "贺兰县"
        },
        {
            co: "640181",
            na: "灵武市"
        },
        {
            co: "6401821",
            na: "经济开发区"
        }]
    },
    {
        co: "640200",
        na: "石嘴山市",
        ch: [{
            co: "640202",
            na: "大武口区"
        },
        {
            co: "640205",
            na: "惠农区"
        },
        {
            co: "640221",
            na: "平罗县"
        },
        {
            co: "640222",
            na: "经济开发区"
        }]
    },
    {
        co: "640300",
        na: "吴忠市",
        ch: [{
            co: "640302",
            na: "利通区"
        },
        {
            co: "640303",
            na: "红寺堡区"
        },
        {
            co: "640323",
            na: "盐池县"
        },
        {
            co: "640324",
            na: "同心县"
        },
        {
            co: "640381",
            na: "青铜峡市"
        }]
    },
    {
        co: "640400",
        na: "固原市",
        ch: [{
            co: "640402",
            na: "原州区"
        },
        {
            co: "640422",
            na: "西吉县"
        },
        {
            co: "640423",
            na: "隆德县"
        },
        {
            co: "640424",
            na: "泾源县"
        },
        {
            co: "640425",
            na: "彭阳县"
        }]
    },
    {
        co: "640500",
        na: "中卫市",
        ch: [{
            co: "640502",
            na: "沙坡头区"
        },
        {
            co: "640521",
            na: "中宁县"
        },
        {
            co: "640522",
            na: "海原县"
        }]
    }]
},
{
    co: "650000",
    na: "新疆",
    ch: [{
        co: "650100",
        na: "乌鲁木齐市",
        ch: [{
            co: "650102",
            na: "天山区"
        },
        {
            co: "650103",
            na: "沙依巴克区"
        },
        {
            co: "650104",
            na: "新市区"
        },
        {
            co: "650105",
            na: "水磨沟区"
        },
        {
            co: "650106",
            na: "头屯河区"
        },
        {
            co: "650107",
            na: "达坂城区"
        },
        {
            co: "650109",
            na: "米东区"
        },
        {
            co: "650121",
            na: "乌鲁木齐县"
        }]
    },
    {
        co: "650200",
        na: "克拉玛依市",
        ch: [{
            co: "650202",
            na: "独山子区"
        },
        {
            co: "650203",
            na: "克拉玛依区"
        },
        {
            co: "650204",
            na: "白碱滩区"
        },
        {
            co: "650205",
            na: "乌尔禾区"
        }]
    },
    {
        co: "650400",
        na: "吐鲁番市",
        ch: [{
            co: "650402",
            na: "高昌区"
        },
        {
            co: "650421",
            na: "鄯善县"
        },
        {
            co: "650422",
            na: "托克逊县"
        }]
    },
    {
        co: "652200",
        na: "哈密市",
        ch: [{
            co: "652201",
            na: "伊州区"
        },
        {
            co: "652222",
            na: "巴里坤哈萨克自治县"
        },
        {
            co: "652223",
            na: "伊吾县"
        }]
    },
    {
        co: "652300",
        na: "昌吉回族自治州",
        ch: [{
            co: "652301",
            na: "昌吉市"
        },
        {
            co: "652302",
            na: "阜康市"
        },
        {
            co: "652323",
            na: "呼图壁县"
        },
        {
            co: "652324",
            na: "玛纳斯县"
        },
        {
            co: "652325",
            na: "奇台县"
        },
        {
            co: "652327",
            na: "吉木萨尔县"
        },
        {
            co: "652328",
            na: "木垒哈萨克自治县"
        }]
    },
    {
        co: "652700",
        na: "博尔塔拉蒙古自治州",
        ch: [{
            co: "652701",
            na: "博乐市"
        },
        {
            co: "652702",
            na: "阿拉山口市"
        },
        {
            co: "652722",
            na: "精河县"
        },
        {
            co: "652723",
            na: "温泉县"
        }]
    },
    {
        co: "652800",
        na: "巴音郭楞蒙古自治州",
        ch: [{
            co: "652801",
            na: "库尔勒市"
        },
        {
            co: "652822",
            na: "轮台县"
        },
        {
            co: "652823",
            na: "尉犁县"
        },
        {
            co: "652824",
            na: "若羌县"
        },
        {
            co: "652825",
            na: "且末县"
        },
        {
            co: "652826",
            na: "焉耆回族自治县"
        },
        {
            co: "652827",
            na: "和静县"
        },
        {
            co: "652828",
            na: "和硕县"
        },
        {
            co: "652829",
            na: "博湖县"
        }]
    },
    {
        co: "652900",
        na: "阿克苏地区",
        ch: [{
            co: "652901",
            na: "阿克苏市"
        },
        {
            co: "652922",
            na: "温宿县"
        },
        {
            co: "652923",
            na: "库车县"
        },
        {
            co: "652924",
            na: "沙雅县"
        },
        {
            co: "652925",
            na: "新和县"
        },
        {
            co: "652926",
            na: "拜城县"
        },
        {
            co: "652927",
            na: "乌什县"
        },
        {
            co: "652928",
            na: "阿瓦提县"
        },
        {
            co: "652929",
            na: "柯坪县"
        }]
    },
    {
        co: "653000",
        na: "克孜勒苏柯尔克孜自治州",
        ch: [{
            co: "653001",
            na: "阿图什市"
        },
        {
            co: "653022",
            na: "阿克陶县"
        },
        {
            co: "653023",
            na: "阿合奇县"
        },
        {
            co: "653024",
            na: "乌恰县"
        }]
    },
    {
        co: "653100",
        na: "喀什地区",
        ch: [{
            co: "653101",
            na: "喀什市"
        },
        {
            co: "653121",
            na: "疏附县"
        },
        {
            co: "653122",
            na: "疏勒县"
        },
        {
            co: "653123",
            na: "英吉沙县"
        },
        {
            co: "653124",
            na: "泽普县"
        },
        {
            co: "653125",
            na: "莎车县"
        },
        {
            co: "653126",
            na: "叶城县"
        },
        {
            co: "653127",
            na: "麦盖提县"
        },
        {
            co: "653128",
            na: "岳普湖县"
        },
        {
            co: "653129",
            na: "伽师县"
        },
        {
            co: "653130",
            na: "巴楚县"
        },
        {
            co: "653131",
            na: "塔什库尔干塔吉克自治县"
        }]
    },
    {
        co: "653200",
        na: "和田地区",
        ch: [{
            co: "653201",
            na: "和田市"
        },
        {
            co: "653221",
            na: "和田县"
        },
        {
            co: "653222",
            na: "墨玉县"
        },
        {
            co: "653223",
            na: "皮山县"
        },
        {
            co: "653224",
            na: "洛浦县"
        },
        {
            co: "653225",
            na: "策勒县"
        },
        {
            co: "653226",
            na: "于田县"
        },
        {
            co: "653227",
            na: "民丰县"
        }]
    },
    {
        co: "654000",
        na: "伊犁哈萨克自治州",
        ch: [{
            co: "654002",
            na: "伊宁市"
        },
        {
            co: "654003",
            na: "奎屯市"
        },
        {
            co: "654004",
            na: "霍尔果斯市"
        },
        {
            co: "654021",
            na: "伊宁县"
        },
        {
            co: "654022",
            na: "察布查尔锡伯自治县"
        },
        {
            co: "654023",
            na: "霍城县"
        },
        {
            co: "654024",
            na: "巩留县"
        },
        {
            co: "654025",
            na: "新源县"
        },
        {
            co: "654026",
            na: "昭苏县"
        },
        {
            co: "654027",
            na: "特克斯县"
        },
        {
            co: "654028",
            na: "尼勒克县"
        }]
    },
    {
        co: "654200",
        na: "塔城地区",
        ch: [{
            co: "654201",
            na: "塔城市"
        },
        {
            co: "654202",
            na: "乌苏市"
        },
        {
            co: "654221",
            na: "额敏县"
        },
        {
            co: "654223",
            na: "沙湾县"
        },
        {
            co: "654224",
            na: "托里县"
        },
        {
            co: "654225",
            na: "裕民县"
        },
        {
            co: "654226",
            na: "和布克赛尔蒙古自治县"
        }]
    },
    {
        co: "654300",
        na: "阿勒泰地区",
        ch: [{
            co: "654301",
            na: "阿勒泰市"
        },
        {
            co: "654321",
            na: "布尔津县"
        },
        {
            co: "654322",
            na: "富蕴县"
        },
        {
            co: "654323",
            na: "福海县"
        },
        {
            co: "654324",
            na: "哈巴河县"
        },
        {
            co: "654325",
            na: "青河县"
        },
        {
            co: "654326",
            na: "吉木乃县"
        }]
    },
    {
        co: "659001",
        na: "石河子市",
        ch: [{
            co: "659101",
            na: "新城街道"
        },
        {
            co: "659102",
            na: "向阳街道"
        },
        {
            co: "659103",
            na: "红山街道"
        },
        {
            co: "659104",
            na: "老街街道"
        },
        {
            co: "659105",
            na: "东城街道"
        },
        {
            co: "659106",
            na: "北泉镇"
        },
        {
            co: "659107",
            na: "石河子乡"
        },
        {
            co: "659108",
            na: "一五二团"
        }]
    },
    {
        co: "659002",
        na: "阿拉尔市",
        ch: [{
            co: "659201",
            na: "幸福路街道"
        },
        {
            co: "659202",
            na: "金银川路街道"
        },
        {
            co: "659203",
            na: "青松路街道"
        },
        {
            co: "659204",
            na: "南口街道"
        },
        {
            co: "659205",
            na: "托喀依乡"
        },
        {
            co: "659206",
            na: "金银川镇"
        }]
    },
    {
        co: "659003",
        na: "图木舒克市",
        ch: [{
            co: "659301",
            na: "图木舒克市区"
        },
        {
            co: "659302",
            na: "兵团四十四团"
        },
        {
            co: "659303",
            na: "兵团四十九团"
        },
        {
            co: "659304",
            na: "兵团五十团"
        },
        {
            co: "659305",
            na: "兵团五十一团"
        },
        {
            co: "659306",
            na: "兵团五十二团"
        },
        {
            co: "659307",
            na: "兵团五十三团"
        },
        {
            co: "659308",
            na: "喀拉拜勒镇"
        },
        {
            co: "659309",
            na: "永安坝"
        }]
    },
    {
        co: "659004",
        na: "五家渠市",
        ch: [{
            co: "659401",
            na: "城区"
        },
        {
            co: "659402",
            na: "一零一团"
        },
        {
            co: "659403",
            na: "一零二团"
        },
        {
            co: "659404",
            na: "一零三团"
        }]
    },
    {
        co: "659005",
        na: "北屯市",
        ch: [{
            co: "659501",
            na: "新城区"
        },
        {
            co: "659502",
            na: "老城区"
        },
        {
            co: "659503",
            na: "工业园区"
        },
        {
            co: "659504",
            na: "海川镇"
        },
        {
            co: "659505",
            na: "丰庆镇"
        },
        {
            co: "659506",
            na: "锡伯渡镇"
        }]
    },
    {
        co: "659006",
        na: "铁门关市",
        ch: [{
            co: "659601",
            na: "二十九团场"
        },
        {
            co: "659602",
            na: "库西经济工业园"
        },
        {
            co: "659603",
            na: "博古其镇"
        },
        {
            co: "659604",
            na: "双丰镇"
        }]
    },
    {
        co: "659007",
        na: "双河市",
        ch: [{
            co: "659701",
            na: "八十一团"
        },
        {
            co: "659702",
            na: "八十四团"
        },
        {
            co: "659703",
            na: "八十五团"
        },
        {
            co: "659704",
            na: "八十六团"
        },
        {
            co: "659705",
            na: "八十九团"
        },
        {
            co: "659706",
            na: "九十团"
        }]
    },
    {
        co: "659008",
        na: "可克达拉市",
        ch: [{
            co: "659801",
            na: "63团"
        },
        {
            co: "659802",
            na: "64团"
        },
        {
            co: "659803",
            na: "66团"
        },
        {
            co: "659804",
            na: "67团"
        },
        {
            co: "659805",
            na: "68团"
        }]
    },
    {
        co: "659009",
        na: "昆玉市",
        ch: [{
            co: "659901",
            na: "皮山农场"
        },
        {
            co: "659902",
            na: "二二四团"
        },
        {
            co: "659903",
            na: "四十七团"
        },
        {
            co: "659904",
            na: "一牧场"
        }]
    }]
},
{
    co: "710000",
    na: "台湾",
    ch: [{
        co: "710100",
        na: "台北市",
        ch: [{
            co: "710101",
            na: "松山区"
        },
        {
            co: "710102",
            na: "信义区"
        },
        {
            co: "710103",
            na: "大安区"
        },
        {
            co: "710104",
            na: "中山区"
        },
        {
            co: "710105",
            na: "中正区"
        },
        {
            co: "710106",
            na: "大同区"
        },
        {
            co: "710107",
            na: "万华区"
        },
        {
            co: "710108",
            na: "文山区"
        },
        {
            co: "710109",
            na: "南港区"
        },
        {
            co: "710110",
            na: "内湖区"
        },
        {
            co: "710111",
            na: "士林区"
        },
        {
            co: "710112",
            na: "北投区"
        }]
    },
    {
        co: "710200",
        na: "高雄市",
        ch: [{
            co: "710201",
            na: "盐埕区"
        },
        {
            co: "710202",
            na: "鼓山区"
        },
        {
            co: "710203",
            na: "左营区"
        },
        {
            co: "710204",
            na: "楠梓区"
        },
        {
            co: "710205",
            na: "三民区"
        },
        {
            co: "710206",
            na: "新兴区"
        },
        {
            co: "710207",
            na: "前金区"
        },
        {
            co: "710208",
            na: "苓雅区"
        },
        {
            co: "710209",
            na: "前镇区"
        },
        {
            co: "710210",
            na: "旗津区"
        },
        {
            co: "710211",
            na: "小港区"
        },
        {
            co: "710212",
            na: "凤山区"
        },
        {
            co: "710213",
            na: "林园区"
        },
        {
            co: "710214",
            na: "大寮区"
        },
        {
            co: "710215",
            na: "大树区"
        },
        {
            co: "710216",
            na: "大社区"
        },
        {
            co: "710217",
            na: "仁武区"
        },
        {
            co: "710218",
            na: "鸟松区"
        },
        {
            co: "710219",
            na: "冈山区"
        },
        {
            co: "710220",
            na: "桥头区"
        },
        {
            co: "710221",
            na: "燕巢区"
        },
        {
            co: "710222",
            na: "田寮区"
        },
        {
            co: "710223",
            na: "阿莲区"
        },
        {
            co: "710224",
            na: "路竹区"
        },
        {
            co: "710225",
            na: "湖内区"
        },
        {
            co: "710226",
            na: "茄萣区"
        },
        {
            co: "710227",
            na: "永安区"
        },
        {
            co: "710228",
            na: "弥陀区"
        },
        {
            co: "710229",
            na: "梓官区"
        },
        {
            co: "710230",
            na: "旗山区"
        },
        {
            co: "710231",
            na: "美浓区"
        },
        {
            co: "710232",
            na: "六龟区"
        },
        {
            co: "710233",
            na: "甲仙区"
        },
        {
            co: "710234",
            na: "杉林区"
        },
        {
            co: "710235",
            na: "内门区"
        },
        {
            co: "710236",
            na: "茂林区"
        },
        {
            co: "710237",
            na: "桃源区"
        },
        {
            co: "710238",
            na: "那玛夏区"
        }]
    },
    {
        co: "710300",
        na: "基隆市",
        ch: [{
            co: "710301",
            na: "中正区"
        },
        {
            co: "710302",
            na: "七堵区"
        },
        {
            co: "710303",
            na: "暖暖区"
        },
        {
            co: "710304",
            na: "仁爱区"
        },
        {
            co: "710305",
            na: "中山区"
        },
        {
            co: "710306",
            na: "安乐区"
        },
        {
            co: "710307",
            na: "信义区"
        }]
    },
    {
        co: "710400",
        na: "台中市",
        ch: [{
            co: "710401",
            na: "中区"
        },
        {
            co: "710402",
            na: "东区"
        },
        {
            co: "710403",
            na: "南区"
        },
        {
            co: "710404",
            na: "西区"
        },
        {
            co: "710405",
            na: "北区"
        },
        {
            co: "710406",
            na: "西屯区"
        },
        {
            co: "710407",
            na: "南屯区"
        },
        {
            co: "710408",
            na: "北屯区"
        },
        {
            co: "710409",
            na: "丰原区"
        },
        {
            co: "710410",
            na: "东势区"
        },
        {
            co: "710411",
            na: "大甲区"
        },
        {
            co: "710412",
            na: "清水区"
        },
        {
            co: "710413",
            na: "沙鹿区"
        },
        {
            co: "710414",
            na: "梧栖区"
        },
        {
            co: "710415",
            na: "后里区"
        },
        {
            co: "710416",
            na: "神冈区"
        },
        {
            co: "710417",
            na: "潭子区"
        },
        {
            co: "710418",
            na: "大雅区"
        },
        {
            co: "710419",
            na: "新社区"
        },
        {
            co: "710420",
            na: "石冈区"
        },
        {
            co: "710421",
            na: "外埔区"
        },
        {
            co: "710422",
            na: "大安区"
        },
        {
            co: "710423",
            na: "乌日区"
        },
        {
            co: "710424",
            na: "大肚区"
        },
        {
            co: "710425",
            na: "龙井区"
        },
        {
            co: "710426",
            na: "雾峰区"
        },
        {
            co: "710427",
            na: "太平区"
        },
        {
            co: "710428",
            na: "大里区"
        },
        {
            co: "710429",
            na: "和平区"
        }]
    },
    {
        co: "710500",
        na: "台南市",
        ch: [{
            co: "710501",
            na: "东区"
        },
        {
            co: "710502",
            na: "南区"
        },
        {
            co: "710504",
            na: "北区"
        },
        {
            co: "710506",
            na: "安南区"
        },
        {
            co: "710507",
            na: "安平区"
        },
        {
            co: "710508",
            na: "中西区"
        },
        {
            co: "710509",
            na: "新营区"
        },
        {
            co: "710510",
            na: "盐水区"
        },
        {
            co: "710511",
            na: "白河区"
        },
        {
            co: "710512",
            na: "柳营区"
        },
        {
            co: "710513",
            na: "后壁区"
        },
        {
            co: "710514",
            na: "东山区"
        },
        {
            co: "710515",
            na: "麻豆区"
        },
        {
            co: "710516",
            na: "下营区"
        },
        {
            co: "710517",
            na: "六甲区"
        },
        {
            co: "710518",
            na: "官田区"
        },
        {
            co: "710519",
            na: "大内区"
        },
        {
            co: "710520",
            na: "佳里区"
        },
        {
            co: "710521",
            na: "学甲区"
        },
        {
            co: "710522",
            na: "西港区"
        },
        {
            co: "710523",
            na: "七股区"
        },
        {
            co: "710524",
            na: "将军区"
        },
        {
            co: "710525",
            na: "北门区"
        },
        {
            co: "710526",
            na: "新化区"
        },
        {
            co: "710527",
            na: "善化区"
        },
        {
            co: "710528",
            na: "新市区"
        },
        {
            co: "710529",
            na: "安定区"
        },
        {
            co: "710530",
            na: "山上区"
        },
        {
            co: "710531",
            na: "玉井区"
        },
        {
            co: "710532",
            na: "楠西区"
        },
        {
            co: "710533",
            na: "南化区"
        },
        {
            co: "710534",
            na: "左镇区"
        },
        {
            co: "710535",
            na: "仁德区"
        },
        {
            co: "710536",
            na: "归仁区"
        },
        {
            co: "710537",
            na: "关庙区"
        },
        {
            co: "710538",
            na: "龙崎区"
        },
        {
            co: "710539",
            na: "永康区"
        }]
    },
    {
        co: "710600",
        na: "新竹市",
        ch: [{
            co: "710601",
            na: "东区"
        },
        {
            co: "710602",
            na: "北区"
        },
        {
            co: "710603",
            na: "香山区"
        }]
    },
    {
        co: "710700",
        na: "嘉义市",
        ch: [{
            co: "710701",
            na: "东区"
        },
        {
            co: "710702",
            na: "西区"
        }]
    },
    {
        co: "710800",
        na: "新北市",
        ch: [{
            co: "710801",
            na: "板桥区"
        },
        {
            co: "710802",
            na: "三重区"
        },
        {
            co: "710803",
            na: "中和区"
        },
        {
            co: "710804",
            na: "永和区"
        },
        {
            co: "710805",
            na: "新庄区"
        },
        {
            co: "710806",
            na: "新店区"
        },
        {
            co: "710807",
            na: "树林区"
        },
        {
            co: "710808",
            na: "莺歌区"
        },
        {
            co: "710809",
            na: "三峡区"
        },
        {
            co: "710810",
            na: "淡水区"
        },
        {
            co: "710811",
            na: "汐止区"
        },
        {
            co: "710812",
            na: "瑞芳区"
        },
        {
            co: "710813",
            na: "土城区"
        },
        {
            co: "710814",
            na: "芦洲区"
        },
        {
            co: "710815",
            na: "五股区"
        },
        {
            co: "710816",
            na: "泰山区"
        },
        {
            co: "710817",
            na: "林口区"
        },
        {
            co: "710818",
            na: "深坑区"
        },
        {
            co: "710819",
            na: "石碇区"
        },
        {
            co: "710820",
            na: "坪林区"
        },
        {
            co: "710821",
            na: "三芝区"
        },
        {
            co: "710822",
            na: "石门区"
        },
        {
            co: "710823",
            na: "八里区"
        },
        {
            co: "710824",
            na: "平溪区"
        },
        {
            co: "710825",
            na: "双溪区"
        },
        {
            co: "710826",
            na: "贡寮区"
        },
        {
            co: "710827",
            na: "金山区"
        },
        {
            co: "710828",
            na: "万里区"
        },
        {
            co: "710829",
            na: "乌来区"
        }]
    },
    {
        co: "712200",
        na: "宜兰县",
        ch: [{
            co: "712201",
            na: "宜兰市"
        },
        {
            co: "712221",
            na: "罗东镇"
        },
        {
            co: "712222",
            na: "苏澳镇"
        },
        {
            co: "712223",
            na: "头城镇"
        },
        {
            co: "712224",
            na: "礁溪乡"
        },
        {
            co: "712225",
            na: "壮围乡"
        },
        {
            co: "712226",
            na: "员山乡"
        },
        {
            co: "712227",
            na: "冬山乡"
        },
        {
            co: "712228",
            na: "五结乡"
        },
        {
            co: "712229",
            na: "三星乡"
        },
        {
            co: "712230",
            na: "大同乡"
        },
        {
            co: "712231",
            na: "南澳乡"
        }]
    },
    {
        co: "712300",
        na: "桃园市",
        ch: [{
            co: "712301",
            na: "桃园市"
        },
        {
            co: "712302",
            na: "中坜市"
        },
        {
            co: "712303",
            na: "平镇市"
        },
        {
            co: "712304",
            na: "八德市"
        },
        {
            co: "712305",
            na: "杨梅市"
        },
        {
            co: "712306",
            na: "芦竹市"
        },
        {
            co: "712321",
            na: "大溪镇"
        },
        {
            co: "712324",
            na: "大园乡"
        },
        {
            co: "712325",
            na: "龟山乡"
        },
        {
            co: "712327",
            na: "龙潭乡"
        },
        {
            co: "712329",
            na: "新屋乡"
        },
        {
            co: "712330",
            na: "观音乡"
        },
        {
            co: "712331",
            na: "复兴乡"
        }]
    },
    {
        co: "712400",
        na: "新竹县",
        ch: [{
            co: "712401",
            na: "竹北市"
        },
        {
            co: "712421",
            na: "竹东镇"
        },
        {
            co: "712422",
            na: "新埔镇"
        },
        {
            co: "712423",
            na: "关西镇"
        },
        {
            co: "712424",
            na: "湖口乡"
        },
        {
            co: "712425",
            na: "新丰乡"
        },
        {
            co: "712426",
            na: "芎林乡"
        },
        {
            co: "712427",
            na: "横山乡"
        },
        {
            co: "712428",
            na: "北埔乡"
        },
        {
            co: "712429",
            na: "宝山乡"
        },
        {
            co: "712430",
            na: "峨眉乡"
        },
        {
            co: "712431",
            na: "尖石乡"
        },
        {
            co: "712432",
            na: "五峰乡"
        }]
    },
    {
        co: "712500",
        na: "苗栗县",
        ch: [{
            co: "712501",
            na: "苗栗市"
        },
        {
            co: "712521",
            na: "苑里镇"
        },
        {
            co: "712522",
            na: "通霄镇"
        },
        {
            co: "712523",
            na: "竹南镇"
        },
        {
            co: "712524",
            na: "头份市"
        },
        {
            co: "712525",
            na: "后龙镇"
        },
        {
            co: "712526",
            na: "卓兰镇"
        },
        {
            co: "712527",
            na: "大湖乡"
        },
        {
            co: "712528",
            na: "公馆乡"
        },
        {
            co: "712529",
            na: "铜锣乡"
        },
        {
            co: "712530",
            na: "南庄乡"
        },
        {
            co: "712531",
            na: "头屋乡"
        },
        {
            co: "712532",
            na: "三义乡"
        },
        {
            co: "712533",
            na: "西湖乡"
        },
        {
            co: "712534",
            na: "造桥乡"
        },
        {
            co: "712535",
            na: "三湾乡"
        },
        {
            co: "712536",
            na: "狮潭乡"
        },
        {
            co: "712537",
            na: "泰安乡"
        }]
    },
    {
        co: "712700",
        na: "彰化县",
        ch: [{
            co: "712701",
            na: "彰化市"
        },
        {
            co: "712721",
            na: "鹿港镇"
        },
        {
            co: "712722",
            na: "和美镇"
        },
        {
            co: "712723",
            na: "线西乡"
        },
        {
            co: "712724",
            na: "伸港乡"
        },
        {
            co: "712725",
            na: "福兴乡"
        },
        {
            co: "712726",
            na: "秀水乡"
        },
        {
            co: "712727",
            na: "花坛乡"
        },
        {
            co: "712728",
            na: "芬园乡"
        },
        {
            co: "712729",
            na: "员林市"
        },
        {
            co: "712730",
            na: "溪湖镇"
        },
        {
            co: "712731",
            na: "田中镇"
        },
        {
            co: "712732",
            na: "大村乡"
        },
        {
            co: "712733",
            na: "埔盐乡"
        },
        {
            co: "712734",
            na: "埔心乡"
        },
        {
            co: "712735",
            na: "永靖乡"
        },
        {
            co: "712736",
            na: "社头乡"
        },
        {
            co: "712737",
            na: "二水乡"
        },
        {
            co: "712738",
            na: "北斗镇"
        },
        {
            co: "712739",
            na: "二林镇"
        },
        {
            co: "712740",
            na: "田尾乡"
        },
        {
            co: "712741",
            na: "埤头乡"
        },
        {
            co: "712742",
            na: "芳苑乡"
        },
        {
            co: "712743",
            na: "大城乡"
        },
        {
            co: "712744",
            na: "竹塘乡"
        },
        {
            co: "712745",
            na: "溪州乡"
        }]
    },
    {
        co: "712800",
        na: "南投县",
        ch: [{
            co: "712801",
            na: "南投市"
        },
        {
            co: "712821",
            na: "埔里镇"
        },
        {
            co: "712822",
            na: "草屯镇"
        },
        {
            co: "712823",
            na: "竹山镇"
        },
        {
            co: "712824",
            na: "集集镇"
        },
        {
            co: "712825",
            na: "名间乡"
        },
        {
            co: "712826",
            na: "鹿谷乡"
        },
        {
            co: "712827",
            na: "中寮乡"
        },
        {
            co: "712828",
            na: "鱼池乡"
        },
        {
            co: "712829",
            na: "国姓乡"
        },
        {
            co: "712830",
            na: "水里乡"
        },
        {
            co: "712831",
            na: "信义乡"
        },
        {
            co: "712832",
            na: "仁爱乡"
        }]
    },
    {
        co: "712900",
        na: "云林县",
        ch: [{
            co: "712901",
            na: "斗六市"
        },
        {
            co: "712921",
            na: "斗南镇"
        },
        {
            co: "712922",
            na: "虎尾镇"
        },
        {
            co: "712923",
            na: "西螺镇"
        },
        {
            co: "712924",
            na: "土库镇"
        },
        {
            co: "712925",
            na: "北港镇"
        },
        {
            co: "712926",
            na: "古坑乡"
        },
        {
            co: "712927",
            na: "大埤乡"
        },
        {
            co: "712928",
            na: "莿桐乡"
        },
        {
            co: "712929",
            na: "林内乡"
        },
        {
            co: "712930",
            na: "二仑乡"
        },
        {
            co: "712931",
            na: "仑背乡"
        },
        {
            co: "712932",
            na: "麦寮乡"
        },
        {
            co: "712933",
            na: "东势乡"
        },
        {
            co: "712934",
            na: "褒忠乡"
        },
        {
            co: "712935",
            na: "台西乡"
        },
        {
            co: "712936",
            na: "元长乡"
        },
        {
            co: "712937",
            na: "四湖乡"
        },
        {
            co: "712938",
            na: "口湖乡"
        },
        {
            co: "712939",
            na: "水林乡"
        }]
    },
    {
        co: "713000",
        na: "嘉义县",
        ch: [{
            co: "713001",
            na: "太保市"
        },
        {
            co: "713002",
            na: "朴子市"
        },
        {
            co: "713023",
            na: "布袋镇"
        },
        {
            co: "713024",
            na: "大林镇"
        },
        {
            co: "713025",
            na: "民雄乡"
        },
        {
            co: "713026",
            na: "溪口乡"
        },
        {
            co: "713027",
            na: "新港乡"
        },
        {
            co: "713028",
            na: "六脚乡"
        },
        {
            co: "713029",
            na: "东石乡"
        },
        {
            co: "713030",
            na: "义竹乡"
        },
        {
            co: "713031",
            na: "鹿草乡"
        },
        {
            co: "713032",
            na: "水上乡"
        },
        {
            co: "713033",
            na: "中埔乡"
        },
        {
            co: "713034",
            na: "竹崎乡"
        },
        {
            co: "713035",
            na: "梅山乡"
        },
        {
            co: "713036",
            na: "番路乡"
        },
        {
            co: "713037",
            na: "大埔乡"
        },
        {
            co: "713038",
            na: "阿里山乡"
        }]
    },
    {
        co: "713300",
        na: "屏东县",
        ch: [{
            co: "713301",
            na: "屏东市"
        },
        {
            co: "713321",
            na: "潮州镇"
        },
        {
            co: "713322",
            na: "东港镇"
        },
        {
            co: "713323",
            na: "恒春镇"
        },
        {
            co: "713324",
            na: "万丹乡"
        },
        {
            co: "713325",
            na: "长治乡"
        },
        {
            co: "713326",
            na: "麟洛乡"
        },
        {
            co: "713327",
            na: "九如乡"
        },
        {
            co: "713328",
            na: "里港乡"
        },
        {
            co: "713329",
            na: "盐埔乡"
        },
        {
            co: "713330",
            na: "高树乡"
        },
        {
            co: "713331",
            na: "万峦乡"
        },
        {
            co: "713332",
            na: "内埔乡"
        },
        {
            co: "713333",
            na: "竹田乡"
        },
        {
            co: "713334",
            na: "新埤乡"
        },
        {
            co: "713335",
            na: "枋寮乡"
        },
        {
            co: "713336",
            na: "新园乡"
        },
        {
            co: "713337",
            na: "崁顶乡"
        },
        {
            co: "713338",
            na: "林边乡"
        },
        {
            co: "713339",
            na: "南州乡"
        },
        {
            co: "713340",
            na: "佳冬乡"
        },
        {
            co: "713341",
            na: "琉球乡"
        },
        {
            co: "713342",
            na: "车城乡"
        },
        {
            co: "713343",
            na: "满州乡"
        },
        {
            co: "713344",
            na: "枋山乡"
        },
        {
            co: "713345",
            na: "三地门乡"
        },
        {
            co: "713346",
            na: "雾台乡"
        },
        {
            co: "713347",
            na: "玛家乡"
        },
        {
            co: "713348",
            na: "泰武乡"
        },
        {
            co: "713349",
            na: "来义乡"
        },
        {
            co: "713350",
            na: "春日乡"
        },
        {
            co: "713351",
            na: "狮子乡"
        },
        {
            co: "713352",
            na: "牡丹乡"
        }]
    },
    {
        co: "713400",
        na: "台东县",
        ch: [{
            co: "713401",
            na: "台东市"
        },
        {
            co: "713421",
            na: "成功镇"
        },
        {
            co: "713422",
            na: "关山镇"
        },
        {
            co: "713423",
            na: "卑南乡"
        },
        {
            co: "713424",
            na: "鹿野乡"
        },
        {
            co: "713425",
            na: "池上乡"
        },
        {
            co: "713426",
            na: "东河乡"
        },
        {
            co: "713427",
            na: "长滨乡"
        },
        {
            co: "713428",
            na: "太麻里乡"
        },
        {
            co: "713429",
            na: "大武乡"
        },
        {
            co: "713430",
            na: "绿岛乡"
        },
        {
            co: "713431",
            na: "海端乡"
        },
        {
            co: "713432",
            na: "延平乡"
        },
        {
            co: "713433",
            na: "金峰乡"
        },
        {
            co: "713434",
            na: "达仁乡"
        },
        {
            co: "713435",
            na: "兰屿乡"
        }]
    },
    {
        co: "713500",
        na: "花莲县",
        ch: [{
            co: "713501",
            na: "花莲市"
        },
        {
            co: "713521",
            na: "凤林镇"
        },
        {
            co: "713522",
            na: "玉里镇"
        },
        {
            co: "713523",
            na: "新城乡"
        },
        {
            co: "713524",
            na: "吉安乡"
        },
        {
            co: "713525",
            na: "寿丰乡"
        },
        {
            co: "713526",
            na: "光复乡"
        },
        {
            co: "713527",
            na: "丰滨乡"
        },
        {
            co: "713528",
            na: "瑞穗乡"
        },
        {
            co: "713529",
            na: "富里乡"
        },
        {
            co: "713530",
            na: "秀林乡"
        },
        {
            co: "713531",
            na: "万荣乡"
        },
        {
            co: "713532",
            na: "卓溪乡"
        }]
    },
    {
        co: "713600",
        na: "澎湖县",
        ch: [{
            co: "713601",
            na: "马公市"
        },
        {
            co: "713621",
            na: "湖西乡"
        },
        {
            co: "713622",
            na: "白沙乡"
        },
        {
            co: "713623",
            na: "西屿乡"
        },
        {
            co: "713624",
            na: "望安乡"
        },
        {
            co: "713625",
            na: "七美乡"
        }]
    },
    {
        co: "713700",
        na: "金门县",
        ch: [{
            co: "713701",
            na: "金城镇"
        },
        {
            co: "713702",
            na: "金湖镇"
        },
        {
            co: "713703",
            na: "金沙镇"
        },
        {
            co: "713704",
            na: "金宁乡"
        },
        {
            co: "713705",
            na: "烈屿乡"
        },
        {
            co: "713706",
            na: "乌丘乡"
        }]
    },
    {
        co: "713800",
        na: "连江县",
        ch: [{
            co: "713801",
            na: "南竿乡"
        },
        {
            co: "713802",
            na: "北竿乡"
        },
        {
            co: "713803",
            na: "莒光乡"
        },
        {
            co: "713804",
            na: "东引乡"
        }]
    }]
},
{
    co: "810000",
    na: "香港",
    ch: [{
        co: "810100",
        na: "香港岛",
        ch: [{
            co: "810101",
            na: "中西区"
        },
        {
            co: "810102",
            na: "湾仔区"
        },
        {
            co: "810103",
            na: "东区"
        },
        {
            co: "810104",
            na: "南区"
        }]
    },
    {
        co: "810200",
        na: "九龙",
        ch: [{
            co: "810201",
            na: "油尖旺区"
        },
        {
            co: "810202",
            na: "深水埗区"
        },
        {
            co: "810203",
            na: "九龙城区"
        },
        {
            co: "810204",
            na: "黄大仙区"
        },
        {
            co: "810205",
            na: "观塘区"
        }]
    },
    {
        co: "810300",
        na: "新界",
        ch: [{
            co: "810301",
            na: "荃湾区"
        },
        {
            co: "810302",
            na: "屯门区"
        },
        {
            co: "810303",
            na: "元朗区"
        },
        {
            co: "810304",
            na: "北区"
        },
        {
            co: "810305",
            na: "大埔区"
        },
        {
            co: "810306",
            na: "西贡区"
        },
        {
            co: "810307",
            na: "沙田区"
        },
        {
            co: "810308",
            na: "葵青区"
        },
        {
            co: "810309",
            na: "离岛区"
        }]
    }]
},
{
    co: "820000",
    na: "澳门",
    ch: [{
        co: "820100",
        na: "澳门半岛",
        ch: [{
            co: "820101",
            na: "花地玛堂区"
        },
        {
            co: "820102",
            na: "圣安多尼堂区"
        },
        {
            co: "820103",
            na: "大堂区"
        },
        {
            co: "820104",
            na: "望德堂区"
        },
        {
            co: "820105",
            na: "风顺堂区"
        }]
    },
    {
        co: "820200",
        na: "氹仔岛",
        ch: [{
            co: "820201",
            na: "嘉模堂区"
        }]
    },
    {
        co: "820300",
        na: "路环岛",
        ch: [{
            co: "820301",
            na: "圣方济各堂区"
        }]
    }]
}];